[
    {
        "headline": "Wicked review – Cynthia Erivo and Ariana Grande make the magic happen",
        "trailText": "The stars enchant as young rival witches in Jon M Chu’s impossibly slick first instalment of his two-part adaptation of musical juggernaut Wicked",
        "bodyText": "There’s some kind of magic afoot. If, like me, you’re one of the very few people who hasn’t already seen the blockbuster stage musical Wicked (it’s the second-highest-grossing Broadway show of all time, so that’s an awful lot of bums on seats), you may approach this shiny, high-energy, relentlessly marketed movie adaptation with low to moderate expectations. There’s the unwieldy running time, for a start – two hours and 40 minutes – and the cynical, box-office-gouging decision to carve the story into two films (fans will have to wait almost a year to the day before they get to watch the concluding chapter). But here’s the thing: reservations are soon extinguished and grumbles about the release strategy swiftly quashed. Wicked matches its polished razzle-dazzle with real heart. Driven by knockout performances from Cynthia Erivo and Ariana Grande, Jon M Chu’s impossibly slick charm assault of an adaptation zips along so enjoyably that you almost wish it were longer (your bladder may disagree). With its all too timely themes of bullying, corrupt leaders and the demonisation of difference, this is a movie that promises a froth of pink and green escapism but delivers considerably more in the way of depth and darkness. For those who have somehow evaded Wicked’s cultural reach over the past couple of decades, here’s a brief primer. The film and the stage show are both loosely based on Gregory Maguire’s 1995 novel Wicked: The Life and Times of the Wicked Witch of the West, which offers an alternative backstory for the Wicked Witch from The Wizard of Oz. This film focuses on Wicked’s early years and two young witches-to-be: green-skinned outcast Elphaba (Erivo), who will go on to become the Wicked Witch of the West, and the vain, popular Galinda (Grande), who will eventually blossom into Glinda the Good. Both Elphaba and Galinda are newly arrived at Shiz University (think the student politics of Mean Girls’s North Shore High and the curriculum of Hogwarts). Although not enrolled as a student, Elphaba is on site to help her paraplegic younger sister, Nessarose (Marissa Bode). But the formidable teacher Madame Morrible (a haughtily fabulous Michelle Yeoh, breezing over any vocal limitations in a cloud of intimidating glamour) spots potential in Elphaba and offers her one-to-one tutoring in the art of enchantment. To the mutual disgust of both girls, Elphaba and Galinda find themselves assigned as roomies. It’s not just their personalities that clash: the film’s colour palette is at first a battleground between the chlorophyll green of Elphaba’s skin and the candyfloss pink of Galinda’s wardrobe. But visuals that initially seem jarring start to find harmony as the movie progresses. A scene in a forest full of mossy tuffets of vegetation and garlands of delicate, rosy blooms is lush and lovely, one of several notable triumphs for the production design department, led by Nathan Crowley, whose credits include the similarly lavish Wonka. Likewise, Elphaba and Galinda warm to each other and a genuine connection is forged between them. Both lead actors impress. Erivo is terrific, her rich, velvety voice cracking under the weight of rejections and ridicule suffered by Elphaba; her eyes showing the bruises that her skin cannot. And Grande is supremely well cast. It’s not just the voice: the singer has a vocal range so extensive that some of it is only audible to bats, and she uses every last note of it here. But more crucial is her gift for physical comedy – each flouncy hair toss, each ditsy heel kick, is a precision-tooled punchline. Elsewhere, Bridgerton’s Jonathan Bailey, as the shallow and self-absorbed Prince Fiyero, skips away with every one of his scenes – in particular, a dizzyingly complex song-and-dance sequence in the college library. Kudos, too, to the choreographer Christopher Scott for dreaming it all up, and to cinematographer Alice Brooks for capturing the magic. Does it all work? There are moments that get too caught up in their own whirl of CGI pageantry and empty spectacle. And certainly some scenes could be tightened up a little – it’s worth noting that the running time of this first film instalment is longer than the stage version in its entirety. But for the most part, Wicked the movie takes flight and lifts our hearts along with it. We’re caught in the slipstream of Elphaba and her knobbly and uncomfortable-looking broomstick as she whooshes off into the second half of the story. In UK and Irish cinemas",
        "web_url": "https://www.theguardian.com/film/2024/nov/24/wicked-the-film-review-cynthia-erivo-and-ariana-grande-jon-m-chu-part-one-1",
        "pub_date": "2024-11-24T08:00:07Z",
        "section_name": "Film",
        "tags": [
            "Musicals",
            "Film",
            "Culture",
            "Film adaptations",
            "Ariana Grande",
            "Cynthia Erivo",
            "Music",
            "The Wizard Of Oz",
            "Wicked"
        ]
    },
    {
        "headline": "Wicked review – Cynthia Erivo and Ariana Grande are a blast in sugar-rush Wizard of Oz fantasy",
        "trailText": "Stephen Schwartz’s musical prequel has been brought to the big screen, with Erivo’s charismatic Elphaba exerting a planetary pull over a star-studded cast",
        "bodyText": "As Kermit the Frog and the Hulk discovered: it’s not easy being green. Now another verdant character is gleefully brought to the screen by lyricist-composer-producer Stephen Schwartz, screenwriters Winnie Holzman and Dana Fox, and director Jon M Chu in an adaptation of Schwartz’s Broadway musical, the first of two parts. It’s a sugar-rush fantasy with the overpowering star presence of Cynthia Erivo; it basically dunks you face-down in a hyperreal ball pit of M&amp;Ms for two and three-quarter hours. I don’t have showtune-rapture in my DNA but this movie made a cleaner, sharper, cartoonier kind of sense to me than the stage show which I saw back in 2011. This film is the prequel origin myth for Schwartz’s emerald supervillain-hero, stratospherically upping her status in retrospect: the green-faced Wicked Witch of the West from the 1939 movie classic The Wizard of Oz, based on L Frank Baum’s children’s tale. It was a character shriekingly played in the original by Margaret Hamilton, terrorising Judy Garland’s Dorothy, and now we are given a backstory for the pointy hat, the broom-transportation, the inky cloak (though shrouding the protagonist’s biological father in mystery). It pulls off the cheeky trick of making us interested in someone we know is destined for an ignominious death by water. How did she get to be so mean? Could it be that what we interpret as meanness is a mythological distortion of strength and defiance? We see her early life as Elphaba, a green-skinned woman who shows up at the Shiz University for witches in Oz and has to share a room with a legally-blonde Insta princess, Galinda, who will grow up to be the Good Witch of the North. Both will have feelings for aristocratic classmate Prince Fiyero and both will meet their destiny on encountering the legendary, insidious Wizard of Oz himself. The Wizard is played with his usual drolly syncopated line-readings by Jeff Goldblum; Michelle Yeoh is stately school principal Madame Morrible; Jonathan Bailey uncorks an outrageous scene-stealer as the heterocamp Fiyero, a performance to put alongside Cary Elwes in The Princess Bride; and Andy Nyman is winningly melancholy as Elphaba’s dad, the governor of Munchkinland. (The film rather fudges the identity-issue of the munchkins, making them hardly different in height from the rest of the cast, perhaps due to contemporary views of the offensiveness of the original film’s Munchkins.) Ariana Grande plays Galinda, an almost translucent figure of gauzy delicacy, appearing as if perched on top of an invisible Christmas tree and though not a natural comic like Reese Witherspoon or Alicia Silverstone, she gets the laughs like the smart player she is. But the sledgehammer punch is delivered by Erivo as the wounded, angry, alienated Elphaba. In Sunset Boulevard, Norma Desmond famously said that the movies once only needed faces – and Erivo’s face is the ground zero of this film’s blast of entertainment power. She is the film’s Rushmore: charismatic, haughty and vulnerable. Her face exerts a planetary pull on everything else on screen and an impossible thing to look away from. She carries the big songs like The Wizard and I, and she and Grande are great in the mysterious scene in which Elphaba arrives at a party, is humiliated in her outfit, goes into a series of mysterious dance moves which may or may not be an attempt to style out some failed revenge-spell-castings and Grande’s Galinda finally joins her on the dancefloor mirroring her moves, the unlikely beginning to their friendship. It’s arguable if Wicked could ever be a meaningfully persuasive prequel for the characters in The Wizard of Oz as we actually see them in the 1939 film, as this would involve cancelling their powerfully timeless, mythological aura, and instead substituting the more banal idea of human development. But this is the joke, and this is the story, and what an enjoyable spectacle it is. • Wicked is out in the UK and US on 22 November, and in Australia on 28 November.",
        "web_url": "https://www.theguardian.com/film/2024/nov/19/wicked-review-cynthia-erivo-ariana-grande-wizard-of-oz-stephen-schwartz",
        "pub_date": "2024-11-19T20:00:16Z",
        "section_name": "Film",
        "tags": [
            "Film",
            "Musicals",
            "The Wizard Of Oz",
            "Film adaptations",
            "Books",
            "Culture",
            "Cynthia Erivo",
            "Ariana Grande",
            "Jeff Goldblum",
            "Musicals",
            "Music",
            "Pop and rock",
            "Stage",
            "Theatre",
            "Wicked"
        ]
    },
    {
        "headline": "Oscars pays tribute to Los Angeles after devastating wildfires: ‘The work continues’",
        "trailText": "Cynthia Erivo and Ariana Grande honor city in performance while host Conan O’Brien discusses fires in monologue",
        "bodyText": "Conan O’Brien briefly discussed the Los Angeles wildfires and “divisive politics” while delivering his opening monologue at the 97th Academy Awards. “The people of Los Angeles have clearly been through a devastating ordeal and this needs to be addressed,” O’Brien said. “In moments such as this, any awards show can seem self-indulgent and superfluous, but what I want to have us do is remember why we gathered here tonight.” He then celebrated those behind the scenes in Hollywood, like the “craftspeople, technicians, costumers” – the “hard-working men and women behind the camera who have devoted their lives to making film”. O’Brien continued: “Even in the face of terrible wildfires and divisive politics, the work, which this is about, the work continues. And next year, and for years to come, through trauma and joy, this seemingly absurd ritual is going to be here … the magic, the madness, the grandeur and joy of film worldwide is going to be with us forever.” To kick off the show, the broadcast from the city’s Dolby Theater opened with a shot of the Hollywood sign, with the voice of Judy Garland saying There’s No Place Like Home. The Wizard of Oz reference gave way to a montage of movie scenes filmed in Los Angeles, from Mulholland Drive to Barbie, La La Land to Iron Man, Her to Everything Everywhere All At Once, ending with the message: We &lt;3 LA. Cynthia Erivo and Ariana Grande, the stars of the Wizard of Oz prequel Wicked, continued the tribute with performances of Somewhere Over the Rainbow (Grande) and The Wiz’s Home (Erivo). The duo then joined forces for Wicked’s signature track, Defying Gravity, before Erivo took on the climax with a shot of the glittering LA skyline in the background. After their performance, O’Brien emerged from Demi Moore’s back in his monologue opener, paying homage to the grotesque visuals displayed in the Oscar-nominated film The Substance. “It’s Hollywood’s biggest night that starts at four in the afternoon,” said the comedian as he began. “But it’s the Oscars and I say let’s do this thing.” In his more than 10-minute speech, O’Brien poked fun at Netflix (“Netflix leads all studios with an impressive 18, count them 18, price increases”), Oscar-nominated films The Brutalist (“I loved The Brutalist, I really did. I didn’t want it to end. And, luckily, it didn’t.”) and Conclave (“A movie about the Catholic church, but don’t worry”), and actress Karla Sofía Gascón (“Anora uses the F-word 479 times. That’s three times more than the record set by Karla Sofía Gascón’s publicist”). O’Brien offered levity by taking aim, in small part, at Amazon. He said that founder Jeff Bezos had been seen on the red carpet, before panning over to a staged Amazon delivery driver throwing a package at the heels of an Oscar statue. He then noted that Bezos wasn’t seen inside the Dolby Theatre before panning back over to a man in black seemingly stealing the package that contained Bezos. After showing off some old headshots of Zoe Saldaña, Guy Pearce and a sonogram of Timothee Chalamet, O’Brien did a bit with Adam Sandler, who appeared in what has become his uniform these days: a hooded sweatshirt and basketball shorts. O’Brien concluded his monologue with a musical number where he repeatedly said he wouldn’t waste time all while dancing beside a sandworm from Dune 2 playing piano and a dancing Deadpool. Sunday night’s show marked the first time the late-night legend hosted the telecast. Fellow late-night host Jimmy Kimmel previously hosted the Academy Awards in 2017, 2018, 2023 and 2024, revealing last year that he had turned down a request to host in 2025. On the selection of O’Brien, the Academy chief executive officer, Bill Kramer, and the Academy president, Janet Yang, said in a statement that he was the “perfect person to help lead our global celebration of film with his brilliant humor, his love of movies, and his live TV expertise”. “His remarkable ability to connect with audiences will bring viewers together to do what the Oscars do best – honor the spectacular films and film-makers of this year,” they said. Later in the broadcast, O’Brien brought out a team of firefighters who braved the Los Angeles fires to the stage. “On behalf of everyone in greater los Angeles, thank you for all that you do,” he said, before introducing three of the Los Angeles fire department (LAFD) members to do some jokes of their own. Capt Eric Scott deadpanned: “Our hearts go out to all of those who have lost their homes and I’m talking about the producers of Joker 2.” Capt Jody Slicker took aim at the host himself, telling the audience: “It’s great to be back with Conan - usually when he calls, he’s stuck in a tree.” Read more about the 2025 Oscars: Anora takes home best picture Oscar Adrien Brody and Mikey Madison win best acting prizes Kieran Culkin and Zoe Saldaña win supporting awards Anora’s Sean Baker wins for directing, editing and screenplay",
        "web_url": "https://www.theguardian.com/film/2025/mar/02/host-conan-obrien-oscars",
        "pub_date": "2025-03-03T01:04:27Z",
        "section_name": "Film",
        "tags": [
            "Oscars",
            "Film",
            "Culture",
            "Ariana Grande",
            "Cynthia Erivo",
            "California wildfires"
        ]
    },
    {
        "headline": "Why Wicked should win the best picture Oscar",
        "trailText": "With its real tulips, real singing and real BFFs Ariande Grande and Cynthia Erivo front and centre, this musical is as authentic and credible as fantasy gets",
        "bodyText": "For the opening scene of Wicked, 9m real tulips were planted, improbably, by a farmer in Norfolk. The necessity of this opulence was completely obvious to director Jon M Chu and production designer Nathan Crowley – otherwise they’d have to use CGI for the Munchkin Village. Is CGI lush? Does it recall the heady, future-facing surge of hope and optimism that the original Oz has come to represent for, goddammit, almost a century? It does not. While it isn’t for the production values alone that Wicked deserves the best picture Oscar – anyone can spend money if they have enough money – take a second to consider the commitment of this film, and its impossibility. It tries to remain true to the moment when the world discovered Technicolor (sure, sure, come at me with The Toll of the Sea some other time); cheerfulness, magic, a naive faith in cinema and beyond – these are quite big asks in 2024, and Wicked went for it. It was partly in tribute to that quality of early musicals that Cynthia Erivo and Ariana Grande performed all the songs live; lip-syncing as an innovation has brought increased slickness to a movie’s sound quality, but at the expense of stripping out jeopardy and emotion from the human voice. Clearly, Erivo and Grande could both lift a building off its foundations with their vocals – the last thing you’d describe them as being is “fragile” – but it’s a “whites of their eyes” thing. You never realised you needed to see the muscles move in a singer’s throat to believe that they really mean it – yet it turns out, you do. If it were just down to Erivo or Grande’s performances, then obviously the case would be for best actress/support. But forget screen chemistry, these two are like an actual chemical reaction together – hydrogen and oxygen fusing to become something entirely new, with its own properties. It’s not completely fanciful that TikTok is convinced they’ve fallen in love in real life, nor that What Is This Feeling? is such a strong song, when it’s not actually the strongest song. They have multiple matching tattoos! They burst into tears whenever they see each other! To be honest, if ever there’s a musical on the Oscars shortlist, I would always lobby for that over a non-musical. People think the form is schlockier and therefore easier, but in fact it is better and therefore harder. The original musical which this adapts is a bit of a head-scratcher, to be honest – there are scores which you love instantly for obvious reasons (My Fair Lady, Cabaret), and ones that you love instantly for reasons you can’t figure out (Hamilton). Wicked is a grower, many of the melodies aren’t that catchy, often the motifs relate in ways you only realise after multiple listens. It’s the musical equivalent of going to a Pixies gig where they’re only going to play their latest album. You wouldn’t want to arrive at it cold. But, again, there’s that sense of confidence and commitment – let’s not make it shorter, to cater to the 21st-century attention span. Let’s split it in half, and make both halves unimaginably long. Everyone will fall for it, if they give it enough time. Time, we have (this first instalment is 2hrs 40min. I’ve seen it on the 22nd of every month since it came out, so I’m confident I could pass the GCSE). The dialogue is also sharp but unobtrusive. It’s not played for laughs, but when there is one (Jonathan Bailey, saying “I’ve been thinking”; Erivo replying, full of consternation: “I heard”), it stands out, elegantly. And Jeff Goldblum – whose high-camp shtick can be jarring to a plot, reminding you insistently that, whatever else is going on, that’s definitely Jeff Goldblum – has found his happy place, as the Wizard. Not wanting to be sacrilegious, the animal subplot didn’t make a whole lot of sense in the musical, which Stephen Schwartz, composer and lyricist, has acknowledged. Why would the Wizard want to empower the monkey army, in order to spy on the talking animals? Why not just maintain a monkey army in their non-flying state and just subjugate the rest of the animals some other way? “We wanted to ditch it because it was so confusing,” Schwartz said in 2000, adding “but so much of the plot hinges on it, so there is nothing that can be done.” The film has given Dr Dillamond, the talking goat, political resonance and emotional heft, introducing totalitarian overtones without which the central dilemma – does Glinda choose Elphaba or conventional society? – would fall apart. If it weren’t Elphaba v the fash, you’d automatically side with Glinda. She seems so nice, and Elphaba is green.",
        "web_url": "https://www.theguardian.com/film/2025/feb/27/why-wicked-should-win-the-best-picture-oscar",
        "pub_date": "2025-02-27T12:00:48Z",
        "section_name": "Film",
        "tags": [
            "Film",
            "Wicked",
            "Culture",
            "Oscars",
            "Awards and prizes",
            "Musicals",
            "Cynthia Erivo",
            "Ariana Grande",
            "Jeff Goldblum",
            "Jonathan Bailey"
        ]
    },
    {
        "headline": "Wicked storms into Oscar race with major National Board of Review win",
        "trailText": "The blockbuster musical was named best movie while Daniel Craig and Nicole Kidman picked up key acting prizes",
        "bodyText": "Blockbuster musical Wicked has launched into this year’s Oscar race with a major win from the National Board of Review. The adaptation of the Broadway hit was named best movie by the group whose picks are seen as a major indicator of Oscar success. “Wicked represents the pure magic that movies can bring to audiences,” said the NBR president, Annie Schulhof. “Every detail is beautifully crafted and designed, the actors are all exceptional and the music is second-to-none – together it adds up to a transporting experience like no other.” The film, starring Cynthia Erivo and Ariana Grande, has made over $356m worldwide since its release last month and has gained mostly positive reviews from critics. The Guardian’s Peter Bradshaw called it “an enjoyable spectacle”. Previous winners have included Killers of the Flower Moon, Green Book, Top Gun: Maverick, The Irishman and Da 5 Bloods. Wicked’s Jon M Chu was also named best director. His previous films have included Crazy Rich Asians and In the Heights. Daniel Craig was named best actor for his role in Luca Guadagnino’s Queer while Nicole Kidman was named best actress for her role in erotic drama Babygirl. A Real Pain’s Kieran Culkin and A Complete Unknown’s Elle Fanning won for supporting performances. The best ensemble award was handed to the cast of papal election thriller Conclave, best international film was won by The Seed of the Sacred Fig and best animated feature was Flow. The group’s 10 best films of the year, aside from Wicked in alphabetical order, are Anora, Babygirl, A Complete Unknown, Conclave, Furiosa: A Mad Max Saga, Gladiator II, Juror #2, Queer, A Real Pain and Sing Sing. Notable omissions include Emilia Perez, Nickel Boys and The Brutalist. The winners arrive as Oscar season heats up. Earlier this week, the New York Film Critics Circle awarded The Brutalist the award for best film and best actor for Adrien Brody while Hard Truths’ Marianne Jean-Baptiste was named best actress. On Monday, the Gothams named A Different Man best film while acting awards were won by Sing Sing’s Colman Domingo and Clarence Maclin. This week also saw the Independent Spirits announce nominations with Anora and I Saw the TV Glow leading the field. Next week sees the announcement of the Golden Globe nominations with the ceremony taking place on 5 January.",
        "web_url": "https://www.theguardian.com/film/2024/dec/04/wicked-oscar-race-national-board-of-review",
        "pub_date": "2024-12-04T19:47:35Z",
        "section_name": "Film",
        "tags": [
            "Wicked",
            "US news",
            "Daniel Craig",
            "Nicole Kidman",
            "Film",
            "Cynthia Erivo",
            "Musicals",
            "Ariana Grande",
            "Culture",
            "Awards and prizes"
        ]
    },
    {
        "headline": "Wicked fans ‘couldn’t be more thrilled’ as blockbuster musical opens worldwide",
        "trailText": "Hugely anticipated adaptation of the Broadway hit starring Ariana Grande and Cynthia Erivo is estimated to rake in $200m at the global box office",
        "bodyText": "What is this feeling? After years of speculation, more casting rumors than Oz’s population of flying monkeys, a production ripe for tabloid fodder, and a massive marketing and promotion machine worthy of a wizard himself, Universal’s epic musical Wicked has finally walked the yellow brick road that leads into theaters. On Thursday night the first official screenings unfolded around the US, including at New York City’s AMC Empire 25, the multilevel cathedral to cinema just off Times Square. It proved to be perfect moviegoing weather outside: absolutely miserable with hard, cold rain. Inside, there was a palpable energy with superfans lining up for one of the theater’s whopping 32 screenings of the film to handle demand, with box office tracking estimating the movie will “win over the world” with a massive global opening set to hit about $200m (the film made over $19m in US previews last night, not far off Barbie’s $22m in 2023). Audiences are no doubt encouraged by the movie’s reviews. Much like gazing at the sparkling Emerald City itself, critics seem to be in universal awe. “If it feels like they made the best Wicked movie money could buy,” said the Associated Press’s Jocelyn Noveck. “Well, it’s because they kinda did.” The Guardian’s own Peter Bradshaw marveled, “What an enjoyable spectacle it is,” while Vanity Fair’s Richard Lawson went so far to say the film stands as an “unreproducible, lightning in a bottle convergences of director, stars, craftspeople, and high-status material”. Gabby and Rachel, friends from Brooklyn who trekked to this AMC despite the windy downpour, wore pink and green, a play on the film’s prominent colors. “We’re excited, but we’re not superfans,” they pointed out, noting a desire to participate in a cultural moment akin to Barbie. “We’re here for the Twitterness of it all.” Meanwhile, Travis from nearby Queens showed up dressed in a witch’s hat and black mesh top and shorts. “I remember I saw the musical in previews when I was in eighth grade when nobody knew what it was or what it was going to be,” he said. “I’ve probably been insufferable because I’ve been listening to the soundtrack non-stop. I couldn’t be more thrilled.” It’s all not for a lack of trying. Stephen Schwartz’s opus first premiered on stage back in 2003, and the 1995 novel he based that on (Wicked: The Life and Times of the Wicked Witch of the West) was originally going to be a movie itself. By 2012, Universal came on board with an original release date of 2019. That was shifted, then the pandemic didn’t help things move along any more quickly. After Jon M Chu (known for Crazy Rich Asians and his adaptation of In the Heights) was announced to direct in 2021, the show’s diehard fanbase waited with bated breath for casting news as the film found itself as one of the buzziest projects in Hollywood. Lady Gaga, Shawn Mendes and even Jennifer Lopez are all rumored to have been vying for roles. The film-makers wound up settling on a potent duo: in one corner is Ariana Grande, the pop star who put her music career on hold for the role of Glinda, originated by Kristin Chenoweth. “When something once in a lifetime, like this, happens, every single second counts,” Grande said in a recent interview of her decision to put all of her musical eggs in the Wicked basket. In the other is Cynthia Erivo as Elphaba, originated by Idina Menzel. At the time of her casting, Erivo, who was perhaps best known for her Tony-winning role in The Color Purple as well as her eponymous turn as Harriet (Tubman), said she didn’t even think she’d be considered in the first place. “Historically, Black women have never really been seen for the role,” she recently said. “If they have, they haven’t gotten the role, and if they do, they usually are the alternate or first cover.” The combination of Grande and Erivo has also energized the film’s aforementioned, all-encompassing press blitz which not only featured a much-talked about Super Bowl spot (the public’s first sneak peek) but collaborations with brands such as H&amp;M and REM Beauty as well as Wicked-branded Rice Krispie treats, Betty Crocker mix and even Walmart’s curious Wicked macaroni and cheese, which teases a mystery color (naturally, pink or green). Here at the AMC theater, not only were there branded Wicked popcorn buckets, but audiences could also slurp down an Enchanted Green Apple Icee inspired by the film. That’s not to say there were some awkward moments along the way, from Erivo’s admonishment of a seemingly innocent fan-altered poster (“This is the wildest, most offensive thing I have seen”) to the tabloid fodder concerning Grande and co-star Ethan Slater’s scandalous on-set romance. Then there’s the tragedy that some fans have been, gasp!, singing along at advance screenings, prompting warnings from theater owners. Inside the theater for my 7pm showing, after previews the lights went down for a custom welcome package from the Wicked cast as the audience cheered. “No singing, no wailing,” Grande and Jeff Goldblum, who plays the Wizard, could be heard saying. Naturally, they applauded again for Nicole Kidman’s viral ode to film (“Somehow, heartbreak feels good in a place like this”). Finally, after 21 years of anticipation, the film began and a title card eventually appeared: Wicked: Part One. Yes, there’s another film flying down to theaters in exactly one year from this day; a polarizing choice that screamed money grab to some and “the more, the better” to others. For the superfans I spoke to, everyone was well aware, and pleased, there would be no final resolution by the end of its 160-minute runtime. While audience members at my screening dutifully followed the no-singing rule, they did clap and hoot vociferously after almost every musical number and throughout a set of surprise cameos. So what did the diehards think after the screening? “Ten out of ten,” said Travis, still in his black witch hat. John, another fan from New York, agreed. “I think they nailed it from top to bottom. I think it’s better in some ways than the musical.” And in case audiences didn’t get enough, venturing to the subway underneath the theater you’ll find that Universal Pictures even teamed up with the MTA, with the entrance plastered entirely with pictures of the cast. Only 364 days until Part Two.",
        "web_url": "https://www.theguardian.com/film/2024/nov/22/wicked-movie-ariana-grande-cynthis-erivo",
        "pub_date": "2024-11-22T16:29:33Z",
        "section_name": "Film",
        "tags": [
            "Musicals",
            "Ariana Grande",
            "Cynthia Erivo",
            "US news",
            "Universal Pictures",
            "The Wizard Of Oz",
            "Film",
            "Broadway",
            "Culture",
            "Music",
            "Stage",
            "Theatre",
            "US theater",
            "Wicked"
        ]
    },
    {
        "headline": "‘Holding space’: Wicked has made the term famous. But what does it mean? ",
        "trailText": "In the earnest press tour for the film, actor Cynthia Erivo was in tears at the idea that fans were ‘holding space’ for the song Defying Gravity. But is it more self-help jargon or something more powerful?",
        "bodyText": "The journalist Tracy E Gilchrist had just four minutes with the Wicked actors Cynthia Erivo and Ariana Grande – and she had to make them count. She just didn’t bargain on becoming part of one of the year’s most-used memes as a result of saying the phrase “holding space”. “I just went in and did my job, which was to try to get an authentic answer to a question in a very short amount of time,” she says. “It felt like the right term for what I was trying to get across to Cynthia, which is the idea that you can interact with a work of art like Defying Gravity and feel something within yourself.” In the interview – a standard junket affair of rotating film journalists – Gilchrist, teeing up her question, informs Erivo that “people are taking the lyrics of Defying Gravity and really holding space with that and feeling power in that”. If the comment itself was slightly left-field, Erivo’s teary response was even more so. “That’s really powerful,” said the British actor, who plays the lead role, Elphaba, in the screen adaptation of the stage musical. “That’s what I wanted,” she added, as her co-star Grande gripped her index finger. It was the latest stop on an exaggeratedly earnest press tour that has included the actors revealing matching lyric tattoos on Kelly Clarkson’s talkshow. Gilchrist’s question reflected the rise in popularity of the phrase “holding space”, a companion term to popular self-help concepts such as “emotional bandwidth” and “drawing boundaries”. But what does it actually mean? And how do you hold it for the lyrics of a 20-year-old Stephen Schwartz musical number? “To me, it means to be in the moment,” says Gilchrist, who was working for Out magazine. “To be fully open to something and to not be cynical. To hear something – maybe a song like Defying Gravity that you have heard hundreds of times – and to have it hit you in a new way.” So just sort of … being there? “If it was a few years ago, I might have said ‘people are feeling seen’,” she says. “You can feel seen by a work of art, or a song, or another person, so I think it can be very similar.” Heather Plett, a Canadian writer and coach who runs a workshop on holding space on Vancouver Island, says it’s a concept that she has been workshopping for 15 years. “The way I define it is that it’s a practise that we do when we show up for another person in support of whatever they’re going through. We do that without judgment, or without trying to layer our own story on to theirs, and we offer them compassion and support while allowing them to have their own sovereignty.” The etymology of the term is hazy, but it may have something to do with Donald Winnicott’s writing on the maternal holding environment in the 1950s and 1960s – or what would probably be called, in 2024 parlance, a safe space. Lesley Caldwell, a psychoanalyst and honorary professor at University College London, says: “Holding relates both to the question of what happens in an analytic session and what the analyst provides [for a patient]. It is also derived from the idea of what a mother does with a baby – though we might now extend that to the caregiver. The question is: what are the conditions in which a safe space is established and how can that continue to be established internally by someone as a result of the early infant care they experience?” It’s hardly the first instance of therapy-speak bleeding into everyday conversation – “inner child” and “repression” hark back to Freud. “There are quite a lot of phrases like this, for example: ‘This is triggering,’” says Peter Kinderman, a professor of clinical psychology at the University of Liverpool. “It’s using psychological jargon in everyday life to confuse.” “I think we feel that if we have a specialist term for something that it legitimises it,” says Hazel Price, a lecturer in English language at the University of Salford, who first encountered the term in a neonatal group. “We tend to use expert language because it somehow legitimises something that actually isn’t rooted in any kind of rigorous evidence.” But Benjy Kusi, a 29-year-old inclusion and wellbeing consultant, insists that some in the LGBTQ+ community have been using it for years. “I would say in the queer spaces I’m in that it’s used quite often. I facilitate workshops in regard to topics like anti-racism and LGBTQ+ inclusion, and in such sessions I hold space for people to share their lived experiences.” Is any phrase bad – even if it’s jargon – if it encourages compassion? “I’m just happy that we are having some joy and that most people are coming together as a community and having fun with it,” says Gilchrist. She doesn’t regret asking the question.",
        "web_url": "https://www.theguardian.com/film/2024/nov/28/holding-space-wicked-has-made-the-term-famous-but-what-does-it-mean",
        "pub_date": "2024-11-28T10:48:45Z",
        "section_name": "Film",
        "tags": [
            "Wicked",
            "Psychology",
            "Psychology",
            "Cynthia Erivo",
            "Ariana Grande",
            "Film",
            "The Wizard Of Oz",
            "Culture",
            "Education",
            "Science",
            "LGBTQ+ rights"
        ]
    },
    {
        "headline": "Cinema singalongs: is it OK for Wicked fans to belt out all the tunes?",
        "trailText": "Fans of the Wizard of Oz-inspired musical have reportedly been warbling songs during early screenings – but not everyone is best pleased",
        "bodyText": "Name: Cinema singalongs. Age: Hard to tell the exact origin but the most recent example is just days old. Appearance: Like a film, but with a badly malfunctioning soundtrack. You mean singing along to a movie in the cinema? Yes, exactly. You can’t do that. Not normally, no. Not ever! It’s the most antisocial thing I’ve ever heard of. But what if you just can’t help yourself? Then you should see a doctor. And stay out of cinemas. Fans beg to differ. Fans of what? Fans of Wicked, the Wizard of Oz-inspired stage musical, which has now been released as a film. They love the songs so much – and know them so well – they have reportedly been belting them out during early screenings. If they were real fans, they would show more respect to … erm … To Ariana Grande and Cynthia Erivo, the stars of the film? Yes, but also to other audience members, who paid to hear Grande and Erivo, not some random person two rows back. Management agrees with you: cinemas in the US have put up signs asking the audience to refrain from singing along. Glad to hear that the rules still matter. Not everyone supports the policy, however. “Sing! You’ve paid your hard earned money for a ticket, and you’ve gone into a musical, and you’re into it,” said ex-wrestler Dwayne “The Rock” Johnson. I must say, I didn’t expect to hear him weigh in on the matter. Perhaps you weren’t aware that Johnson voices the character Maui in the animated Disney musical Moana, whose sequel premiered this weekend. Does the Moana franchise face the same issue? It could do – the original was beloved and a live-action remake is in the works. I now feel caught between The Rock and a hard place. Is there a solution? North American cinema chains have already announced special singalong screenings of Wicked, where joining in will be welcomed. Has such a thing ever been tried before? It has. In 1999 there was Sing-a-Long-a Sound of Music, an audience participation version of the 1965 film with subtitled lyrics. And that was a success? Yes, one that was repeated with many other films: Sing-a-Long-a still tours British cinemas with similarly adapted versions of Grease, Encanto, Dirty Dancing and The Greatest Showman. Although I hate to see this sort of thing encouraged, I accept a compromise is called for. When can I start avoiding singalong screenings of Wicked? You’re safe until Christmas. Do say: “Good news! She’s dead! The Wicked Witch of the West is dead!” Don’t say: “Can I bring my dog? He loves singing along to stuff.”",
        "web_url": "https://www.theguardian.com/film/2024/nov/25/cinema-singalongs-is-it-ok-for-wicked-fans-to-belt-out-tunes",
        "pub_date": "2024-11-25T14:04:13Z",
        "section_name": "Film",
        "tags": [
            "Wicked",
            "Film",
            "Life and style",
            "Musicals",
            "US news",
            "Cynthia Erivo",
            "Ariana Grande"
        ]
    },
    {
        "headline": "What time are the 2025 Oscars?",
        "trailText": "The biggest night in film takes place on Sunday. Here’s how to watch or stream the ceremony in the US",
        "bodyText": "The biggest night in film, the 95th Academy Awards, is happening this Sunday, and with it the ultimate prizes the industry can bestow on its peers. Here’s what to know about the Oscars and how to watch it live. When are the Oscars? The 97th Academy Awards ceremony is scheduled for Sunday 2 March. The awards start at 7pm ET (4pm PST), or midnight in the UK and 11am in Sydney, Australia. How to watch the Oscars The event will be broadcast live on ABC and streaming on Hulu. Cable subscribers can also access the show online at abc.com and in the ABC app. Here’s how to watch outside the US. What time does the red carpet start? To catch A-list celebrities and their outfits, viewers can tune in to the red-carpet shows starting at 3.30pm ET on ABC and Hulu. Julianne Hough and Jesse Palmer, hosts of Dancing With the Stars and The Bachelor, will helm live coverage from the red carpet. Who is hosting the Oscars? Conan O’Brien, the former late-night host and comedian, will be taking charge of this Sunday’s Oscars. He’s taking over from Jimmy Kimmel, who has hosted the ceremony four times since 2017. Asked why he decided to accept the hosting gig, Conan, after joking about the appeal of the gig’s paycheck, explained that the “the Oscars has meaning”. “Really good cinema – especially when it’s from different countries, different points of view – has an incredible amount of resonance and importance right now, and this is the night that celebrates that. To be a part of it is meaningful to me,” he told the New York Times. What’s in the Oscars goody bags? In light of the devastating California wildfires, the marketing company behind the goody bags handed out at Oscars has tweaked its offerings, with key inclusions reflecting the disaster. The bag includes more than $1m worth of personalised disaster recovery services, the offer of complimentary home renovation project management and cannabis products, among other treats. Who is performing? The ceremony will not feature the traditional performances of the best song nominees. Instead, the lineup of performers will include Cynthia Erivo and Ariana Grande, Queen Latifah, Doja Cat, Lisa of Blackpink and Raye. What movie has the most Oscar nominations? Emilia Pérez received 13 nominations at this year’s Oscars – the most of any film and a record for the most nominations ever earned by a non-English-language film. The films’ nominations put it ahead of both Crouching Tiger, Hidden Dragon in 2001 and Roma in 2018, both of which garnered 10 nods. What else is nominated? Just behind Emilia Pérez in total nominations are The Brutalist and Wicked, which both secured 10 nominations including in the biggest category of the night. Here’s a look at the nominations for the five biggest Oscars prizes. Best picture Anora The Brutalist A Complete Unknown Conclave Dune: Part Two Emilia Pérez I’m Still Here Nickel Boys The Substance Wicked Read out best picture Oscar guide Best actor Adrien Brody, The Brutalist Timothée Chalamet, A Complete Unknown Colman Domingo, Sing Sing Ralph Fiennes, Conclave Sebastian Stan, The Apprentice Read our best actor guide Best actress Cynthia Erivo, Wicked Karla Sofía Gascón, Emilia Pérez Mikey Madison, Anora Demi Moore, The Substance Fernanda Torres, I’m Still Here Read our best actress guide Best supporting actor Yura Borisov, Anora Kieran Culkin, A Real Pain Edward Norton, A Complete Unknown Guy Pearce, The Brutalist Jeremy Strong, The Apprentice Best supporting actress Monica Barbaro, A Complete Unknown Ariana Grande, Wicked Felicity Jones, The Brutalist Isabella Rossellini, Conclave Zoe Saldaña, Emilia Pérez Best directing Sean Baker, Anora Brady Corbet, The Brutalist James Mangold, A Complete Unknown Jacques Audiard, Emilia Pérez Coralie Fargeat, The Substance Read our best director guide Find the full list of all the nominees here. Read more about the 2025 Oscars: Anora takes home best picture Oscar Adrien Brody and Mikey Madison win best acting prizes Kieran Culkin and Zoe Saldaña win supporting awards Anora’s Sean Baker wins fordirecting, editing andscreenplay",
        "web_url": "https://www.theguardian.com/film/2025/mar/02/watch-stream-oscars-academy-awards-time-us",
        "pub_date": "2025-03-02T08:00:04Z",
        "section_name": "Film",
        "tags": [
            "Oscars",
            "Film",
            "Cynthia Erivo",
            "Ariana Grande",
            "Doja Cat",
            "Emilia Pérez",
            "The Brutalist",
            "Wicked",
            "Anora",
            "A Complete Unknown",
            "Conclave",
            "The Substance",
            "Culture"
        ]
    },
    {
        "headline": "Wicked, A Complete Unknown and Shôgun lead Screen Actors Guild nominations",
        "trailText": "This year’s SAG noms see a strong showing for music-led films while Nicole Kidman, Denzel Washington and Angelina Jolie are snubbed",
        "bodyText": "Music-led films Wicked and A Complete Unknown and TV shows Shôgun and The Bear lead this year’s Screen Actors Guild nominations, it was announced this morning. Blockbuster musical Wicked heads up the film side with five nominations including for actors Cynthia Erivo, Ariana Grande and Jonathan Bailey, as well as the ensemble. It was also nominated for stunt ensemble. The film, based on the long-running Broadway hit, has made more than $680m at the global box office. The Bob Dylan biopic A Complete Unknown was next with four nods, for actors Timothée Chalamet, Edward Norton and Monica Barbaro, as well as the ensemble. The ensemble award, seen as the biggest of the night, will see the two films compete alongside Anora, Conclave and Emilia Pérez. In the best actress category, Erivo will face The Last Showgirl’s Pamela Anderson, Anora’s Mikey Madison, The Substance’s Demi Moore and Emilia Pérez’s Karla Sofia Gascon. The category saw major snubs for Nicole Kidman, Angelina Jolie and Marianne Jean-Baptiste. In the best actor category, Chalamet faces Queer’s Daniel Craig, Conclave’s Ralph Fiennes, Sing Sing’s Colman Domingo and The Brutalist’s Adrien Brody. Sebastian Stan failed to make the cut for either The Apprentice or A Different Man. For supporting actress, Grande and Barbaro will compete alongside The Piano Lesson’s Danielle Deadwyler, The Last Showgirl’s Jamie Lee Curtis and Emilia Pérez’s Zoe Saldana. Notable absences in this category include Isabella Rossellini, Selena Gomez and Felicity Jones. For supporting actor, Norton and Bailey face A Real Pain favourite Kieran Culkin, Anora’s Yura Borisov and The Apprentice’s Jeremy Strong. Gladiator II’s Denzel Washington and The Brutalist’s Guy Pearce were both snubbed. The TV categories were led by acclaimed historical epic Shôgun, which scored five nominations, followed by The Bear, with four, and The Diplomat, with three. The drama ensemble category will see Shôgun and The Diplomat face off against Slow Horses, Bridgerton and the first season of The Day of the Jackal. The comedy ensemble has The Bear competing with Hacks, Abbott Elementary, Only Murders in the Building and Shrinking. The lead actor in a drama series category is led by Shôgun favourite Hiroyuki Sanada, who has already won an Emmy and Golden Globe for his role, alongside his co-star Tadanobu Asano, Slow Horses’ Gary Oldman, The Day of the Jackal’s Eddie Redmayne and The Old Man’s Jeff Bridges. The lead actress in a drama category is led by another Shôgun favourite, Anna Sawai, a winner of both an Emmy and a Golden Globe, who will compete with The Diplomat’s Keri Russell and Allison Janney, Matlock’s Kathy Bates and Bridgerton’s Nicola Coughlan. Bates has also scored a nomination in the lead actress in a TV movie or limited series category for The Great Lillian Hall, where she faces Cate Blanchett for Disclaimer, Jodie Foster for True Detective: Night Country, Lily Gladstone for Under the Bridge, Cristin Milioti for The Penguin and Jessica Gunning for Baby Reindeer. Gunning’s co-star Richard Gadd leads the lead actor in a TV movie or limited series lineup next to Disclaimer’s Kevin Kline, Ripley’s Andrew Scott, The Penguin’s Colin Farrell and Monsters’ Javier Bardem. The category of lead actress in a comedy series is led by two stars of The Bear – Ayo Edebiri and Lisa Colón-Zayas – who face Hacks favourite Jean Smart, Abbott Elementary’s Quinta Brunson and Kristen Bell for the first season of Netflix breakout Nobody Wants This. Bell’s co-star, Adam Brody, leads the male equivalent lineup alongside A Man on the Inside’s Ted Danson, Shrinking’s Harrison Ford, The Bear’s Jeremy Allen White and, beating out his co-star Steve Martin, Only Murders in the Building’s Martin Short. The ceremony will take place on 23 February with host, and nominee, Kristen Bell. This morning’s planned in-person announcement, set to be led by actors Joey King and Cooper Koch, was cancelled in response to the California wildfires with a press release sent out instead. More than 30,000 people are now under an evacuation order and Hollywood has seen a number of film and TV premieres also cancelled. The announcement comes just days after The Brutalist, Emilia Pérez, Shôgun and Hacks picked up major awards at the Golden Globes with actors including Demi Moore, Adrien Brody, Jean Smart, Kieran Culkin and Colin Farrell among the winners. Last year’s awards were led by major wins for Oppenheimer, Succession and The Bear. This year’s Oscar nominations will be unveiled on 17 January.",
        "web_url": "https://www.theguardian.com/culture/2025/jan/08/screen-actors-guild-nominations",
        "pub_date": "2025-01-08T16:48:38Z",
        "section_name": "Film",
        "tags": [
            "Screen Actors Guild awards",
            "Awards and prizes",
            "US television",
            "Film",
            "Television",
            "The Brutalist",
            "Emilia Pérez",
            "Television & radio",
            "Culture",
            "US news",
            "The Bear",
            "Ariana Grande",
            "Zoe Saldaña",
            "Daniel Craig",
            "Colin Farrell",
            "Andrew Scott",
            "Baby Reindeer",
            "Cynthia Erivo",
            "Jonathan Bailey",
            "Ralph Fiennes",
            "Conclave"
        ]
    },
    {
        "headline": "‘Oz as a high-fashion, elitist society’: how Wicked made musicals chic",
        "trailText": "The high-couture styles of the film version of the hit show reflect a trend of designer daring on the stage",
        "bodyText": "Musicals used to be associated with glee club kids more likely to be wearing jazz shoes than anything cutting edge from the catwalks. But with the film version of Wicked – which was released this weekend and was expected to take more than $100m (£80m) at the US box office alone – promoted by global pop star Ariana Grande and actor Cynthia Erivo wearing Vivienne Westwood, Schiaparelli and Louis Vuitton, musicals are having a pitch-perfect style moment. Even before it opened, there was a glut of Wicked collaborations across skincare, haircare and hoodies – more than 400 in total, including Gap, Kipling, Crocs, H&amp;M, Claire’s Accessories and Marks &amp; Spencer. Fancy London department store Liberty, with its tasteful Tudor-beamed building, has teamed up with Universal Pictures to make over its windows Wicked-style. Ryan McBryde, former artistic director at the Mercury theatre in Colchester, who has worked on many musicals, said: “Oz is depicted in Wicked as a kind of high-fashion, elitist society. They’re all dressing in high couture.” He added: “It makes perfect sense that those companies should buy into that.” That a musical – albeit one in the cinema rather than on stage – is having such a jazz-hands fashion moment arguably reflects a wider trend. On Broadway, a revival of Sunset Boulevard, starring former Pussycat Doll Nicole Scherzinger, has received attention for what the Washington Post called its “Jil Sander-chic costumes”. The costumes of Cabaret at London’s Kit Kat club – the leather, the lingerie – all could have seamlessly sashayed on to spring/summer 2024 catwalks. Plus, Prada and Chanel are centre stage with the new musical of The Devil Wears Prada that recently opened in London’s West End. Red carpets have for a long time been fashion’s best marketing tool, while costume designers use contemporary fashion as a way to connect to audiences and welcome new ones in. David Benedict, the London theatre critic for Variety, notes that “[costume] designers are looking to place things in a way that people can read”. Soutra Gilmour, who was the costume designer for Scherzinger’s Sunset Boulevard, wants “the people on stage to reflect and speak to the people in the audience, to be of the same world, to connect through the proscenium”. Clothes, she says, “are a great way to support that – it’s a language we all read very quickly”. Enver Chakartash is to thank for the fashion-forward ensembles of Romeo + Juliet, now on Broadway. While it is not strictly speaking a musical, Jack Antonoff, songwriter and producer of Taylor Swift and Sabrina Carpenter, wrote two original songs for the show. “It was important for the costumes to feel of-the-moment in terms of how young people present themselves,” says Chakartash. Hence why those costumes include Ludovic de Saint Sernin and Adidas, as well as Vaquera and Salomon. For the balcony scene, they dressed Juliet in a vintage Vivienne Westwood Care Bear T-shirt. While McBryde points out that musicals “always had a kind of relationship with modern fashion” – he cites Coco Chanel working with Jean Cocteau in the 1920s and Halston working with Martin Scorsese on The Act with Liza Minnelli in the 1970s – he thinks that “the difference between then and now is the proliferation of imagery that you can get on the internet”. Crossover between the two worlds is happening more and more: Es Devlin has designed for musicals as well as for Stormzy, Lorde, Beyoncé, Louis Vuitton and YSL. Tom Scutt, the designer responsible for the Cabaret costumes, has worked with Sam Smith. Of course some of this fashionable moment for musicals might also be down to chance. That the recent West End production of Oklahoma! felt so on trend was in part thanks to the rise of cowboycore. Still, there is a drive for modernity within musicals. “Everybody wants to do a take on the show that hasn’t been done before,” says Chakartash. “A lot of the time that leans into making it feel contemporary and relatable and also aspirational. “When you go to Cabaret, you’re like: ‘Where can I find that seafoam-green coat that looks like [it’s] straight off the Gucci runway?’” When you go to Wicked, you leave wanting to find emerald green, pastel pink and bubble skirts.",
        "web_url": "https://www.theguardian.com/fashion/2024/nov/24/oz-as-a-high-fashion-elitist-society-how-wicked-made-musicals-chic",
        "pub_date": "2024-11-24T12:00:12Z",
        "section_name": "Fashion",
        "tags": [
            "Fashion",
            "Musicals",
            "Life and style",
            "Theatre",
            "Stage",
            "Ariana Grande"
        ]
    },
    {
        "headline": "Saldaña squished and Chalamet chafing as Ariana and Cynthia bag the best seats: the 2025 Oscars class photo",
        "trailText": "The Academy Award nominees assembled for their annual group portrait, but who scooped the prize for looking the most bored?",
        "bodyText": "Every year during Oscars week, it has become tradition for all the nominees to meet up and eat a meal together. This is usually followed by a group photo; something that the people in attendance can look back upon and cherish, knowing that for this one moment all competition fell away and they found joy in surrounding themselves with their gifted colleagues. At least that’s the idea. As anyone who has ever been in a group photo will attest, these things are an absolute mess. There are simply too many people to control, and the resulting image is generally a free-for-all of weird costumes, odd expressions and seemingly hostile body language. As such, let’s use this year’s Oscars class photo to hand out some awards of our own. Most recognisable: Cynthia Erivo and Ariana Grande (front row, centre) This is less a category, more a shameful admission. The Oscars are the biggest night of the movie-industry calendar, and I make a living from writing about the movie industry, and yet I do not know who most of these people are. If this photo proves anything, it’s that the films you enjoy are often made by people so anonymous that you wouldn’t give them a second look if they tripped over a bag on a bus. So thank God for the stars of Wicked, Ariana Grande and Cynthia Erivo, for at least making an effort. Yes, it helps that they’re among the most famous people in the room. Yes, it helps that they’re sitting in the front row. Yes, it helps that they seem to have dressed expressly for the purpose of standing out in a group photo, and seem much happier to be there than anyone else. But mainly, it helps that I know who they are. Congratulations! Most keen to distance themselves from all this: Timothée Chalamet (third row from back, far left) Forget anything I said about this photo being a chummy opportunity for the participants to demonstrate that they are part of a wider community. Honestly, just look at the body language on Chalamet here. His face is a tight rictus grin of reluctance. He is leaning away from his neighbour with his entire torso, the way you would if a foul-smelling stranger plonked themselves next to you on a park bench. Most strangely, he seems to be raising a fist, as if he’s getting ready to punch his way out of the room. The poor boy seems to be having a nightmare. Least able to look at the camera: James Mangold (second row from back, far right) James Mangold, your job is literally photographing people. You’ve become one of our finest film-makers because you are good at taking people and getting them to stand in the correct poses in front of a camera. And yet look at you. Everyone else is looking at the photographer, but not you. You’re staring at the guy in front of you, lost in a world of your own. Would it kill you to tilt your chin up a little bit? You have no choice but to make another good film this year so you can try to look at the camera properly when this picture is taken again a year from now. Oddest squish: Zoe Saldaña and Mikey Madison (front row, left of centre) It’s genuinely hard to say what’s going on here. Most of those in attendance get to sit in regular cinema seats, except for a few people at the front who are sitting on chairs that have been placed in the spots reserved for wheelchair users. Four people sit in four chairs placed on the right-hand side of the photo. Four chairs also appear to have been placed on the left-hand side, yet five people are sitting there. Indeed, Andrew Watt, Zoe Saldaña and Mikey Madison appear to be squeezed on to just two seats. Why is this? There are plenty of empty seats elsewhere in the auditorium. One of them could have gone to sit next to Chalamet. It might have even cheered him up a bit. My guess is that someone threw a gigantic fit about their allotted seat placement and crammed themselves into the front row, to the discomfort of those around them. The question is: who? Most visibly bored: Diane Warren (fourth row, sixth from right) Another year for Diane Warren, another nomination for a song in a film that nobody has heard of. Another looming Oscar night bound to end in disappointment. Warren’s entire aura is screaming, “Let’s just get this over and done with.” And who can blame her? Most needless Muppet death: unknown subject (front row, third from right) Sorry lady, I don’t know who you are, but Elmo did not deserve to end his life for this. • This article was amended on 26 February 2025 to remove text that was based on a misidentification and included in error.",
        "web_url": "https://www.theguardian.com/film/2025/feb/26/oscars-group-photo-timothee-chalamet-zoe-saldana-ariana-grande-cynthia-erivo",
        "pub_date": "2025-02-26T13:04:20Z",
        "section_name": "Film",
        "tags": [
            "Oscars",
            "Film",
            "Wicked",
            "Cynthia Erivo",
            "Ariana Grande",
            "Timothée Chalamet",
            "Mikey Madison",
            "Anora",
            "Zoe Saldaña",
            "Awards and prizes",
            "Culture"
        ]
    },
    {
        "headline": "Wicked would be fun and forgettable but for the alt-right waging its dark arts against it | Kate Maltby",
        "trailText": "Digital crusade by anti-woke warriors against a vapid film for teen girls should be sending a wake-up call to Hollywood",
        "bodyText": "The “war on woke” has a new target and her name is the Wicked Witch of the West. If you’re a fan of the musical Wicked, you’ll also know her as Elphaba, the moniker imagined by Gregory Maguire in his 1995 prequel to L Frank Baum’s The Wonderful Wizard of Oz. As played by Margaret Hamilton in the 1939 movie, she was the nemesis of Judy Garland’s Dorothy; as played this year by the musical theatre star Cynthia Erivo, she has conservative men across Britain and America bursting their blood vessels. Since Maguire came up with his novel – an extravagant piece of fan-fiction that suggests this “witch” might simply have been misunderstood – it has been reinterpreted as a stage musical and now as a movie in two parts. Wicked’s target market consists of teenage girls who see themselves in this backstory for Elphaba and her college-friend-turned-rival, Glinda the Good Witch. In the 21 years since Stephen Schwartz’s adaptation opened on Broadway, the show has been a cult phenomenon among young musical fans, blithely ignored by everyone else. Now the screen version has brought into mainstream conversation and the land of Oz has become a battleground in America’s culture war. As a musical, Wicked is harmless to the point of vapid. Winnie Holzman’s storyline for the show is a more anodyne affair than Maguire’s hallucinatory fever dream of a book, which included bestiality and orgies. It features Elphaba as a talented girl arriving at a magical college, only to be bullied by Glinda and a clique of rosy-cheeked sycophants because she happens to have been born with green skin. This is Mean Girls meets Hogwarts. It has two songs you’ll remember: Popular, in which Glinda reveals the secrets of social success, and Defying Gravity, in which Elphaba vows to pursue excellence and fight prejudice. Wicked is sweet and fun and ultimately forgettable. All of which makes it sad to watch Jon M Chu’s movie become a flashpoint for grown adults. Since opening last weekend, Wicked has been subject to increasingly rabid media attacks. Some of this follows a familiar pattern: outrage for clicks. It is no surprise that Erivo, a black woman who describes herself as queer, has been the target of particular bile. Yet take a look at the organised and powerful social media accounts pushing attacks on Erivo, and it becomes clear that Hollywood is facing a new type of challenge. Wicked has been released into a landscape in which well-funded political marketeers are adept at turning key cultural moments into wedge issues. These are darker arts than anything conjured by the Wicked Witch of the West. Film studios need to decide whether to respond by leaning into the politics of polarisation, ramping up a strategy that already targets movies at different segments of the US electorate, or by making the case for blockbusters that can still bring progressives and conservatives together. The attacks on Wicked range from the plausible to the overtly ridiculous. British media outlets objected to a British Board of Film Classification note that expounded on its PG rating by explaining that the movie featured “discrimination”. “Seeing beloved characters being mistreated, especially when Elphaba’s skin-colour is used to demonise her as the ‘Wicked Witch’, may be upsetting and poignant for some audiences,” says the advice. Piers Morgan was among those who denounced this as the working of the “woke brigade”. Has he seen Wicked? Sure, BBFC advice to parents can be po-faced and limiting. But the BBFC has been issuing such warnings since 1912 – following a Daily Mail campaign against an early screen depiction of Jesus – which hardly makes it the cutting edge of wokery. Morgan’s complaint seems to be that it is “nonsense” to claim that a movie about bullying based on skin-colour could be understood as an allegory for racism. Which is a bit like objecting to a note that The Lion, The Witch and the Wardrobe might be an allegory for Christianity. More serious attacks on the film, however, have emerged from a cluster of high-impact, anonymous accounts on X (formerly Twitter) that have flourished in the era of Elon Musk. One such, an account named “End Wokeness”, was set up a few months after Musk bought the platform and already boasts 3.3 million followers; its banner image is a photograph of a bloodied Donald Trump raising his fist after surviving an assassination attempt. Elsewhere on X, an account named “Defiant L’s” has joined the game. It is linked to a website named “Resist the Mainstream”, which the Bloomberg news agency has traced to a Macedonian-based disinformation network pushing conspiracy theories about Covid-19 and Trump’s 2020 electoral loss. Defiant L’s has been endorsed by Elon Musk as “one of the best accounts on X”. The attacks on Wicked promoted by these accounts have received widespread coverage. They blame Erivo’s casting on “wokeness” and complain about munchkins being played by actors of average height, instead of dwarves as in the Oz movie. A video clip pushed out by the End Wokeness account went viral after it showed Erivo and her co-star, the singer Ariana Grande, holding hands emotionally while a reporter asked them to comment on the LGBT community “holding space” for the song Defying Gravity in the aftermath of Trump’s election victory. (The phrase “holding space” refers to a trend for fans to post lyrics from the song online and reflect on their meaning.) What seems to have been missed by other commentators, however, is the role of such social media accounts in pushing the clip, one of hundreds in a packed press tour, to mainstream attention. These are familiar tricks in Trumpworld. Back in 2022, it was reported that the Daily Wire website, led by Ben Shapiro, had spent between $35,000 and $47,000 promoting misleading video clips and news articles attacking Amber Heard, during her defamation battle with her ex-husband, Johnny Depp. The clear intention was to warn young men that the 21st century had become hostile terrain thanks to the excesses of feminism: Trump is the political solution to this problem. End Wokeness and Defying L’s are part of Shapiro’s shared ecosystem. The open-source analyst Ryan McBeth has alleged that the former account is run by the alt-right activist Jack Posobiec, whom the Southern Poverty Law Centre categorises as an extremist with alleged neo-Nazi connections. Related accounts amplified recent attacks on the black actress Halle Bailey when she was cast in Disney’s remake of the Little Mermaid, and Colombian-Polish actress Rachel Zegler when cast in Snow White. British commentators jumping on the anti-woke bandwagon likely have no idea that they’re doing the work of far-right disinformation specialists. Nor have members of the cast of Wicked helped themselves by gushing through an overexposed press tour. But our culture sphere needs to wake up to the fact that our responses to major movie events are increasingly being shaped by a white supremacist media operating out of Texas – or, in this case, Macedonia. Hollywood studios would do well to call out this misinformation when they see it. Their other option is to cater exclusively to one side or other of the political divide. That would prove bad for business and bad for the rest of us. • Kate Maltby writes about theatre, politics and culture Do you have an opinion on the issues raised in this article? If you would like to submit a letter of up to 250 words to be considered for publication, email it to us at observer.letters@observer.co.uk",
        "web_url": "https://www.theguardian.com/commentisfree/2024/nov/30/wicked-would-be-fun-and-forgettable-but-for-the-alt-right-waging-dark-arts-against-it",
        "pub_date": "2024-11-30T18:00:33Z",
        "section_name": "Opinion",
        "tags": [
            "Wicked",
            "Far right (US)",
            "Cynthia Erivo",
            "Ariana Grande",
            "Film",
            "Culture",
            "Society",
            "US news",
            "World news",
            "Music",
            "Musicals"
        ]
    },
    {
        "headline": "Glicked double bill may not match Barbenheimer buzz, experts say",
        "trailText": "Gladiator II and Wicked getting people into theatres but unlikely to replicate phenomenon of Barbie-Oppenheimer release",
        "bodyText": "The great Barbenheimer clash of summer 2023 – when Barbie came out on the same day as Oppenheimer – will for ever be a part of cinema history for capturing the public imagination and bringing audiences back to cinemas in droves after years of Covid-induced antipathy. So it’s unsurprising, that in an attempt to recapture some of the excitement, fans have come up with a new portmanteau: Glicked, used to refer to the face-off between Gladiator II and Wicked this week. Ridley Scott’s quarter-century-in-the-making sequel to his 2000 Oscar winner, and Jon M Chu’s adaptation of the beloved stage musical have been released a week apart in the UK and on the same day in the US. And it is hoped the competition will inspire audiences to grab their popcorn for both – sometimes even in back to back screenings. “If it has a similar effect to what it did for Barbie and Oppenheimer, it would be amazing,” Paul Mescal, who stars as Lucius in Gladiator II, told Entertainment Tonight. Cynthia Erivo and Ariana Grande, who co-star as Elphaba and Glinda in Wicked, were also both on board with the concept, with Erivo saying: “Glicked is what it is and that is what we should be doing.” Meanwhile, memes on social media have jumped on the mashup. The artist Eqarti posted a poster placing Mescal’s Gladiator next to Elphaba, the Wicked Witch of the West, as they head toward Oz, with the caption: “goodbye barbenheimer, it’s time for glicked”. Another meme placed Lucius and Glinda in the same pose as Michelangelo’s Creation of Adam on the ceiling of the Sistine Chapel. “The so-called Glicked movie mashup is reminiscent of the Barbenheimer phenomenon and is definitely creating a cultural buzz,” said Paul Dergarabedian, senior media analyst at Comscore. “Though it’s not quite at the Barbenheimer level, it has certainly raised the profile of both films.” Sam Glynne, head of EMEA entertainment and culture marketing at UTA, said what Barbie, Oppenheimer, Gladiator II and Wicked had in common was “a fearless take on visceral storytelling, elevated by smart marketing and social and PR campaigns that captivate audiences from all angles before they’ve even ordered their popcorn.” But according to Tim Richards, CEO of Vue cinemas, there hasn’t been much evidence of people booking double bills like they did for Barbenheimer. “People are, however, booking both movies pretty extensibly right now,” he said. “The word of mouth has been very strong, and all social media has been on fire.” The opening weekend for Gladiator II in UK and Ireland was £9.1m – the biggest opening for a Scott picture. The film entered the international box office last week with $87m, marking the biggest international R-rated opening weekend for Paramount Pictures as well as the best overseas debut for Scott, whose highest-grossing films include The Martian ($630m globally) and Gladiator ($465m globally). “Wicked is also going to be absolutely extraordinary,” Richards said. “We’ve sold almost a quarter of a million tickets before a single screening – that’s more pre-sales than Barbie. They’re talking of an opening weekend of somewhere between $160m and $200m.” But, despite the enthusiasm, some fans are becoming wary of the constant attempts to reinvent Barbenheimer (there was talk of Saw Patrol last year, and Gladdington as recently as last week). One TikTok user said: “There will never be another barbenheimer.” Another person posted on X: “stop trying to make glicked happen.” David Hancock, a media and entertainment analyst at Omdia, agreed that Glicked was entirely manufactured. “It isn’t a double bill. Gladdington was also tried, and didn’t set alight, because it seemed forced and derivative.” The reason Barbenheimer took off, Hancok added, was because it came together organically. “It was a particular moment [in the recovery of cinema], at a particular time [summer] with particular films [they both were original scripts].” Similarly, Phil Clapp, CEO of the UK Cinema Association, said he would “hesitate to draw too many parallels with the almost unique set of circumstances” around Barbenheimer. Clapp said what was actually happening right now was “something like a return to the normal pattern of major releases we saw pre-pandemic and pre- Hollywood strikes.” The successive release of Paddington in Peru, Gladiator 2, Wicked, and Moana 2 and Mufasa: The Lion King later this month, was “a hugely welcome fillip” for cinemas after a prolonged period of restricted releases. Richards also emphasised that the standout story of this season was a return to the pre-pandemic market of film releases. Whether Glicked is a thing or not, he said, there was a huge buzz and fans were flocking to theatres – which was a good thing. “It reinforces the fact that audiences are there, and we just need movies that bring them to theatres. Suddenly we’re very good value for an evening out because people are having an amazing time and want to come back.”",
        "web_url": "https://www.theguardian.com/film/2024/nov/23/glicked-double-bill-may-not-match-barbenheimer-buzz-experts-say",
        "pub_date": "2024-11-23T07:00:36Z",
        "section_name": "Film",
        "tags": [
            "Film",
            "Film industry",
            "Gladiator II",
            "Musicals",
            "Culture",
            "Barbie",
            "Oppenheimer",
            "Paul Mescal",
            "Ariana Grande",
            "Cynthia Erivo",
            "UK news",
            "US news",
            "World news",
            "Wicked"
        ]
    },
    {
        "headline": "The 50 best albums of 2024: No 1 – Charli xcx: Brat (and Brat and It’s Completely Different But Also Still Brat)",
        "trailText": "Smart, funny, moving and full of big tunes, the in-your-face masterpiece was the right album at the right time, striking a cultural nerve and defining a change in mindset",
        "bodyText": "In 2022, Charli xcx released Crash, an album that she claimed was a deliberate “sellout”. An artist who had previously seemed hell-bent on singlehandedly dragging pop music into a more interesting, experimental space by sheer force of will – on her acclaimed 2017 mixtape Pop 2, she collaborated with Estonian “post-Soviet” rappers, Brazilian drag queens and the extravagantly foul-mouthed underground artist CupcakKe – had apparently decided not to bother any more. She gamely presented Crash as another experiment in “making a major-label album the way it’s actually done” and knowingly embracing “everything that the life of a pop figurehead has to offer in today’s world – celebrity, obsession and global hits”, but you somehow sensed her heart wasn’t quite in it. Moreover, it didn’t totally work – it was well reviewed and became Charli’s first UK No 1 album, but didn’t exactly produce “global hits”. What Charli subsequently described as a deadening experience lit a fire under its author: if playing the game was no fun, then why not do exactly as you please? Certainly, Charli xcx’s sixth album turned out to be everything Crash wasn’t, up to and including the defining pop album of the year. Instead of a sleeve featuring the singer in a bikini, as Crash did, Brat came wrapped in a blunt, lowercase rendering of the album’s title against a sickly lime green: intended as a snub to the “misogynistic and boring” assumption that a female artist should automatically appear on her own album cover, it turned out to be a masterstroke of branding far more pervasive than any glossy photo, even influencing the US presidential race. Its sound was brash and aggressive, early 00s London club music – electroclash, acid-y bloghouse, dubstep, maximalist rave synths – shot through a chattering, trebly hyperpop filter: “Club classic but I still pop,” as Von Dutch put it. It oozed self-possession and confidence, Brat seemed to swagger even as Charli confessed to insecurity or inadequacy, a cocktail of emotions that seemed to be at the album’s centre: if everyone feels like this, you might as well own it. It felt fundamentally honest: instead of pop’s usual broad-brushstroke self-help platitudes, there was something striking about the splurge of complex, vacillating feelings regarding motherhood on I Think About It All the Time, or the mixture of admiration and resentment on Mean Girls. Most importantly, it had a surfeit of fantastic songs: Apple, Everything Is Romantic, Club Classics, So I’s heartbreaking eulogy to her late collaborator Sophie. Messy, obdurate and in your face, Brat’s tone struck a genuine cultural nerve. Perhaps you could have seen that coming. Over the last couple of years, a nostalgic fascination with “indie sleaze” – grimy, sweaty looking images of early 00s hedonism and the music that soundtracked it – seemed to indicate a longing among gen Z for a rather less straitened, watchful, self-censoring mood than that of recent years. Brat was the right album at the right time, something that other pop stars – ordinarily more commercially successful than Charli xcx – recognised: Ariana Grande, Billie Eilish and Lorde all appeared on the remix album Brat and It’s Completely Different But Also Still Brat, the latter on a version of Girl, So Confusing, a song about Charli xcx’s fraught relationship with … Lorde. Taylor Swift, meanwhile, was apparently so rattled by Brat’s arrival that she suddenly released six different deluxe editions of her album The Tortured Poets Department in order to keep it from reaching No 1 in the UK. Whether Brat singlehandedly drags pop music into a more interesting, experimental space remains to be seen. But whether you view it as zeitgeist-capturing or zeitgeist-changing feels slightly beside the point. More important is that it does everything you might conceivably want a pop album to do: it’s sharp and smart, funny and moving; it’s experimental and danceable; it has big tunes and depth; it sounds like now. And it’s the product of a pop artist declining to chase trends, and instead just being themselves. There’s a lesson in there somewhere.",
        "web_url": "https://www.theguardian.com/music/2024/dec/20/the-50-best-albums-of-2024-no-1-charli-xcx-brat-and-brat-and-its-completely-different-but-also-still-brat",
        "pub_date": "2024-12-20T14:00:51Z",
        "section_name": "Music",
        "tags": [
            "Charli xcx",
            "Culture",
            "Music",
            "Experimental music",
            "Dance music",
            "Electronic music",
            "Sophie",
            "Lorde",
            "Ariana Grande",
            "Billie Eilish"
        ]
    },
    {
        "headline": "Madonna laments re-election of ‘convicted felon, rapist, bigot’ Donald Trump",
        "trailText": "Billie Eilish also expressed dismay at the re-election of Trump, calling him ‘someone who hates women so, so deeply’",
        "bodyText": "Madonna has expressed outrage at the re-election of Donald Trump, describing him as “a convicted felon, rapist, bigot”. Writing on Instagram, she said: “Trying to get my head around why a convicted felon, rapist, bigot was chosen to lead our country because he’s good for the economy?” She also posted a picture of a cake with the words “Fuck Trump” etched in frosting along with the caption: “Stuffed my face with this cake last night!” The singer has previously castigated Trump, saying at the Women’s March in Washington DC in January 2017, the day after Trump’s inauguration, that she’d thought “an awful lot about blowing up the White House”. After a backlash among Trump supporters, she said: “I do not promote violence and it’s important people hear and understand my speech in its entirety rather than one phrase.” Billie Eilish has also expressed dismay in the wake of Trump’s election. She told a concert audience in Nashville on Wednesday: “A person who is a … let’s say convicted predator, let’s say that … someone who hates women so, so deeply is about to be the president of the United States of America.” She made the comments prior to a performance of TV, a 2022 song with lyrics referring to the removal of the federal right to abortion access, a decision made by supreme court justices installed during the Trump presidency: “The internet’s gone wild watching movie stars on trial / While they’re overturning Roe v Wade.” Eilish added to the audience: “I want you to know that you’re safe with me and you’re protected here and that you are safe in this room.” Trump has not been criminally convicted of rape or predatory behaviour. However, in August 2023, a judge found in a civil claim that it was “substantially true” that Trump raped journalist E Jean Carroll in an incident in late 1995 or early 1996. In 2022, Carroll had sued Trump for battery and defamation, with a jury finding him liable for sexual abuse. Trump countersued for defamation, but that lawsuit was dismissed. In May, Trump became the first former president to be convicted of a crime. He was found guilty of 34 counts of falsifying business records, after he recorded reimbursements to his former lawyer Michael Cohen – who had paid hush money to adult film star Stormy Daniels following her claims of an affair – as “legal expenses”. Trump’s sentencing is currently scheduled for 26 November. Other musicians expressing outrage at a second Trump presidency include Jack White, who is suing the Trump campaign over allegedly unauthorised use of the White Stripes’ Seven Nation Army. White wrote a screed on Instagram which reads in part: “Americans chose a known, obvious fascist and now America will get whatever this wannabe dictator wants to enact from here on in.” Ariana Grande, Cardi B and Ethel Cain also lamented the election in its immediate aftermath, along with other entertainment figures such as John Cusack, Viola Davis and Jamie Lee Curtis. “We wake up and fight,” Curtis wrote. “Fight for women and our children and their futures and fight against tyranny, one day at a time. One fight at a time. One protest at a time. That’s what it means to be an American.”",
        "web_url": "https://www.theguardian.com/music/2024/nov/08/madonna-laments-donald-trump-re-election",
        "pub_date": "2024-11-08T11:32:50Z",
        "section_name": "Music",
        "tags": [
            "Madonna",
            "Billie Eilish",
            "Pop and rock",
            "Music",
            "Culture",
            "US news",
            "Donald Trump",
            "World news",
            "US elections 2024",
            "Jack White",
            "Ariana Grande",
            "Cardi B",
            "John Cusack",
            "Jamie Lee Curtis"
        ]
    },
    {
        "headline": "‘It’s about consequences’: what can we expect from Wicked: Part Two?",
        "trailText": "The much-anticipated first part of the blockbuster musical adaptation has bewitched audiences worldwide, but there are dark times ahead in the sequel",
        "bodyText": "Despite more than a year of build-up and an exhaustive – some might say exhausting – press tour that rivaled a Marvel movie in budget, there were still many people who did not know that Wicked, now the most successful film adaptation of a Broadway musical of all time, is actually one half of a pair. To be fair to those who do not follow the entertainment industry, Universal billed the 2hr 40min film, which opens with Ariana Grande’s Glinda the Good Witch promising to tell the “whole story” of her long-lost friend Elphaba (Cynthia Erivo), as just Wicked, not by its title card, Wicked: Part One. And Jon M Chu’s first act concludes with a wildly cathartic, very CGI-ed rendition of Defying Gravity – the rare musical tune to transcend theater-kid fandom and probably the one thing non-Wicked fans would know about the show. The split, which engendered some skepticism among fans and critics, has not deterred audiences; Wicked made more than $359m in two weekends, smashing a host of musical and holiday-related box office records. The Wicked faithful and newly converted – my screening was full of young girls born long after the musical premiered in 2003 – will not have to wait too long to see how Elphaba and Glinda end up on opposite sides of the East/West, Good/Wicked divide. Wicked: Part Two is slated for 21 November 2025, a day short of a year after Part One premiered. This is not a Dune situation, where Part Two was greenlit only after a misleadingly titled Part One proved its mettle at the box office; both Wickeds were filmed together over five months on soundstages in the UK (plus an extra 10 days earlier this year, owing to the Hollywood strikes), ensuring that the cast – also including Jeff Goldblum, Michelle Yeoh, Bowen Yang, Jonathan Bailey and Ethan Slater – will remain intact for both parts. Part One, written by Winnie Holzman (who wrote the book for the musical) and Dana Fox, hewed closely to the original stage version, not cutting any songs and expanding some scenes. Part Two, which picks up after the stage version’s intermission, was also adapted by Holzman and Fox, and thus will probably also mirror the leaner, darker second act of the musical. (It’s been 21 years of Wicked on Broadway, but spoilers ahead … ) While part one functions mostly as prequel, taking place before a misunderstood Elphaba becomes the Wicked Witch of the West, Part Two is more revisionist fable, playing out in parallel to the events of L Frank Baum’s 1900 novel and the classic 1939 film adaptation. Elphaba exits the Emerald City in both exile and triumph, having summoned her full powers and learned the hideous truth of the Wizard’s (Jeff Goldblum) and Madame Morrible’s (Michelle Yeoh) embrace of fascism at the expense of vulnerable scapegoats. (The musical, at turns saccharine and impassioned, is not subtle on the politics, and neither is Chu’s movie). Part Two, assuming Chu once again remains faithful to the musical’s plot (itself loosely based on the novel by Gregory Maguire), picks up some time later, when Something Bad has fully manifested in Oz, with a much swifter timeline as well as origin stories for the Lion, the Tin Man and the Scarecrow. “If Part 1 is about choices, Part 2 is about consequences,” Chu told Entertainment Weekly. “Choices are difficult to make, but when you do make those choices, sometimes the result isn’t what you expect it to be. It can be lonely, it can be hard.” And those choices have become “eight times more relevant” in the context of recent political and social events, Chu teased to Variety, calling Part Two, at least thematically, a “doozy”. Despite the resonantly dark material, Chu has assured that Part Two will keep some of the first part’s levity, as best embodied by the buoyant, near-confectionary presence of Grande. “There is lots of lightness in the movie,” he told EW. “There’s a lot of fun parts. We’ve not forgotten about that, but there’s a matureness and a nuance to it that we earn from the first movie.” One of the musical’s weaknesses was that its second act lacked the musical firepower of its first, which contained not only Defying Gravity but theater-kid karaoke staples such as Popular, Dancing Through Life and The Wizard and I. Act two has For Good, arguably the show’s best duet, as well as a few reprisals. Chu seems to have anticipated the need for balance; Stephen Schwartz confirmed that Part Two will include two new songs. There are other anticipated areas of expansion. Part One included a shot from behind of Dorothy and her ragtag crew, and the trailer included an as-yet unused shot of them before the Wizard, suggesting screen time for characters who are not seen in the stage version. (Chu, for his part, has said: “There is interaction and some crossover.”) Another teaser image shows Glinda in what appears to be a wedding gown, a development outside the scope of the original show. And while Part One contained the bulk of significant cameos – including original stars Idina Menzel and Kristin Chenoweth, as well as Schwartz (as an Emerald City guard) and Holzman (as a member of an acting troupe) – Part Two will likely contain at least a few names for Broadway and West End fans to spot. Given the extensive promotion for Part One, I assume we will have answers to some questions (and cameos) before next Thanksgiving. But only time will tell whether Part Two can cast as strong a box office spell as the dubiously marketed Part One.",
        "web_url": "https://www.theguardian.com/film/2024/dec/02/wicked-part-two-what-to-expect",
        "pub_date": "2024-12-02T20:34:05Z",
        "section_name": "Film",
        "tags": [
            "Wicked",
            "Musicals",
            "Musicals",
            "Cynthia Erivo",
            "Ariana Grande",
            "Culture",
            "Film",
            "Music"
        ]
    },
    {
        "headline": "The 20 best songs of 2024",
        "trailText": "Here are the year’s most outstanding tracks – from Fontaines DC to Beyoncé via Kendrick Lamar – as voted for by 26 Guardian music writers",
        "bodyText": "20 MJ Lenderman – Wristwatch The year’s breakout indie star, Jake Lenderman has a voice like the last roll of the die. On his fourth album, Manning Fireworks, he uses it to portray a series of sad-sack men reaching for Eric Clapton records and cool gadgets to assert their virility, filled with the weary, palpably desperate sense that maybe, just maybe, their day has finally come. It’s the type of figure that in comedian Tim Robinson’s hands would be an absurdist nightmare (he will honk if he’s horny), but in Lenderman’s, they reek with a very specific kind of pathos: the protagonist of Wristwatch has a techy new timepiece that’s a compass, a cell phone, a pocketknife and a megaphone … that also “tells me I’m on my own”. The hangdog tumble of electric guitar and pedal steel – like a more earth-bound Magnolia Electric Co – shifts between sounding crushed and bright, neither tragedy nor hope ever quite winning out. But Lenderman’s unique voice prevails: who else this year would have come up with the line: “I got a houseboat docked at the Himbo Dome”? Laura Snapes 19 Clairo – Sexy to Someone Clairo’s album Charm was that word made manifest, and Sexy to Someone was perhaps the most charming moment of all. Made with Dap-Kings and Lee Fields collaborator Leon Michel, gently insistent vintage soul is the backdrop for a robustly funny and wry song about putting hotness at the top of one’s hierarchy of needs: “Sexy to somebody, it would help me out / Oh, I need a reason to get out of the house.” Ben Beaumont-Thomas 18 Lady Gaga – Disease After the flop of Joker: Folie à Deux and her accompanying album of big band standards, Gaga swept the embarrassment away as if with a swish of a meat dress, in this triumphant return to her core electro-pop sound. The malevolent beat could have been made by Gesaffelstein or Justice (actually it involves Cirkut, who had a big hand in Charli xcx’s Brat); lurching forward like a horny Frankenstein’s monster, the track is perfect for Gaga’s histrionically camp series of psychosexual illness metaphors. BBT 17 Yaeji – Booboo The Korean-American producer broke through in 2017 with Raingurl, an underground club smash animated by her skipping-chant vocals. She then went on to massively expand her sound into progressive electronic pop, but returned to her roots with Booboo. With a satisfyingly stripped-back Jersey club beat, it’s a song both for and about the club, where she is “headbanging all night … find me at the front right”. But it’s not all abandon – she interpolates Raingurl as she considers the growing pains between her two dance hits. BBT 16 Beyoncé – Texas Hold ’Em Shaboozey’s A Bar Song (Tipsy) and Post Malone and Morgan Wallen’s I Had Some Help may have cantered past it to become the pop-country crossovers of the year, but Beyoncé was first out the gate, with Texas Hold ’Em becoming her first UK No 1 since 2008. With banjos and a muffled beat like a cowboy boot stomping on a dusty floor, it’s authentically rootsy, and for all her star wattage there’s something almost homely about her relaxed, conversational singing style. BBT 15 Kassie Krut – Reckless There are few cooler moves than launching with a manifesto song, and even if you didn’t know Eve Alpert and Kasra Kurt from their former band, Philly math-rockers Palm (now joined by their producer Matt Anderegg), they make a compelling pitch to get with the picture fast. Alpert’s chanted vocals about being fast, free, best and mean hit somewhere between Coco &amp; Clair Clair and Charli xcx; the brute drum beat, industrial shudder and off-kilter pop sensibility vaults back to Peaches and early Micachu and the Shapes. It’s the hypnotic nonchalance of Alpert’s vocals amid the discordance that makes Reckless so seductive: she sounds untouchable, but that won’t stop you from trying to get close. “Never look back,” she sings. “There’s a runner in me.” LS 14 Ariana Grande – We Can’t Be Friends (Wait for Your Love) This was easily the biggest hit from Grande’s album Eternal Sunshine, and while it didn’t have the compositional originality elsewhere – such as The Boy Is Mine with its exquisite time-stretched chorus – it makes up for that with intense melancholy. Clearly indebted to Robyn’s electro-pop heartbreak anthems but given a softer sheen, Grande said she wanted “people to make of it what they will”. It could be about an almost-romance, but the more interesting reading is that it’s about Grande’s relationship with the media and public perception: “But I don’t wanna feed this monstrous fire / Just wanna let this story die … Me and my truth, we sit in silence.” BBT 13 Waxahatchee – Right Back to It (ft MJ Lenderman) Right Back to It may be the most perfect portrait of what it is to be the stubborn half of a relationship, the one prone to self-sabotage by second-guessing and refusing help. Katie Crutchfield sings that she’s “blunter than a bullseye”, always “bracing for a bombshell” that never comes, while her partner has their “love written on a blank check” and bears the ease of “a song with no end”. It’s partially a lament about the parts of one’s nature you wish you could overcome, though really it plays more like a love letter to difference, and to the kind of partner who gives you the space to learn how to go easy on yourself (you can imagine this soundtracking many first dances). Crutchfield has that ease licked in one respect, anyway: the song’s intermittently interlocking guitar and banjo, coupled with her conversational phrasing, are a total balm. LS 12 Kim Gordon – Bye Bye Bye Bye is essentially a very high-end packing list incanted with Kim Gordon’s typically alluring hauteur: designer clothes, homeopathic remedies, “pyjamas – silk”. But the muscular industrial roil and sharp, stabbing squeaks underpinning her suitcase inventory imply that she’s less bound for a luxury resort than some sort of bunk or heist, evoking the heroines of Play It as It Lays, Alice Doesn’t Live Here Any More, Thelma and Louise or, more darkly, A Woman Under the Influence. Wherever she’s going, take it as read that you can’t come. LS 11 The Cure – Alone The lead single from the album Songs of a Lost World was the Cure’s first new music in 16 years, and it made an appropriately grand and stately entrance. Unlike pop songs that tease the chorus in the opening seconds so you don’t press skip, Robert Smith’s vocals don’t even come in for three and a half minutes as the band generate a symphonic, slowly stuttering groove. Smith then raises a toast to endings: of art, of nature, of idealism, of the children we used to be. This song acknowledges that our world is dying, or at least our version of it – and yet its determined beauty reminds us that we can still make something meaningful. BBT 10 Kendrick Lamar – Not Like Us Forget Gladiator II – the entertainment industry’s greatest man-to-man combat of the year came between Kendrick Lamar and Drake in their remarkably heated multi-track beef this spring. The kill shot was Not Like Us – not only did it have a DJ Mustard beat that made it the rare diss track you could dance to, Lamar’s framing of Drake as a cultural leech had real credence, while the allegations of involvement with young girls were what everyone wanted to believe: “Tryna strike a chord and it’s probably A minor” became the most quotable line in the whole debacle. Drake denied the allegations: “Only fuckin’ with Whitneys, not Millie Bobby Browns / I’d never look twice at no teenager” was actually an impressively reference-packed retort, but by then he’d been backed into a corner and Lamar didn’t have to bother with a reply. BBT 9 Nick León and Erika de Casier – Bikini After a couple of edits and co-productions, the Miami DJ and Portuguese-Danish producer finally teamed up proper with a beachy-minded track debuted, fittingly, at Primavera festival in Barcelona. This trancey dembow thumper intensifies in tandem with the single-minded crush de Casier outlines in a distant voice, one that suggests a gaze fixed on the limits of the horizon, waiting for her paramour to appear. The chorus – “Meet me at the beach / It’s me in the bikini” – is an earworm; the balance of sad and sexy almost comically on point. LS 8 Addison Rae – Diet Pepsi It’s been a tricky year for the American fast food industry. Such simple pleasures as caffeinated drinks and cheese-larded pizzas have been turned into wanton metaphors for activities of a sexual nature by some of the nation’s most brazen young pop stars. Chappell Roan wants to “get it hot like Papa John”. Sabrina Carpenter intends to “Mountain Dew it for ya”. And while one-time TikTok dancer Addison Rae actually claims that she wants to refresh herself with some Diet Pepsi – which has barely recovered from the besmirching Lana Del Rey gave it 12 years ago – she stipulates that she’ll be “sitting on his lap” as she does so. Coupled with an extremely breathy, addictively trappy slow jam that evokes Lana gasping for oxygen, you rather get the impression that this great American refreshment might actually be some sort of horny hors d’oeuvre. Deary me! Great key change though. LS 7 Nilüfer Yanya – Like I Say (I Runaway) It’s hard to pick a standout song from Nilüfer Yanya’s third album, My Method Actor, the whole thing is such a heated, fractious mood. But Like I Say (I Runaway) is a great example of what an idiosyncratic songwriter the always-brilliant Yanya has become. The third song on this list about making a break for it (alongside Kassie Krut and Kim Gordon), it takes an elusive approach to the subject: the cool verses mingling the spectre of trip-hop and Radiohead’s heavy-thumbed acoustics as Yanya outlines her self-protective MO. The writhing, staticky wallop of the chorus crashes down with the weight of the feelings and uncertainty she’s running from, powering a captivatingly desperate vocal performance. LS 6 Fontaines DC – Starburster / Favourite Korn were the unlikely touchstone for Starburster, the return single by Ireland’s finest, and they nailed both sides of the rap-rock equation. The drums hit like a boom-bap beat, and Grian Chatten has the relentless flow of a battle-hardened MC, spitting surrealist brags (“I got a shadow like a .58 calibre / I wanna move like a new salamander”) and inhaling hard in a song inspired by a panic attack. The rest of the band give him the space he needs, providing spaghetti western twangs and a strange, dreamy middle-eight that’s like the sudden return of clarity – only for chaos to crash back in. Plenty of our writers also voted for Favourite, their 80s-indie anthem whose warmth and poignancy felt heroic after the nervy Starburster. BBT 5 Billie Eilish – Birds of a Feather / Lunch There was the faint sense that Eilish’s star might be waning after her fame-jaded second album Happier Than Ever, but that was entirely extinguished by the success of follow-up Hit Me Hard and Soft, with Birds of a Feather becoming a massive global hit. Eilish makes bald declarations of love over a tender beat as soft as snow – but this romance is fraught, as her lover wavers and Eilish’s patience snaps: “You’re so full of shit / Tell me it’s a bit / Say you don’t see it, your mind’s polluted / Say you wanna quit, don’t be stupid.” There were also lots of votes for Lunch, her spry, ska-tinged ode to a very particular kind of nutrition, which put an adult spin on the troublemaking sound she broke out with. BBT 4 Jade – Angel of My Dreams Girls Aloud production geniuses Xenomania only worked with the girl band’s successors Little Mix once, but their wild Frankensteinian style (often creating songs from the remnants of various other tracks) feels like the mutant blood pumping through former Mixer Jade Thirlwall’s debut solo single. The lurch from massive Mariah chorus to snarling bloghouse verses and another, helium-voiced sped-up chorus feels as far from focus-grouped pop as humanly possible; closer to a head-spinning night out with your most captivatingly chaotic friend in all its ecstasy and freefall. LS 3 Charli xcx – The Girl, So Confusing Version With Lorde / Von Dutch / Guess (ft Billie Eilish) / 360 360 is about right: the vast array of Brat – and remixed Brat and It’s Completely Different But Also Still Brat – tracks that our writers voted for reflected Charli xcx’s wild range in a year that was often oversimplified to a single shade of acid green. “I set the tone, it’s my design” she taunted, presciently, on our lowest-charting song, 360; the Guess redux with Billie was raunchy; Von Dutch unapologetically bitchy. But our top Brat song, The Girl, So Confusing Version With Lorde, spanned its own entire world of emotional terrain, turning Charli’s original song about her fears of a frenemy’s intentions into a crazily moving moment of resolution between two singers who not only have the same hair, it turns out, but a whole lot of self-doubt and mutual admiration in common. She’s your favourite reference, baby – but no one did it like her this year. LS 2 Sabrina Carpenter – Espresso From Tinashe’s “can somebody match my freak” to Charli’s “bumpin’ that”, smart lyricists now have one eye on the potential memes – and no one did it better than Sabrina Carpenter, whose ridiculously quotable chorus line “that’s that me espresso” enraged syntax purists and enchanted everyone else. In fact, the lyrics throughout are a delight – “walked in and dream-came-trued it for ya”, “I can’t relate to desperation / My give-a-fucks are on vacation” – though their airy confidence needed a singer to match. They had one in Carpenter, who oh-so-casually strutted through the song like someone who is so used to turning heads that they’ve stopped even noticing. And following wave after wave of often stiff disco revivalism, the languorous funk licks made it really swing. It ends up being less caffeine hit, more cocktail buzz. BBT 1 Chappell Roan – Good Luck, Babe! Once you hear it you can’t unhear it: the opening synths of Good Luck, Babe! sound a bit like Wham!’s Last Christmas – and like George Michael, Chappell Roan understands intimately that denying your true self is a fool’s errand. Before she was Chappell Roan, she was Kayleigh Rose Amstutz, a closeted sad-girl singer-songwriter who ultimately got dropped just as she was coming into her sound. The song that led her there was Pink Pony Club, a sleeper hit that wedded a truly Freddie-worthy “mama!” to a yarn about finding herself – ie the Roan persona – at a Hollywood queer club. It became the first of many deeply camp, nothing-left-to-lose tracks Roan and producer Daniel Nigro made for her debut album, The Rise and Fall of a Midwest Princess, released last September. That was another sleeper hit, its fuse properly lit this spring by increasingly viral footage of Roan’s riotous live shows and this new, non-album single about a futile affair with a girl who protests that she’s straight. There are other clear influences in Good Luck, Babe! Roan has the rough-hewn vocal ribaldry of Cyndi Lauper, the stentorian command of Hounds of Love-era Kate Bush, the high-goth drama of Shakespears Sister, a cabaret swoon so perfect you can picture the fake tear glued to the corner of her eye – but it’s also entirely her own creation, a towering layer cake of frustration, festivity and fury that rewards a million repeat plays. In the verse, she’s the despondent fool letting herself be played, but by the chorus, she’s warning her intended that, try as she might, she’ll never manage to Sisyphus desire, backed by a full, heavenly choir that suggests the angels are absolutely on Roan’s side. Her sheer existence – and total domination of pop this year – are proof that she knows exactly what she’s talking about. “You know I hate to say, but: I told you so!” she roars in the middle eight. I don’t think she hates to say it at all. LS",
        "web_url": "https://www.theguardian.com/music/2024/dec/06/the-20-best-songs-of-2024",
        "pub_date": "2024-12-06T06:00:48Z",
        "section_name": "Music",
        "tags": [
            "Music",
            "Culture",
            "Indie",
            "Americana",
            "Clairo (Music)",
            "Lady Gaga",
            "Pop and rock",
            "Yaeji",
            "Beyoncé",
            "Country",
            "Ariana Grande",
            "Waxahatchee",
            "Kim Gordon",
            "Experimental music",
            "The Cure",
            "Kendrick Lamar",
            "Nilufer Yanya",
            "Fontaines DC",
            "Billie Eilish",
            "Little Mix",
            "Charli xcx",
            "Lorde",
            "Sabrina Carpenter",
            "Chappell Roan"
        ]
    }
]