[
    {
        "headline": "Amanda Morris-Drake obituary",
        "trailText": "<strong>Other lives:</strong> Teacher whose dedication to helping people extended far beyond her work",
        "bodyText": "My friend Amanda Morris-Drake, who has died aged 64 from cancer, was a teacher and advocate for a child’s right to a creative education. Her response to her diagnosis was: “But I have so much more to give.” Her career culminated in her appointment in 2014 as head of the Pilgrim Pupil Referral Unit in Cambridge; the school supports children and young people in hospital with complex mental and physical health needs. Her vision was to make it a place of hope. Staff spoke of her kindness, her generosity and her fight for the right education for each child. Under her leadership, the Pilgrim PRU was deemed outstanding on two consecutive Ofsted inspections. Her dedication to helping people extended far beyond her work. She volunteered with refugees in Calais, with homeless people, as an independent visitor for a boy in residential care and with Cambridge Past Present &amp; Future, a charity protecting the city and its environment. She was also a trustee of the Batemans Trust (a small charity in Chennai, India, caring for vulnerable children). Amanda was born in Cambridge, the daughter of Joy (nee Norbury), a social worker, and Peter Morris, a lawyer. She attended King’s school, Ely, before studying education (specialising in drama) at Exeter University. She married Nick Drake, whom she first met at school, in 1992. They shared a love of travel and adventure, and had two daughters. Creativity was a thread that ran through Amanda’s life. She loved books, theatre, galleries, musicals, film, poetry, fabrics and colour. Amanda wanted all children to have access to the arts. She would keep the value of a creative curriculum on the agenda of board meetings at the Pilgrim and also volunteered for Cambridge Curiosity and Imagination, a charity supporting disadvantaged children to be creative in nature. One child told her that “this definitely made me feel how lucky we are to have such a beautiful world”. She is survived by Nick, her daughters, Amy and Myah, a grandchild, Marella, and her brothers, Mark and Jim.",
        "web_url": "https://www.theguardian.com/education/2024/dec/10/amanda-morris-drake-obituary",
        "pub_date": "2024-12-10T19:41:43Z",
        "section_name": "Education",
        "tags": [
            "Teaching",
            "Charities",
            "Society",
            "Education",
            "Health",
            "Hospitals",
            "Cambridge"
        ]
    },
    {
        "headline": "Drake expands lawsuit against Universal Music Group, alleging defamation at Super Bowl",
        "trailText": "Lawsuit argues Kendrick Lamar’s half-time performance ‘further solidified’ public belief in allegations made in diss track Not Like Us, but UMG calls amendment ‘absurd’",
        "bodyText": "Drake has expanded his lawsuit against Universal Music Group (UMG) over Kendrick Lamar’s diss track Not Like Us, alleging that he was defamed by Lamar’s half–time performance at the 2025 Super Bowl. With lyrics including “Say Drake, I hear you like ’em young … certified lover boy? Certified paedophile,” Lamar’s track was one of a number of diss tracks issued by the rappers against each other in spring 2024. Not Like Us became the most commercially successful, reaching No 1 in the US and UK, and it also won Lamar five Grammy awards including record and song of the year. In January Drake sued UMG, the label that he and Lamar share, over the song, alleging UMG “approved, published and launched a campaign to create a viral hit out of a rap track” that was “intended to convey the specific, unmistakable, and false factual allegation that Drake is a criminal paedophile, and to suggest that the public should resort to vigilante justice in response”. UMG argued the case was “utterly without merit” and called for it to be dismissed. Drake’s legal team have now amended the lawsuit with new allegations, claiming that the Super Bowl performance, which was the most-watched half-time show ever, “further solidified the public’s belief in the truth of the allegations against Drake … Not only did streams of the recording increase significantly following these two mega-cultural events, but threats against Drake and his family did as well.” Lamar omitted the words “certified paedophile” from the performance, but included the “I hear you like ’em young” line, delivered while staring into the camera in a moment that was widely shared on social media. The omission was made, the lawsuit claims, because “everyone understands that it is defamatory to falsely brand someone a ‘certified paedophile’”. Lamar is not being sued by Drake, only UMG. UMG responded to the amendments by saying: “Drake, unquestionably one of the world’s most accomplished artists and with whom we’ve enjoyed a 16-year successful relationship, is being misled by his legal representatives into taking one absurd legal step after another.” Drake secured a small victory in the ongoing case earlier this month, when a judge allowed his team to access certain UMG documents as they built their case, a process known as “discovery” which UMG had attempted to block. Alongside their statement about the amendments, UMG addressed that decision, saying: “Drake will personally be subject to discovery as well. As the old saying goes, ‘be careful what you wish for’.” Drake’s team then responded in kind, saying: “Drake knows exactly what he asked for: the truth and accountability.” Elsewhere at the Super Bowl show, Serena Williams – who reportedly once dated Drake – danced on stage to Not Like Us, an appearance which was perceived by some viewers as mocking Drake. Asked by Time magazine this week whether that was the case, Williams said: “Absolutely not. I would never do that. And that was sad, that anyone would ever think that. I respect how they could … But absolutely not. I have never had negative feelings towards him. We’ve known him for so many years.” Drake and Lamar are also currently locked in another battle, for the top of the US singles chart. Lamar’s track Luther, featuring SZA, has been at No 1 for eight weeks, but Drake’s track Nokia has returned to the No 2 spot this week.",
        "web_url": "https://www.theguardian.com/music/2025/apr/18/drake-expands-lawsuit-against-universal-music-group-alleging-defamation-at-super-bowl",
        "pub_date": "2025-04-18T10:36:41Z",
        "section_name": "Music",
        "tags": [
            "Drake",
            "Kendrick Lamar",
            "Universal Music",
            "Music",
            "Rap",
            "Hip-hop",
            "Culture",
            "Super Bowl LIX",
            "NFL",
            "US news",
            "Sport",
            "US sports"
        ]
    },
    {
        "headline": "Drake files defamation lawsuit over Kendrick Lamar diss track",
        "trailText": "Drake is bringing legal action against Universal Music Group as a result of Lamar’s track Not Like Us, a decision the company calls ‘illogical’",
        "bodyText": "Drake has filed a defamation lawsuit against Universal Music Group (UMG), the record label he and rival Kendrick Lamar share, over the latter artist’s diss track Not Like Us. The lawsuit, filed in a New York federal court on Wednesday, comes shortly after the Canadian rapper born Aubrey Drake Graham withdrew a legal challenge he made against UMG and Spotify, alleging they artificially inflated the popularity of Lamar’s track. UMG has responded by calling it “illogical”. That filing – not a lawsuit, but a petition for documents in preparation for a potential lawsuit filing – accused UMG and Spotify of trying to “manipulate and saturate the streaming services and airwaves”. Lawyers for the rapper had claimed that UMG paid influencers and radio stations to play the track, Not Like Us, which topped the US charts and proved to be the hammer blow in the Drake-Lamar feud between March and May last year. The new defamation suit accuses UMG of defamation and harassment, calling the release and promotion of Lamar’s hit track, with lyrics labeling Drake a “certified pedophile”, an example of valuing “corporate greed over the safety and wellbeing of its artists”. The suit alleges that UMG “approved, published and launched a campaign to create a viral hit out of a rap track” that was “intended to convey the specific, unmistakable, and false factual allegation that Drake is a criminal pedophile, and to suggest that the public should resort to vigilante justice in response”. Noting that the track’s artwork featured a picture of Drake’s house with markers meant to identify the homes of registered sex offenders, the suit refers to a shooting that occurred outside the residence days after the track’s release, injuring a security guard. It refers to this incident, as well as two attempted trespassings in the subsequent days, as “the 2024 equivalent of Pizzagate”. Though the suit is primarily concerned with Lamar’s song, it places the blame on UMG for distributing and marketing the track. “This lawsuit is not about the artist who created ‘Not Like Us,’” the filing reads. “It is, instead, entirely about UMG, the music company that decided to publish, promote, exploit, and monetize allegations that it understood were not only false, but dangerous.” Later on Wednesday, UMG issued a strong-worded response. “Not only are these claims untrue, but the notion that we would seek to harm the reputation of any artist – let alone Drake – is illogical,” a company spokesperson said in a statement to Variety. “We have invested massively in his music and our employees around the world have worked tirelessly for many years to help him achieve historic commercial and personal financial success.” The statement continues: “Throughout his career, Drake has intentionally and successfully used UMG to distribute his music and poetry to engage in conventionally outrageous back-and-forth ‘rap battles’ to express his feelings about other artists. He now seeks to weaponize the legal process to silence an artist’s creative expression and to seek damages from UMG for distributing that artist’s music.” Drake is represented in this case by Michael J Gottlieb, a lawyer who has previously represented the owner of a Washington DC pizzeria targeted by “Pizzagate” pedophilia conspiracy theorists in 2016, as well as election workers falsely accused by Rudy Giuliani of aiding a fictional plot to steal the 2020 presidential election for Joe Biden. In the November filing, Drake alleged that UMG used bots to stream Not Like Us on Spotify in huge numbers, “and deceive consumers into believing the song was more popular than it was in reality”. UMG was accused of paying Apple “to have its voice-activated digital assistant, Siri, purposely misdirect users to Not Like Us” and had “been taking steps in an apparent effort to conceal its schemes, including, but not limited to, by terminating employees associated with or perceived as having loyalty to Drake”. Both Drake and Lamar release music through UMG, Drake via Republic Records and Lamar via Interscope. UMG, which called the allegations “contrived and absurd” said: “The suggestion that UMG would do anything to undermine any of its artists is offensive and untrue.” Spotify also denied the allegations, saying: “Spotify has no economic incentive for users to stream Not Like Us over any of Drake’s tracks.” In New York court documents seen by the Guardian, Drake withdrew that request, with the document reading: “Petitioner hereby voluntarily discontinues this special proceeding as to all respondents without costs to any party.” Drake previously filed another petition in Texas, alleging UMG paid the radio group iHeartRadio to play Not Like Us, and that UMG allowed the release of the track despite knowing it contained accusations of Drake being a “certified paedophile”, which Drake denied. That petition remains active. After numerous diss tracks from each rapper, Lamar was generally considered the winner. Not Like Us, which also alleged Drake was a “coloniser” leeching off the hip-hop scene, scored the highest single-day and week-long streams of any rap song on Spotify. Drake has released relatively little music after the feud: four tracks in August, plus two appearances on Camila Cabello’s album and another with Mexican-American group Fuerza Regida. But he returned to solo material earlier this month with the freestyle Fighting Irish, which looked back on the Lamar feud and friendships lost over it. “The world fell in love with the gimmicks, even my brothers got tickets / Seemed like they loved every minute / Just know this shit is personal to us, and it wasn’t just business … I was sadly mistaken, the loyalty wasn’t a given”, he rapped. He also referred to the “coloniser” accusation, rapping “I’m starin’ at my daddy” – Drake’s father is African American.",
        "web_url": "https://www.theguardian.com/music/2025/jan/15/drake-withdraws-legal-petition-over-kendrick-lamar-diss-track",
        "pub_date": "2025-01-15T10:48:19Z",
        "section_name": "Music",
        "tags": [
            "Drake",
            "Kendrick Lamar",
            "Music",
            "Rap",
            "Universal Music",
            "Spotify",
            "Culture",
            "US news",
            "Law (US)"
        ]
    },
    {
        "headline": " ‘Drake lost a rap battle’: Universal files motion to dismiss rapper’s ‘misguided’ lawsuit",
        "trailText": "Drake’s attorneys accuse Universal of being ‘a greedy company’ that is ‘finally being held responsible for profiting from dangerous misinformation’.",
        "bodyText": "Universal Music Group have moved to dismiss Drake’s defamation suit, characterising it as “a misguided attempt” by the Canadian rapper to “salve his wounds” after he “lost a rap battle” with rival Kendrick Lamar. In the motion, filed on Monday in the US district court for the southern district of New York, Universal Music Group (UMG), which represents both artists, claimed that Drake “lost a rap battle that he provoked and in which he willingly participated. “Instead of accepting the loss like the unbothered rap artist he often claims to be, he has sued his own record label in a misguided attempt to salve his wounds. Plaintiff’s complaint is utterly without merit and should be dismissed with prejudice”. The long-term rivalry between Drake and Kendrick Lamar escalated in March 2024 with the rapid-fire, tit-for-tat release of diss tracks by both artists, culminating in the release of Not Like Us on 4 May, in which Lamar framed Drake as a “certified pedophile”. The track proved immensely popular, topping the Billboard Global 200 chart and winning Record and Song of the Year at the 2025 Grammys. Drake filed a lawsuit in January accusing UMG of defamation and harassment, and alleging that UMG “approved, published and launched a campaign to create a viral hit out of a rap track” that was “intended to convey the specific, unmistakable, and false factual allegation that Drake is a criminal pedophile, and to suggest that the public should resort to vigilante justice in response”. Drake’s suit noted that the artwork for Not Like Us features a picture of his Toronto home with markers used to identify the homes of registered sex offenders; and referred to a shooting that occurred outside the residence days after the track’s release in which a security guard was injured, and two attempted trespassings in the subsequent days. “This lawsuit is not about the artist who created ‘Not Like Us,’” the filing by Drake’s team read. “It is, instead, entirely about UMG, the music company that decided to publish, promote, exploit, and monetize allegations that it understood were not only false, but dangerous.” In its motion to dismiss, Universal argue that Drake fails to make a claim for defamation, saying that Not Like Us “conveys nonactionable opinion and rhetorical hyperbole, not fact,” and noting that the rapper has relied on UMG to promote his own diss tracks against Lamar and others. Drake’s lawsuit, UMG says in its filing, “disregards the other Drake and Lamar diss tracks that surrounded ‘Not Like Us’ as well as the conventions of the diss track genre … diss tracks are a popular and celebrated artform centered around outrageous insults, and they would be severely chilled if Drake’s suit were permitted to proceed.” “Less than three years ago, Drake himself signed a public petition criticizing ‘the trend of prosecutors using artists’ creative expression against them’ by treating rap lyrics as literal fact,” UMG’s motion continues. “As Drake recognized, when it comes to rap, ‘[t]he final work is a product of the artist’s vision and imagination’. “Drake was right then and is wrong now.” Universal also denies that its promotion of Not Like Us invited harassment of Drake, stating that the rapper is attempting “to contort violent metaphors in the lyrics into incitement”. “As with his defamation claim, Drake seeks to chill a form of artistic expression that he himself has embraced,” the motion reads. In a statement provided to Variety, Drake’s attorney Michael J. Gottlieb responded to Universal’s motion to dismiss, saying: “UMG wants to pretend that this is about a rap battle in order to distract its shareholders, artists and the public from a simple truth: a greedy company is finally being held responsible for profiting from dangerous misinformation that has already resulted in multiple acts of violence. “This motion is a desperate ploy by UMG to avoid accountability, but we have every confidence that this case will proceed and continue to uncover UMG’s long history of endangering, abusing and taking advantage of its artists.”",
        "web_url": "https://www.theguardian.com/music/2025/mar/18/drake-kendrick-lamar-universal-lawsuit-dismissal-motion-ntwnfb",
        "pub_date": "2025-03-18T02:14:15Z",
        "section_name": "Music",
        "tags": [
            "Drake",
            "Kendrick Lamar",
            "Universal Music",
            "Rap",
            "Music",
            "US news",
            "Culture",
            "Hip-hop"
        ]
    },
    {
        "headline": "Kendrick Lamar’s Super Bowl half-time show review – game over for Drake",
        "trailText": "The Pulitzer prize-winning rapper chose artistry over more obvious showmanship in an unusual set yet still delivered the final blow to his diss track nemesis",
        "bodyText": "The Super Bowl half-time show is Plato’s perfect form of pomp and ceremony, a corporate-sponsored, highly choreographed musical performance used to entice people who don’t follow the NFL into watching TV in order to secure even higher ad fees from Doritos and Dunkin’ Donuts. Over the years it has provided moments of great spectacle: Prince playing Purple Rain in the rain, Rihanna announcing her pregnancy flanked by hundreds of sperm-looking dancers in duvet drip – but it’s never been a site of serious artistry. Its biggest controversies – Janet Jackson’s nip slip, MIA’s middle finger – have been teenage in their puerility. Could that change with the arrival to the Super Bowl stage of Lamar, one of this decade’s great public intellectuals – a Pulitzer prize-winning rapper who has transformed the possibilities of hip-hop? It’s an unlikely match for the NFL in an ordinary year, but performing in front of a president who has attacked intellectualism, Black activism and the communities in which Lamar was raised, it felt momentous before it even began. But Lamar was not necessarily looking to make a statement. He’s in the most mischievous part of his career and at the crest of his mainstream popularity: in 2024 he released a series of dueling diss tracks with Drake, which culminated in Not Like Us – a song that spent the summer atop the Billboard 200 and repeatedly and specifically calls Drake a paedophile. It’s a joyous song of defiance, but one with a churlish undertone that doesn’t fit with the Super Bowl’s inclusivity. So which Kendrick would be arriving in New Orleans? The prophet or the provocateur? In the end we got flavours of both, with an uneven but ambitious set that was arguably the most esoteric in the Super Bowl’s history, perhaps at the expense of landing a knockout blow. It began with Samuel L Jackson as Uncle Sam, playing the American machine that berated Lamar: “It’s your Uncle Sam, and this is the great American game!” Lamar began the show atop a 1987 Buick Grand National GNX, the rare car for which his album is named. He performed an unreleased and unnamed track, known on the Kendrick Lamar subreddit as Bodies, an early sign that he wasn’t in New Orleans to play crowd pleasers. His outfit also spoke to a sense of self-possession: he wore a varsity jacket by the British designer Martine Rose and the most incredible pair of boot cut jeans – something straight off the rack from mid-00s American Eagle. The set warmed up with Squabble Up and Humble as dancers flooded the stage dressed in red, white and blue tracksuits, a nod both to the Americana of the occasion and potentially a moment of unity between Compton’s two rival gangs. When the all-Black dance cast started to interplay to form the American flag, it was a moment that felt weighted with significance as Trump looked on (and was rumoured to have left shortly after). As Uncle Sam Jackson yelled at Lamar that he was “too loud, too reckless, too ghetto” (perhaps in a precursor to how this set will be reviewed in red states), Lamar moved into an expansive set that resembled a tarmac Compton street corner, another impressive set that was reminiscent of Es Devlin’s Compton street corner that Lamar performed on with Dr Dre, Snoop Dogg and Eminem at the Super Bowl two years ago. It felt at times more like a Lincoln Center play than a half-time show, with dense layered flows and an interplay of dance, Jackson’s spoken-word moments and Lamar album tracks that didn’t always combine to make an obvious point. Lamar is able to deploy one of the greatest flows in the history of rap, but the onslaught of complex verses didn’t always work in this arena and you occasionally longed for a rousing anthem like Alright or Bitch, Don’t Kill My Vibe. But things changed halfway through the set when he teased Not Like Us, in a funny interplay with four female dancers. As the opening bars of the song played over the PA, Kendrick joked: “I want to perform their favorite song, but you know they love to sue,” a reference to Drake’s ongoing defamation lawsuit against the pair’s shared record label, Universal Music. In the week leading up to the Super Bowl there were some rumours that the lawsuit would prevent the song being performed. And for a moment it seemed like it might be. Instead of launching into it, he played Luther and All the Stars, his pair of songs with SZA, whose soaring vocal gave the set a more layered atmosphere and useful counterbalance. Jackson even acknowledged that these more melodic numbers would appease doubting sports fans at home: “That’s what America wants – nice and calm,” he shouted. But then Kendrick slammed on the brakes and swerved in the opposite direction, finally unleashing Not Like Us and it felt euphoric. He revealed a maniacal grin, looking straight down the camera as he said: “Hey Drake”, before launching into his ruinous screed. He did tone down some of the harshest blows – self-censoring the word “paedophile”, likely at both his lawyers’ and censors’ request – but still screeched the devastating lyric: “Tryna strike a chord and it’s probably A minor”, flanked by huge flags that showed small children pointing to a lower-case A. As a final jibe, Serena Williams, an ex-girlfriend of Drake, was seen crip-walking by a lamp post. The Chiefs might have been losing by 27 points at half-time, but it was Drake at that moment who was the biggest loser in North America. Kendrick himself has always seen himself more as an eyewitness than an activist – or as he put it on Family Ties: “I been duckin’ the social gimmicks / I been duckin’ the overnight activists.” This was a classy, intelligent set that chose artistry over easily meme-able moments. Instead the most obvious protest was not seen on TV but in the stadium, as someone managed to join the throng and raise a Palestinian and Sudanese flag atop Kendrick’s GNX. One of the most intriguing things about Lamar is you’ll never know if the protester was storming the stage or a planned part of the set.",
        "web_url": "https://www.theguardian.com/music/2025/feb/09/kendrick-lamars-super-bowl-half-time-show-review-game-over-for-drake",
        "pub_date": "2025-02-10T03:31:07Z",
        "section_name": "Music",
        "tags": [
            "Kendrick Lamar",
            "Super Bowl LIX",
            "Music",
            "Rap",
            "SZA",
            "Hip-hop",
            "Super Bowl",
            "Culture",
            "US sports",
            "US news"
        ]
    },
    {
        "headline": "Nish Kumar: ‘I’d like to rap battle Drake. Even I could take him down right now’",
        "trailText": "The British comedian on his most controversial opinion, explaining Priti Patel overseas and what it is like being ‘the least Zen person alive’",
        "bodyText": "You’re bringing your standup show to Australia. Are you looking forward to explaining who Suella Braverman and Priti Patel are to Australians? I’m slightly horrified by how many people are already aware of Suella Braverman and Priti Patel. I actually wish I’d had to explain more who they were. But I think a lot of that is from seeing people from your ethnic minority rise up the ranks in politics, and feeling politically quite disconnected from them – I think that is broadly relatable. We’ve all been embarrassed by a family member at our wedding. Braverman and Patel are just your uncle throwing up in the punch bowl at the family event. What is your most controversial pop culture opinion? My controversial pop culture opinions are actually a matter of record, and they’re the reason I’m not invited to a lot of show business parties any more. They tend to involve fellow British comedians who may or may not have created a few sitcoms. I tend to run my mouth if I think someone’s being transphobic. I don’t know that that’s a bad thing. My other controversial opinion is people need to shut the fuck up about the running time of movies when they watch 70-hour television shows. I cannot abide with people complaining about The Brutalist or Killers of the Flower Moon. People have infinite patience for shows but not a two-and-a-half hour movie? “Oh I’ve got things to do” – no, you don’t! No one cares about the fact that you’ve got a bad case of the Wednesdays and you’re broadcasting it on Instagram! You have nothing better to do. Our critic Brian Logan once described you as “the least Zen man alive”. Is that right? I actually read that description, and I ran it past my therapist. I said, “This feels more like a review of your work.” She was like, “Listen, I’m telling you what to do. You’re not putting anything into action.” Which was, in fairness, totally correct. I think it’s probably a hard allegation for me to refute. I will say if you are maintaining a kind of Zen status given the current climate, you’re either a Buddhist monk or you have weapons-grade delusion. Sign up for the fun stuff with our rundown of must-reads, pop culture and tips for the weekend, every Saturday morning Do Australian audiences behave differently to British audiences? Australians tend to be slightly more gregarious, but they don’t really heckle. They just feel sorry for you. In England, people don’t feel sorry for you and they will heckle. The last time I went to Australia, I had done various things in my career that I think homogenised my audience – being on TV talking about my views and beliefs had philosophically narrowed my audience down. I think people who come to see me in Melbourne would get on really well with the people who come to see me in Glasgow. They’re all basically the same type of disgruntled leftist. In my last show, I said the only variation in my audience is whether they are currently paying for a Guardian subscription, or if they have recently cancelled a Guardian subscription in protest because the paper is insufficiently leftwing. If you could change the size of any animal to keep as a pet, what would it? I’d quite like to have a small tiger. Can you also moderate the ferocity of the animal? I would absolutely love that. You sometimes see videos on the internet where a lion is friends with a woman and hugs her and stuff. There are those amazing photos – this interview seems designed to exploit my undiagnosed ADHD, by the way – of Tippi Hedren and Melanie Griffith hanging out with lions in their house. I will add a caveat – those lions did injure a lot of people. I don’t have a problem with that! As long as the tiger doesn’t attack me, right? I’d quite like to live under the protection of a tiger. What has been your most cringeworthy run-in with a celebrity? This was a long time ago but I was in a bar at the end of the Edinburgh fringe [festival] and my friend said, “Harry Shearer is behind you.” As a Simpsons obsessive and a massive fan of Spinal Tap and Christopher Guest movies, I was like, “Fuck off!” So I turned around and he was right behind me. He looked at me and I just stared at him for probably about 10 seconds and then just turned back around. I know that that doesn’t sound like a long amount of time, but just imagine someone making eye contact with you for 10 seconds. If you’re reading this, just stare at the mirror for 10 seconds and imagine how it would feel if a total stranger did that to you. What book, film or album do you always return to, and why? At the moment, I’m persistently rereading Doppelganger by Naomi Klein. I’ve got this feeling that she’s asking all of the right questions about why things are getting so out of hand for us as a species. It comforts me to know that there is somebody out there articulating the way a lot of us are feeling. As for terms of movies – I must have seen Goodfellas maybe three million times. Everyone wants to say their favourite Scorsese movie is Taxi Driver or Raging Bull, but you’re lying! Everyone is lying! Goodfellas is the perfect movie. If you put the TV on and Goodfellas is halfway through, you are going to sleep at fucking 2am. What is the best piece of advice you have ever received? Not to shock anybody, but I was a loud, gobby kid who would get into trouble with half the teaching staff, but was indulged by the other half. One of my teachers once told me, “It’s not always worth getting into trouble; you should probably pick your battles.” That’s good advice. Five years ago I was picking fights with people on Twitter. I now reflect on that and go, “I perhaps did not act on that advice – only some fights are worth fighting.” What is the weirdest thing you have done for love? I got in a canoe. That’s not my personality. I know that that doesn’t sound that weird. My partner and her family are much more outdoorsy than me, so I got in a canoe for love. Afterwards, her mother said: “You’re doing your best and we appreciate that.” If you had to fight a famous person, who would it be, how would you fight them and who would win? I’d like to rap battle Drake. That guy’s confidence is so low right now, even I could take him down. I can’t even vaguely rap. I just think this is a good time to get him. Come at me, Aubrey! Nish Kumar is bringing his show Nish, Don’t Kill My Vibe to Australia in April: 8-20 April at Arts Centre Melbourne for the Melbourne international comedy festival; 22 April at Factory theatre, Sydney; 27 April at Rechabite hall, Perth; and 29 April at the Princess theatre, Brisbane",
        "web_url": "https://www.theguardian.com/stage/2025/apr/06/nish-kumar-melbourne-international-comedy-festival-interview-australia-tour",
        "pub_date": "2025-04-05T20:00:35Z",
        "section_name": "Stage",
        "tags": [
            "Comedy",
            "Nish Kumar",
            "TV comedy",
            "Comedy",
            "Culture",
            "Television",
            "Television & radio",
            "Stage"
        ]
    },
    {
        "headline": "‘Silence is key’: after Kendrick Lamar’s Super Bowl, how can Drake possibly come back?",
        "trailText": "Drake was humiliated on record, at the Grammys and now in a football stadium. But as a crisis expert attests, there’s a way he could still return to relevance",
        "bodyText": "It’s fitting that the Drake-Kendrick Lamar beef should end up on the Super Bowl field: “My intent from day one was to keep the nature of it as a sport,” Lamar said in an interview prior to his half-time show on Sunday. As the two rappers’ enmity built into a series of back-and-forth diss tracks in spring 2024, writers reached for boxing metaphors, describing “sparring”, “trading blows” or delivering “haymakers”. It was reminiscent of Pusha T’s words to the Guardian after his own spat with Drake: “What has been more energetic than this?” And of Drake’s own words on one of his earliest hits: “Sports and music are so synonymous / Cause we want to be them, and they want to be us.” Drake fans might grumble that Lamar is now being less than sporting: having clearly won the beef thanks to the huge US No 1 success of Not Like Us – which framed Drake as a paedophile, a claim Drake outright rejected – he is now gleeful in victory. Last month he went to collect five Grammy awards for Not Like Us dressed in a “Canadian tuxedo”: Drake is from Toronto. At the Super Bowl, he brought out Serena Williams to dance during Not Like Us: Drake and Williams were once rumoured to be dating, and Drake later wrote hurt lyrics about her. Lamar’s special guest SZA was one of Drake’s own beloved creative foils. Lamar himself grinned down the camera as he rapped: “Say Drake, I hear you like ‘em young”. At both events, thousands-strong crowds chanted “tryna strike a chord and it’s probably A minor”, a line about paedophilia, at full volume – it was, Billboard stated, “even more deafening in the Superdome than the telecast suggested”. Kendrick wore a lower-case “a” pendant which some fans read as a reference to the line. The “stop, he’s already dead” Simpsons quote is being much shared, and has never been so appropriate. “Kendrick Lamar didn’t just perform at the Super Bowl – he set a cultural agenda,” says Lauren Beeching, a UK-based expert in crisis PR for celebrities. “He’s put so many intelligent Easter eggs throughout the performance; the level of thought and detail in his performance means that this is going to be talked about for days, not hours.” Worse still for Drake, it was at the most popular sporting event in the US calendar. “Regular people are going to learn about it,” Beeching says. “They’ll be Googling: why is this news? If you open TikTok it’s everywhere. So this is being introduced to so many new people.” The beef has clearly energised Lamar: his self-reflexive 2022 album Mr Morale &amp; the Big Steppers was a touch underrated, but there’s no doubt the more playful, oxygenated flow he’s now using is thrilling. Audiences meanwhile love this gossipy, reference-rich sport. But what of Drake? He was once the world’s most-streamed artist, who seemingly had an easy command of every style he turned his hand to: trap, R&amp;B, pop, dancehall, house and more. Now, he’s humiliated and flailing for credibility. A failing was perhaps in trying to appeal to all of those audiences at once. There may well have been genuine passion in forming his collaborations with UK artists such as Section Boyz and Headie One, but – worsened with how he would sometimes mould his accent to south London, Jamaica and more – he became seen as a tourist who was extracting more cultural capital than he was giving back. It meant that when Lamar wrote another devastating section of Not Like Us, where he frames Drake as a leech absorbing cred from Atlanta artists like Future and Lil Baby, many listeners nodded along. More prosaically, Drake has had backlash from suing his own label, UMG, over the allegations made in Not Like Us. “As a rapper it’s not the right look – it’s kind of disrespecting your own trade, and looks hypocritical,” Beeching says. She says that “silence is key for someone like that right now,” and that when one of her clients gets drawn into a spat, “the first day is generally me begging them to not do anything publicly. His smartest move is to just wait, and come back with something that reframes the conversation entirely; a defensive response would be a mistake for him. If Drake tries to reclaim credibility in rap it could feel forced, what with him trying to sue. But maybe he could lean into another aspect of his brand” – one of those other styles, such as pop or R&amp;B. “Luckily he’s commercially successful enough to be able to do that quite easily.” Yet Drake seems unwilling to do that. After the diss tracks ended, he wrote on an image of a samurai facing an army: “Good times. Summer vibes up next.” Had he followed through on that promise, and gifted summer 2024 a more carefree pop-leaning track in the style of One Dance, Hotline Bling or Rich Baby Daddy, he would have reminded the world that here was a style which Lamar, for all his Pulitzer-winning acclaim, has never mastered. And then, perhaps, Drake could have worked his way back to rap credibility. Beeching gives an example of someone who handled a difficult moment well: Taylor Swift, after she was drawn into a feud with Kanye West and Kim Kardashian, and initially painted as a villain. “Instead of fighting back immediately, she disappeared: no statements, no interviews, no social media. Then she returned with Reputation, which acknowledged the backlash but on her terms, without engaging in messy public feuds. She didn’t take the bait, basically.” But instead of pivoting to pop, Drake released three pure rap tracks – one of them with two Atlanta stars, Young Thug and 21 Savage, as if to reclaim his relevance in the city. Later, in January, came a freestyle in which he complained about the friends lost to the Lamar beef. After the Grammys, he went on stage in Australia wearing a vest with smoke pouring out of simulated bullet holes, to say: I’m still standing. Whether this is dignified or corny depends on how much of a Drake stan you are, but it’s undeniable how much the beef continues to affect him – and how his ego, which helped to make him such a big star, won’t let him move on. Will the world let him, either? “Kendrick didn’t just challenge Drake musically, he’s damaged his character in a way that will linger,” Beeching concludes, and yet at the same time, the public tend to “forget really fast and easily – there’s so many public figures right now who were once cancelled or humiliated, who have come back after being quiet for a bit”. Unlike so many of those figures, Drake has never been charged with a crime; he’s been gossiped about and has had some dubious moments, but has never seriously crossed a line in public, in the manner of Will Smith. His streaming numbers have dropped somewhat, but on Spotify there are still 74m people listening to him each month. And while Lamar will carry on performing Not Like Us on his stadium tour with SZA this spring – and everyone will sing along again with the “A minor” line – his victory lap for the beef will now come to a close, and he will probably move on from it. Drake is now 38. That’s old in pop terms – like so many before him, he will almost certainly not remain relevant to each successive generation – but it’s young for an artist, and he remains versatile. He would be unwise to revisit it yet, but the encounter with Lamar, and the way Drake comes to live with it, could still interestingly shape his artistry. And as any sports fan will tell you, everyone loves an underdog – and a second-half comeback.",
        "web_url": "https://www.theguardian.com/music/2025/feb/11/silence-is-key-after-kendrick-lamars-super-bowl-how-can-drake-possibly-come-back",
        "pub_date": "2025-02-11T06:30:09Z",
        "section_name": "Music",
        "tags": [
            "Drake",
            "Kendrick Lamar",
            "Music",
            "Rap",
            "Culture",
            "Super Bowl LIX",
            "Super Bowl",
            "Sport",
            "NFL",
            "US sports"
        ]
    },
    {
        "headline": "TV tonight: inside Drake and Kendrick Lamar’s very public beef",
        "trailText": "Public Enemies looks into the rappers’ spat that nearly broke the internet. Plus: the bereaved people using AI to interact with lost loved ones. Here’s what to watch this evening",
        "bodyText": "Public Enemies: Kendrick vs Drake 10.20pm, Channel 4 What was the beef between Kendrick Lamar – Pulitzer prize recipient and winner of 17 Grammys – and Drake – a five-time Grammy winner with 13 US No 1 albums – that nearly broke the internet earlier this year? This documentary explores the wider context of the rappers’ cultural status, and what exactly led to a public spat that resulted in a diss track with (strongly denied) accusations of paedophilia. Hollie Richardson Mary’s Foolproof Dinners 7.30pm, BBC Two She’s back – and just in time for some homely dishes for those long, dark autumn nights. In this new series, Mary Berry helps celebrity friends to cook comfort foods. First up, she shows Alan Carr how to rustle up Parma ham and cauliflower parcels, and honey-mustard chicken with potatoes. HR The Great British Bake Off 8pm, Channel 4 It’s autumn week, and judges Paul Hollywood and Prue Leith assess the seven remaining contestants on a signature seasonal pie, a parkin cake technical and a vegetable-based showstopper inspired by an autumnal festival – including a Diwali cake with beetroot sponge and a Day of the Dead carrot and courgette creation. Nicole Vassell The Overlap on Tour 9pm, Sky Max The laddish dream team of Gary Neville, Jamie Carragher, Ian Wright and Roy Keane reunite for more banter-strewn road trips. This series begins with a few days in Turin, Italy, and the focus is on Keane (never a bad thing, given his entertaining grumpiness). The others take in the sights while he relives his performance in the 1999 Champions League semi-final. Phil Harrison Storyville: Eternal You 10pm, BBC Four It could be confused for an episode of Black Mirror but this is an eerie and very real look at how AI is being used by bereaved people who want to interact with their deceased loved ones. Startups are exploring this by creating avatars of the deceased – but what are the psychological and ethical consequences? HR Beyond Chelsea 10pm, E4 Binky Felstead, Lucy Watson and Rosie Fortescue were longstanding members of hit structured-reality series Made in Chelsea, which started a whopping 13 years ago. But gone are the days of brutal dinner party spats and cheating with best friends’ boyfriends – this two-parter follows them with their new families and businesses. HR",
        "web_url": "https://www.theguardian.com/tv-and-radio/2024/oct/29/tv-tonight-inside-drake-and-kendrick-lamars-very-public-beef",
        "pub_date": "2024-10-29T06:20:01Z",
        "section_name": "Television & radio",
        "tags": [
            "Television",
            "Television & radio",
            "Culture",
            "Drake",
            "Kendrick Lamar",
            "Rap",
            "Music"
        ]
    },
    {
        "headline": "Drake claims UMG and Spotify ‘artificially inflated’ Kendrick Lamar’s diss track Not Like Us",
        "trailText": "Feud escalates as rapper’s lawyers file two petitions alleging Universal Music Group and streaming giant conspired while also accusing them of defamation",
        "bodyText": "Drake has launched two legal actions against Universal Music Group (UMG) and Spotify, alleging they conspired to artificially inflate interest in Kendrick Lamar’s diss track about him, Not Like Us, while suppressing his own music, as well as accusing them of defamation. In a petition filed to the New York supreme court on Monday, attorneys for Drake’s company Frozen Moments LLC accused UMG and the streaming service of having “launched a campaign to manipulate and saturate the streaming services and airwaves”, using various tactics to make Lamar’s song more popular. “UMG … conspired with and paid currently unknown parties to use ‘bots’ to artificially inflate the spread of Not Like Us and deceive consumers into believing the song was more popular than it was in reality,” Drake’s lawyers write. The petition also alleges that UMG paid influencers to promote Not Like Us on social media and set up pay-to-play agreements with radio stations. A day later, Drake filed a separate legal action in Texas accusing UMG of defamation. The filing, which like the legal action in New York is not a lawsuit but a request for information from key players for a potential future lawsuit, claims that the company was aware that Not Like Us “falsely” accused him of pedophilia, but distributed the track anyway. According to the petition, the company “could have refused to release or distribute the song or required the offending material to be edited and/or removed. But UMG chose to do the opposite. UMG designed, financed and then executed a plan to turn Not Like Us into a viral mega-hit with the intent of using the spectacle of harm to Drake and his businesses to drive consumer hysteria and, of course, massive revenues. That plan succeeded, likely beyond UMG’s wildest expectations.” In the petition, Drake’s attorneys said they had enough evidence to demonstrate defamation by UMG, and that they were considering allegations of civil fraud and racketeering. A spokesperson for UMG told the Guardian: “The suggestion that UMG would do anything to undermine any of its artists is offensive and untrue. We employ the highest ethical practices in our marketing and promotional campaigns. No amount of contrived and absurd legal arguments in this pre-action submission can mask the fact that fans choose the music they want to hear.” Spotify declined to comment. Both Drake and Lamar have been associated with UMG for their entire careers: Drake via Republic Records and Lamar via Interscope. The company owns both labels. But it is an extraordinary step in an escalating battle between the two rappers, which began as an exchange of diss tracks. In songs including Euphoria, Meet the Grahams and Not Like Us, Lamar accused Drake of having sexual relationships with underage girls, as well as fathering secret children. In response, Drake released tracks including Family Matters and The Heart Part 6, which accused Lamar of domestic abuse and infidelity, criticised his collaboration with Taylor Swift and mocked his height. Both Drake and Lamar have always denied any wrongdoing. Drake’s petition alleges that UMG reduced the licensing rates it charges Spotify in exchange for the streamer recommending Lamar’s track to its users even when they searched for unrelated songs or artists. The petition also claims that UMG paid Apple to make its digital assistant Siri “purposely misdirect” users who asked to listen to Drake’s songs to instead stream Not Like Us. The petition also alleges that UMG’s “scheme” led to Not Like Us being streamed 900m times, making it the most-streamed diss track in Spotify history. The track holds Spotify records for biggest single-day streams for a hip-hop song (12.8m) and the most song streams in a week by a rapper (81.2m). Drake’s attorneys allege that “UMG’s schemes … were motivated, at least in part, by the desire of executives at Interscope to maximize their own profits”, and that the success of Not Like Us had led to a boost in streaming of Lamar’s back catalogue, which financially benefited UMG. The petition claims Drake “repeatedly sought to engage UMG in discussions to resolve the ongoing harm he has suffered as a result of UMG’s actions” but claims that the music giant has “no interest in taking responsibility for its misconduct” and instead “pointed the finger” at Lamar, directing Drake to sue the rapper and not UMG. Drake’s attorneys claim they had “received information that UMG has been taking steps in an apparent effort to conceal its schemes, including, but not limited to, by terminating employees associated with or perceived as having loyalty to Drake”. They allege UMG violated the Racketeer Influenced and Corrupt Organizations Act – a federal statute widely known as “Rico”, which is often used in criminal cases against organised crime – as well as deceptive business practices and false advertising.",
        "web_url": "https://www.theguardian.com/music/2024/nov/26/drake-kendrick-lamar-umg-spotify-not-like-us-claims-ntwnfb",
        "pub_date": "2024-11-26T17:51:28Z",
        "section_name": "Music",
        "tags": [
            "Drake",
            "Kendrick Lamar",
            "Music",
            "US news",
            "Culture",
            "Universal Music",
            "Hip-hop",
            "Rap",
            "New York"
        ]
    },
    {
        "headline": "From Drake’s humiliation to Doechii’s coronation: the talking points from the 2025 Grammys",
        "trailText": "Kendrick Lamar celebrated his rap beef victory in a ‘Canadian tuxedo’, Chappell Roan called out the industry and Nashville finally backed Beyoncé",
        "bodyText": "Drake was humiliated It’s the kind of stress dream that pop stars tell their therapists about: “My artistic rival won record and song of the year at the Grammys for a track attacking me, and everyone was dancing and singing along. Even Beyoncé.” And so it came to pass for Drake, seeing Kendrick Lamar win for Not Like Us, walking to the podium in double denim – a “Canadian tuxedo”, no less – while half the arena seemed to chant “tryna strike a chord and it’s probably a minor”, a line alleging child sexual abuse (which Drake has strenuously denied). Drake has long framed the Grammys as somewhere that doesn’t understand rap music and he had already distanced himself from the awards – and perhaps that turned Recording Academy voters against him all the more. But these were deserved wins for Lamar – the beef allowed him to turn his lens away from himself, and in so doing made a very 21st-century entertainment: gossipy, networked, and packed with reference. Meanwhile, having seen the entire industry united in celebration against him makes you wonder anew: where next for Drake? Chappell Roan called for workers’ rights … For all her playfulness on stage and on record, there’s also a seriousness of intent to Chappell Roan: part of the reason she’s so loved is that she totally devotes herself to her craft, selling every line she sings. That’s played out in her earnest politics, too, whether upbraiding a hectoring paparazzo, fretting about who to back (if anyone) in the US presidential race, and championing the rights of queer people and Palestinians. At the Grammys, she used the platform of a best new artist win to advocate for workers’ rights, namely her fellow musicians, with a “demand that labels in the industry profiting millions of dollars off of artists offer a livable wage and healthcare, especially to developing artists.” She spoke of struggling to afford health insurance in her early career, saying: “It was so devastating to feel so committed to my art and feel so betrayed by the system and so dehumanised to not have health[care]. If my label would have prioritised artists’ health, I could have been provided care by a company I was giving everything to … Labels, we got you, but do you got us?” … and Lady Gaga for trans rights As Donald Trump enshrines transphobia in American law, Lady Gaga spoke out, saying: “Trans people are not invisible. Trans people deserve love. The queer community deserves to be lifted up.” She was speaking after winning best pop duo/group performance for Die With a Smile, with Bruno Mars. Doechii capped her breakthrough year … Twenty-six-year-old rapper Doechii beat some of the most venerable, successful and respected MCs in the US – Eminem, Future, J Cole and the paired-up Common and Pete Rock – to win best rap album, only the third woman to win this category after Lauryn Hill and Cardi B. This caps a stunning breakthrough over the past year, with jaws floored by the emphatically enunciated, elastically rhythmic raps on her album Alligator Bites Don’t Heal, and then again by performances such as on Stephen Colbert’s talkshow, her braided hair fused to that of her dancers. Her performance on the Grammys’ stage was even stronger, a brilliantly choreographed strut through Denial Is a River where – with some expert help from her DJ, Miss Milan – she kept her flow going through high kicks, trust falls and a suit-busting bikini reveal. … as did Sierra Ferrell With her fourth album, Ferrell made a clean sweep of the roots and Americana categories, winning all four of the awards she was nominated for (in a less brutally competitive year, she would have got a best new artist nomination too). Dressed in one of the night’s wackier outfits – think East End pearly queen after five rounds of AI enhancement, complete with sceptre – she’s travelled a long way from the trailer-dwelling and freight train-hopping of her youth, to become a multimillion-streaming performer. As country and pop do-si-do ever more tightly, Ferrell, Zach Bryan and more are winning millions of fans drawn to a more authentic and analogue-sounding version of this vintage American music. Beyoncé finally won album of the year She may have been the most-awarded star in history, but given the industry places such stock in the album format, Beyoncé not winning that category felt like a big snub – particularly given her self-titled album lost to Beck’s Morning Phase (not remotely the best album that year or in his own catalogue), while her great masterpiece 4 wasn’t even nominated. So that wrong has now been righted. Some may be dismayed that it took a country album to do it, rather than an R&amp;B, pop or dance record – and Cowboy Carter has plenty of longueurs and even outright missteps. But it also contains some of Beyoncé’s most imaginative and beautiful music – the way Riverdance flows into II Hands II Heaven makes it the loveliest brace of songs on an album in her catalogue. Its bigger win in some ways is best country album, showing that Beyoncé has convinced not just the broad pool of voters in the general field categories, but also the Nashville establishment who vote for the country awards. An American won best global music album Matt B, a little-streamed musician born and raised in Illinois and based in the US, beat representatives from Spain (Antonio Rey), Peru (Ciro Hurtado), and Nigeria (superstars Tems and Rema) to win best global music album for Alkebulan II, recorded with the Royal Philharmonic Orchestra. His album certainly creates a global dialogue, as he explores his African heritage with multilingual lyrics, lilting Afro-pop, and guests such as South African poet Nomfundo Khambule. But as the US enters its protectionist era under Trump, there may be some disquiet at this win. A multimillionare businesswoman won best new age album It’s a shame that the great Ryuichi Sakamoto, the Japanese musician who died of cancer aged 71 in 2023 having changed the face of his country’s popular music, wasn’t honoured in the category for best new age, ambient or chant album. His nominated LP Opus was full of his very particular piano style, full of chords that feel cautious and yet intentional, and where sentimentality is offset by chalky, dissonant notes. Instead, he lost to the little-heard Triveni by Wouter Kellerman, Eru Matsumoto and Chandrika Tandon, the latter a businesswoman and philanthropist (and sister of former Pepsi CEO Indra Nooyi) who worked for McKinsey before starting her own financial services firm. The Academy still loves Chris Stapleton He lost to Beyoncé in the country album category, but Stapleton notched up his fifth win in 10 years in the best country solo performance category, a mark of how much the country-voting portion of the Recording Academy adores this artist, who pleases both staunch traditionalists while being relatively progressive – that’s 11 wins overall for him now. It’s a shame, though, that he won with a low-stakes ballad from the same album as his win last year, while shutting out Shaboozey’s pop culturally dominant A Bar Song (Tipsy) in the process. Chris Brown was awarded Way after his notorious assault on Rihanna, Chris Brown has been accused of a long list of crimes against numerous women over the years, which he has denied – last week he sued over how he was represented in a new documentary, with lawyers saying: “Mr Brown has never been found guilty of any sex related crime … but this documentary states in every available fashion that he is a serial rapist and sexual abuser.” His win for best R&amp;B album, over a big breakthrough by Muni Long and another veteran in Usher, plus others, shows that he still has his backers in the Recording Academy. But there has been disquiet online – just as there has for Kanye West’s red carpet appearance with his wife, Bianca Censori essentially appearing nude, the latest in a series of mute, near-undressed appearances alongside him that have provoked widespread concern for her welfare. Female artists did well – but men still dominate behind the scenes Two of the “big four” were won by female artists, but when you look into the actual winners, they were overwhelmingly male. These awards are shared by the producers, songwriters, engineers, mixers and mastering engineers and while there is some heartening female representation – such as Idania Valencia who mastered Charli xcx’s Brat, and songwriters such as Elizabeth Lowell Boland and songwriter of the year winner Amy Allen – analysis by Akas found that only 9% of winners in the top four categories were women. And it was a bad night for the Brits Charli xcx was the chief British representative, and she gave an instantly viral bum-wiggling, underwear-chucking live performance of Guess on the night, but she was shut out of the big prizes, making do with dance-pop awards. And it wasn’t a great night for other Brits. Belfast’s Jordan Adetunji was beaten to the melodic rap prize by Rapsody and Erykah Badu, Raye lost out twice, while Jacob Collier’s seventh win was a minor award, for arrangement. Instead we had to rely on the Beatles and the Rolling Stones for some face-saving wins, for best rock performance and album respectively (while Sean Ono Lennon also picked up an award, for co-creating the box set release of his father’s album Mind Games). • This article was updated on 3 February with a correction: Beyonce’s self-titled album, not Lemonade, lost to Beck’s Morning Phase.",
        "web_url": "https://www.theguardian.com/music/2025/feb/03/from-drakes-humiliation-to-doechiis-breakthrough-the-talking-points-from-the-2025-grammys",
        "pub_date": "2025-02-03T14:27:50Z",
        "section_name": "Music",
        "tags": [
            "Grammys",
            "Music",
            "Culture",
            "Awards and prizes",
            "Kendrick Lamar",
            "Chappell Roan",
            "Beyoncé",
            "Lady Gaga",
            "Charli xcx",
            "Chris Stapleton"
        ]
    },
    {
        "headline": "Drake’s lawsuit against Kendrick Lamar also puts artistic freedom on trial",
        "trailText": "Drake is understandably vexed about lyrics framing him as a ‘certified paedophile’ – but diss tracks are a deliberately lurid part of rap",
        "bodyText": "There were people who thought Drake v Kendrick was the greatest hip-hop beef of all time, attracting a wider level of public interest and proceeding at a more dizzying velocity than any previous feud: the parties involved released 10 tracks in the space of six weeks, more if you count J Cole’s withdrawn 7 Minute Drill and producer Metro Boomin’s BBL Drizzy, released as a contest to see which member of the public could add the best insult of Drake to the instrumental beat. On the other hand, there were high-profile naysayers, among them rapper Macklemore, who complained that the feud was distracting attention from the war in Palestine; and Roots drummer, DJ and hip-hop historian Ahmir ‘Questlove’ Thompson, who called it “wrestling match level mudslinging and takedown by any means necessary” for an “audience wanting blood [that] will soon put up RIP posts like they weren’t part of the problem”: proof, he suggested, that “hip-hop is truly dead”. But there was little debate about who won the battle: it wasn’t just that Lamar’s Not Like Us landed a series of blows on Drake that genuinely seem to have damaged his reputation, it was the sheer scale of its success. No other diss track in history has ever gone to No 1 on the Billboard Hot 100; unequivocally the biggest hip-hop single of 2024, Not Like Us has been nominated for five Grammys. Drake released a response called The Heart Part 6 the day after Not Like Us appeared, and the reaction was so negative that Drake quietly deleted an Instagram post promoting it. And that, one might reasonably have assumed, was that, until November of last year, when Drake unexpectedly filed a petition against Universal Music Group – which releases both Lamar’s music and his own – and Spotify accusing them of deceptive business practices: they had, he claimed, used bots to stream the song and “deceive consumers into believing [Not Like Us] was more popular than it was in reality”. The following day, he filed another petition against UMG under Texas law claiming defamation – Not Like Us had “falsely” accused him of being a sex offender – and a payola scheme involving internet radio platform iHeartRadio. UMG and Spotify denied the allegations. Earlier this week, he withdrew the legal petition – but then filed an actual lawsuit against UMG: Not Like Us, it alleges, was “intended to convey the specific, unmistakable, and false factual allegation that Drake is a criminal pedophile, and to suggest that the public should resort to vigilante justice in response” and his own label “decided to publish, promote, exploit, and monetise allegations that it understood were not only false, but dangerous”. UMG have repeated their denial, calling Drake’s claims “untrue” and “illogical”. The view that these are the petulant actions of a very sore loser has been regularly expressed. That said, you can understand why Drake might feel driven to the defamation suit. The lyrics of Not Like Us alter the title of his 2021 album Certified Lover Boy to “certified paedophiles”: “I hear you like ‘em young … just make sure you hide your little sister from him,” taunts Lamar, presumably in reference to a 2010 video that showed Drake kissing a fan on stage at a show in Denver, shouting “I can’t go to jail yet, man!” when she revealed she was 17 (the legal age of consent in Colorado), then adding: “I don’t know if I should feel guilty or not, but I had fun. I like the way your breasts feel against my chest.” The video made headlines when it resurfaced in 2019, but accusations of sexual impropriety feel even more pointed in the wake of ongoing allegations against Sean Combs – currently awaiting trial in New York on charges of racketeering, sex trafficking by force, and transportation for purposes of prostitution – and Jay-Z, who in December was accused in a civil lawsuit of raping a 13-year-old girl with Combs at an MTV Video Music Awards afterparty in 2000 (Jay-Z denied this, and filed both a motion requesting that the accuser identify themselves and a lawsuit against the accuser’s attorney). How Drake’s case will play out is an intriguing question. There aren’t many precedents for a defamation suit based on song lyrics. In 1999, Eminem’s mother, Debbie Mathers, attempted to sue her son for $11m (£6.8m at the time) over lines about her drug use on his album The Slim Shady LP: she was eventually awarded $25,000 (£15,500), and after paying her lawyer was left with just $1,600 (£1,000). In 2005, a case brought by record producer Armen Boladian over lyrics on rapper Warren G’s 2001 track Speed Dreamin’ – which called him “a disgrace to the species” and a “big nose motherfucker”, and suggested he should have “faeces” thrown at him – was dismissed, with the offending lines judged to be “rhetorical hyperbole”. Both Drake and UMG might note the wording of the judgment: “There was no specific allegation, such as an act of child abuse, that could be proven.” But “rhetorical hyperbole” is an interesting phrase in the context of Not Like Us. The alleged defamation took place in the midst of a beef involving umpteen diss tracks. Anyone conversant with hip-hop history knows that the world of the diss track is a peculiar kind of space in which outlandish claims and insults are taken as standard fare: they’re spiteful, nasty, obviously intended to be wounding and often clearly untrue. They have their critics, who often worry about the consequences if the abuse spills over into real life, which it clearly has done more than once in the past, occasionally with deadly consequences: “Those were dark times if you were there,” wrote Questlove, a man who found himself literally in the middle of the warring east coast/west coast factions at the 1995 Source Awards, one of the flashpoints of the feud between 2Pac and the Notorious BIG that left both rappers dead. But diss tracks are also an integral part of the genre, almost as old as hip-hop itself. You could, if you were so minded, draw a line connecting Not Like Us to the insults traded by UTFO and Roxanne Shante in 1984’s Roxanne wars, or the row between MC Shan and Boogie Down Productions over hip-hop’s true birthplace in 1986, although it’s hard to do that without also noting that diss tracks have become more pointed in a faintly troubling way in recent years, dragging artists’ families and, increasingly, children into the firing line as a means of scoring points. No one is ever going to hold up Ether, Nas’s 2001 evisceration of Jay-Z, as a model of decorum, but it still feels like it’s made of different stuff to Pusha T’s stakes-raising The Story of Adidon, an all-out 2018 assault on Drake’s personal life and mental health that one critic described as “bringing a gun to a knife fight”. If Drake’s suit is successful, it throws a hand grenade into a whole area of rap culture. Even if you think the said area could do with cooling down a few degrees, the notion of using the courts to do it is a deeply peculiar one at best; the idea that rappers making diss tracks will be forced to mind their manners or face legal consequences feels somehow antithetical to the whole business, and you could easily depict it as a form of censorship. The case comes in the wake of another rap superstar, Young Thug, being put on trial with his lyrics used as supposed evidence against him, which was criticised as an assault on free speech and artistic expression. Many will see Drake’s lawsuit as doing the same – and against a fellow rapper, no less. It doesn’t take a huge leap of imagination to see Drake being painted as a man who singlehandedly destroyed a longstanding rap tradition that he was perfectly happy to engage in for years – feuding on tracks with everyone from Kanye West to Meek Mill to Tyga – because he was bested at it. A victory in court could turn out to be pyrrhic.",
        "web_url": "https://www.theguardian.com/music/2025/jan/17/drake-lawsuit-against-kendrick-lamar-also-puts-artistic-freedom-on-trial",
        "pub_date": "2025-01-17T13:09:47Z",
        "section_name": "Music",
        "tags": [
            "Music",
            "Rap",
            "Hip-hop",
            "Culture",
            "Drake",
            "Kendrick Lamar"
        ]
    },
    {
        "headline": "The Long Wave: The Lamar v Drake beef has gone legal – what does it say about today’s hip-hop industry?",
        "trailText": "In this week’s newsletter: Lawyers are now involved in the most explosive rap feud of the century. A look at the potential cultural and commercial impact, and how hip-hop became big business",
        "bodyText": "Hello and welcome to The Long Wave. Kendrick Lamar v Drake was already the biggest rap beef of the 21st century – and then it got legal. This week I spoke with Nels Abbey, Guardian contributor and author of The Hip-Hop MBA: Lessons in Cut-Throat Capitalism from Rap’s Moguls, for his take on Drake’s legal action against Universal Music Group (UMG) and Spotify. He argues that to understand this latest development, you need a business lesson on how the hip-hop industry became what it is today. Let’s get into it, after the roundup. Weekly roundup Ghana’s new old president | John Dramani Mahama, who was president of Ghana from 2012 to 2017, has won a historic comeback election victory, after voters ousted the incumbent New Patriotic Party in rebuke of its management of the country’s deepening economic crisis. France withdraws from Chad | France has begun recalling its military assets from Chad, as its influence wanes across its former colonies in Africa. As west Africa correspondent Eromo Egbejule reports, this follows the expulsion of French diplomats, banning of French media and withdrawal of troops in Burkina Faso, Mali and Niger. Jay-Z accused of rape in US lawsuit | Jay-Z has been named alongside Sean “Diddy” Combs in a lawsuit alleging that the pair raped a 13-year-old girl after the MTV video music awards in 2000. Jay-Z denied the allegations on social media, dismissing the lawsuit as a “blackmail attempt”. Black patients less likely to survive stem cell transplants | Ethnic minority cancer patients from all backgrounds face an increased risk of fatal complications after donor stem cell transplants in the UK. As UK health and inequalities correspondent Tobi Thomas reports, a study found that “there was a higher risk of death in the 100 days after the transplant for Black and Asian patients compared with white patients”. Poetry slam resurgence in Africa | Young Francophone Africans across west and central Africa are packing out poetry slams, as performers find an outlet for their disenchantment with military coups, rising unemployment and a worsening cost of living crisis. In depth: a generational rap beef If you want the scene-by-scene play of how the Kendrick Lamar and Drake spat developed, you can read this explainer, but what matters most is Lamar’s diss track Not Like Us, which is the subject of Drake’s legal action. It became a viral sensation when it was released in May, debuting at No 1 in the US, definitively crowning Lamar as winner of the feud and immediately becoming a staple of global Black nightlife. Where previously we’d finish parties on an electric slide to Cameo’s Candy, Not Like Us was seeing us out the dance, with people rapping every bar. Drake, who had boasted about his mammoth commercial size and status as an international hitmaker, was now the victim of a track that set several Spotify streaming records and had global reach. But Drake had not only seemingly lost in the cultural sense; the beef also represented a business failure. His supposed preferential standing within music labels had been a source of bravado for him – on the track Push Ups he taunted Lamar about his alleged 50% contract split with his former label Top Dawg Entertainment, which Lamar had left in 2022. But now, at their shared parent company UMG (Lamar and Drake are signed to UMG subsidiary labels Interscope and Republic, respectively), Lamar has come out on top. A deeper story on the business of hip-hop has begun to emerge. “Competition has helped decide practically everything in hip-hop, from who’s going to be the bestseller, or even who gets to go first on a song,” Nels Abbey says. It’s crucial here to zoom in to examine the different types of competition in different industries. You have oligopolies, where a few large companies dominate the industry – Abbey provides the example of Coca-Cola and PepsiCo sharing about 70% of the US soft drinks market. Then you have monopolies, where just one company dominates an industry. And then you have “monopolistic competition” – where many companies may be selling the same base product but with significant differences, say hair salons or clothing stores. Abbey classes hip-hop as a “monopolistic industry”. Lamar and Drake are not interchangeable entities – while they are both rappers, they are incredibly different as artists. Drake is “the ladies’ man, the party guy, a bit introspective sometimes”, whereas Lamar is “conscious rap, much more lyrically dense, more of a hip-hop purist”. On paper, they’re not natural competitors as, despite previous collaborations, they occupy different lanes. But as Abbey explains, hip-hop has not historically taken the monopolistic approach: “Going all the way back to Death Row and Bad Boy Records, right the way to Drake and Kendrick now, hip-hop often operates like cut-throat oligopolies, competing for market share, so quite intense.” For Abbey, hip-hop artists’ backgrounds of economic deprivation, gang wars and rivalry, both local and continent-wide, mean that “something that should be a business competition becomes intensely personal, almost as if they try to destroy each other as people”. You saw it with Eazy-E v Dr Dre, and Biggie v Tupac. “That personal diss track of course becomes a record,” Abbey says, and record sales then add another layer of competition. *** How big record labels took over hip-hop What does it mean for record labels themselves to be involved in this competition, where a rap beef culminates in litigation? For Abbey, this requires digging into how hip-hop became big business. “In the beginning, big record labels didn’t view hip-hop as real music, which created a lane for small independent businesspeople to occupy and cultivate hip-hop into an industry.” Early hip-hop in the late 1970s was managed by executives such as Sylvia Robinson, whose Sugar Hill Records created the Sugarhill Gang and later signed Grandmaster Flash and the Furious Five. In the next decade, big record labels finally caught on to the profit potential. They approached and signed rappers such as Vanilla Ice and MC Hammer, who “sold massive records, but lacked cultural credibility – meaning that if you’re trying to create an empire in this business, when you find one person, you want to be able to attract more talent,” Abbey says. The problem big labels found was that “young talent coming from the hood don’t want to be the next MC Hammer or Vanilla Ice, they wanted to be an Ice Cube or an Eazy-E, so they were still running to independents because they wanted to be like the people they looked up to”. But then, in the 90s, deregulation of the music industry led to the emergence of big entertainment conglomerates. As a result, Abbey says, “small hip-hop record labels started to get purchased or do big deals with those big labels. Universal [UMG] purchased Def Jam and Interscope, which owned Death Row Records. That’s pretty much how they became the market leaders today, and how all these independent hip-hop executives such as Russell Simmons became wealthy people.” (Simmons sold his share of Def Jam for $120m in 1998.) But for those labels that resisted being bought out, bigger labels would use their financial power to crowd them out of the market. As Abbey explains, hip-hop music videos in that era transformed from being “hood focused” to featuring images of luxury – the Hamptons, helicopters and private jets. Take Notorious BIG’s Hypnotize or Busta Rhymes’s What’s It Gonna Be?!. Major TV stations couldn’t resist broadcasting the blockbuster-like productions, and “the small independents who didn’t have the money to make those big videos struggled to get their videos on air”. As money flooded into hip-hop, from music videos to payola, “it was effectively over for the little man”. *** Kendrick v Drake – what makes a winner? So, back to Kendrick v Drake. In 2021, Drake signed what was described as a “LeBron-sized deal” with UMG. As Abbey stresses, no one knows the details, but it is rumoured to be in the hundreds of millions (he rapped “500 million just for Aubrey” on Major Distribution). It could require him to meet certain sales figures or other performance indicators to access the full sum, and there could be a clawback clause to recuperate money already paid if these aren’t met. What we do know is that Drake and Lamar are both signed to labels owned by UMG. Abbey emphasises that UMG is not a monolithic entity: “It’s a vast entertainment block where you may have different silos where people might even have issues with each other. We can’t forget the role of competition even within UMG – these executives are going to be competing with each other.” Now, the norm for a record label whose artist is engaged in a generational rap beef would be to throw all resources behind the artist to ensure the beef is won, since “it helps create soft power for the label, makes them more credible in the actual business, and it helps them attract talent, too”. That’s how it happened during the early 2000s beef between Nelly and KRS-One, which has parallels with Drake v Lamar, the pop star versus the pure hip-hop vanguard. In that beef, Nelly won, as Universal Records were able to drown out KRS-One’s diss track Ova Here by pushing Nelly’s Roc the Mic (remix), where he mockingly raps that the “old man should get a rapper’s pension” (KRS-One later described Universal as “an oppressor”). But if both artists are under the same conglomerate, surely that would imply label neutrality, particularly in a monopolistic industry where there’s presumably little benefit from one eliminating the other? Well, this is the entire basis of Drake’s legal filing: he is claiming that UMG and Spotify conspired to artificially inflate streams of Not Like Us while suppressing his own music, and he’s shaping up to sue for defamation on the basis that Lamar’s lyrics accused him of child sexual abuse, which he strongly denies. While Drake has been ridiculed for diminishing rap beef by running to the courts, it is odd that UMG would permit such lyrics considering the reputational risk. And this is where Drake’s allegations against UMG, if true, may not just be poor sportsmanship. As Abbey explains: “Spotify, like every streaming company, has a fixed rate for songs in terms of share of profit Spotify gives to the label and therefore the artist. Drake claims that Spotify and UMG reduced the rate the label will receive on Not Like Us, meaning that Spotify were effectively incentivised to boost the song to receive a greater degree of profits.” Drake’s allegations against UMG suggest that it effectively helped to sabotage one of its biggest assets, threatening his career and continuing commercial viability. A spokesperson for UMG said last month that the suggestion that it would “do anything to undermine any of its artists is offensive and untrue”. All in all, if the aim of a rap beef is to destroy your opponent, Lamar may have achieved that goal. And, regardless of what camp you’re in, the feud does raise some important questions. Drake is, of course, by no measure the little guy in a David and Goliath scenario. And we can’t be certain of the impact on his career until he drops a new project, or of the credibility of his legal action until more details emerge. But, in the timeline of rap beefs and competition in hip-hop, money has always worked harder and faster than any pen could. • Nels Abbey’s book The Hip-Hop MBA: Lessons in Cut-Throat Capitalism from Rap’s Moguls is out now. Sketch • To receive the complete version of The Long Wave in your inbox every Wednesday, please subscribe here.",
        "web_url": "https://www.theguardian.com/global/2024/dec/11/tlw-11-12-24",
        "pub_date": "2024-12-11T12:20:52Z",
        "section_name": "News",
        "tags": [
            "Hip-hop",
            "Race",
            "Rap",
            "Drake",
            "Kendrick Lamar",
            "Music",
            "Culture"
        ]
    },
    {
        "headline": "Public Enemies: Kendrick vs Drake review – inside the beef that sent the world’s two greatest rap stars to war",
        "trailText": "Clearly neither rapper had anything to do with this deep dive into their famous feud – and it makes for a refreshing alternative to hip-hop hagiography",
        "bodyText": "The sky isn’t as blue, the grass not so green, food now tastes like sawdust and life just hasn’t been as sweet, since rap superstars Kendrick Lamar and Drake ceased their epic beefing back in May. So it is with gratitude that we hip-hop heads receive this hour-long documentary rehash. It doesn’t go deep into the music itself, a total of 10 tracks – five from Lamar, five from Drake – released between 22 March and 5 May of this year. But there are numerous TikTok explainer videos for that. Rather, Public Enemies works by paralleling the biographies of both artists, to cast light on the present state of hip-hop, the music industry and the culture at large. These men were born within months of each other, but while Kendrick Lamar Duckworth grew up amid the poverty, gang activity and racist police brutality of 1990s Compton, LA (cue some pumping NWA on the soundtrack), Aubrey Drake Graham was a son of the suburbs. The Toronto suburbs, to be exact, where he was born to a white Jewish mother and a Black American father and raised as one of few kids of colour in a majority-white, Jewish community. The proof of this is home video footage of a pre-growth-spurt Aubrey, complete with Coke-bottle glasses and braces on his teeth, rapping at a barmitzvah. The fact that we’re even seeing this, courtesy of some of Aubrey’s preppy-looking so-called pals, is our first clue that this is very much the unauthorised biography. Clearly neither rapper, nor any member of their inner circle, was anywhere near this production. But if you’re sick of the usual hagiographies – even when partially disguised by Lego, as in Pharrell Williams’s new one – maybe that’s no bad thing? Instead, we hear from people such as the seventh grade English teacher who encouraged young Lamar’s poetic talents, and who offers some sense of the traumatising effects of US gun violence (“I’ve lost 32 students. I’ve been to 19 funerals.”) And the Canadian TV producer who turned Drake into a teen idol by casting him in the high school soap, Degrassi: The Next Generation. She talks about something that’s also evident in those barmitzvah bops: Drake’s precocious confidence. The key thing here is not just the different class and racial contexts of their upbringings, but the different mindsets each brought to the game. Drake was an already famous heart-throb – or Certified Lover Boy, if you prefer – with his eyes on the prize of global stardom. Lamar was grinding away in relative obscurity, but embedded in one of hip-hop’s historic proving grounds, and steadily honing his craft. As with all the bitterest rivalries, they also started off as friends. At least, in 2012, Drake invited Lamar to support him on tour and endorsed the then-less-famous rapper’s second album. A straight exchange of popularity for credibility, perhaps? Or an early example of that “culture vulture” thing Drake does: swooping in to global rap scenes to become, according to his most prominent critic, “not a colleague” but a “coloniser”. It would have been interesting to get more into the British iteration of this phenomenon, from Drake’s patronage of Top Boy to his cringey “girls-dem” pronunciation on J Hus’s Who Told You, and the Lamar lyrics graffitied on his Carnaby Street OVO store. But Public Enemies only superficially acknowledges the creatively generative power of rap rivalries in general. Maybe this is all just a distraction from the harrowing conflicts that have truly characterised 2024 – such as Elon Musk v democracy or western imperialism v Palestinian lives. But if we’re gonna get into it, let’s really get into it: who does the “us” of Lamar’s Not Like Us exclude? What does it say about changing masculine ideals that many of the insults revolved around paternal responsibility? And can you feature on a Taylor Swift single and still hold your head up in the hood? Sometimes this documentary seems more about applying salve to Drake’s third-degree burns, with XXL magazine’s former editor-in-chief Elliott Wilson proving a particularly soothing battlefield nurse. He reiterates Drake’s overall contribution and points out that the charge of inauthenticity is always levelled at hip-hop artists who don’t fit the mould: not Black enough, not American enough, not street enough. That doesn’t necessarily mean it’s warranted. His point is well taken. But then the Not Like Us beat hits and – sorry to this man – it’s all over. • Public Enemies: Kendrick vs Drake is on Channel 4",
        "web_url": "https://www.theguardian.com/tv-and-radio/2024/oct/29/public-enemies-kendrick-vs-drake-review-inside-the-beef-that-sent-the-worlds-two-greatest-rap-stars-to-war",
        "pub_date": "2024-10-29T23:20:41Z",
        "section_name": "Television & radio",
        "tags": [
            "Television & radio",
            "Culture",
            "Television",
            "Drake",
            "Kendrick Lamar"
        ]
    },
    {
        "headline": "The Long Wave: How Brazil is celebrating its Black heritage",
        "trailText": "Afro-Brazilians marked Black Consciousness Day as a national holiday for the first time, but the celebrations are facing resistance. Plus, a fertility ‘miracle’ rattles Nigeria and Kendrick Lamar’s surprise drop",
        "bodyText": "Hello and welcome to The Long Wave. It was a big week in Brazil, where Black Consciousness Day on 20 November was a public holiday for the first time. I spoke to Tiago Rogero, our South America correspondent, about the significance of the day and the big changes happening in Brazil’s approach to race. But first, the weekly roundup. Weekly roundup Ghana’s illegal gold-mining boom | Our west Africa correspondent, Eromo Egbejule, reports on how the illegal mining trade in Ghana is wreaking environmental devastation, causing muddied rivers and huge craters, as well as the loss of an estimated $2bn in annual tax revenues due to more than a million people being employed in the informal mining sector. Fertility ‘miracle’ rocks Nigeria | The BBC World Service has investigated a cryptic pregnancy scam in Nigeria, in which fraudsters convince vulnerable women to pay for an expensive “miracle fertility treatment” supposedly guaranteed to get them pregnant. One woman says she was led to believe she had given birth after being pregnant for 15 months. Band Aid backlash | As Do They Know It’s Christmas? by Bob Geldof and Midge Ure’s charity supergroup Band Aid is revamped and rereleased for its 40th anniversary, critics are again expressing frustration over the patronising lyrics, stereotyping of Africans and distraction from questions about economic justice. The author Nels Abbey argues that Band Aid has “turned out to be a western soft power coup and an assault on Africa”. Gabriel Moses designs Brit award trophy | The British-Nigerian artist was revealed as the designer for the 2025 Brit award trophy. Moses, who has collaborated with the likes of Skepta, A$AP Rocky and Tems, joins an alumni of Black Brit award designers including Olaolu Slawn, Yinka Ilori and the architect David Adjaye. Kendrick Lamar’s surprise drop | The West Coast rapper has surprised fans with the unannounced release of a 12-track album. With production by Jack Antonoff and contributions from SZA and Roddy Rich, GNX rounds off a year in which Lamar released three diss tracks against his former Poetic Justice collaborator Drake. And, in the latest plot twist, Drake has begun legal action against Universal Music Group, accusing the label of artificially inflating streams of Lamar’s diss track Not Like Us. In depth: A long history of Afro-Brazilian resistance Black Consciousness Day goes back as far as the 1960s in Brazil. But the movement behind it has a much longer history with origins in the bloody resistance to slavery in the country. It was informally celebrated on 13 May, the day slavery was abolished in Brazil in 1888. In 1972 the date was changed to honour the death of Brazil’s most famous resistance leader, Zumbi, who was killed by Portuguese colonial forces on 20 November 1695. When Black Consciousness Day was centred on the abolition of slavery it was bittersweet, Tiago tells me. “All the celebrations used to focus on the white princes who signed the abolition. So in the 1970s, a group of students decided to establish a date to counter the one in May.” The establishment of the day as a nationwide public holiday for the first time is, Tiago says, “the result of the struggle of the Black movement” over the past five decades. Today, the date is one where a thriving grassroots network of groups that form the Black movement in the country come together to play music, dance and hold educational events to boost pride and connection with Brazil’s Black heritage. But it is also an opportunity to make broader political demands. Alongside Afro-themed parades, capoeira circles, samba extravaganzas and art exhibitions, a march in São Paulo celebrated the public holiday and supported calls for an end to the six-day working week. *** ‘We are a majority Black country’ The first publicly observed Black Consciousness Day is a breakthrough, Tiago says, but it is also a culmination of many years of social progress. In the early 00s, affirmative action integrated more Black people in higher education, resulting in a burst of activism that became focused on November. “All of November is our unofficial Black consciousness month – and 20 November is the cherry on top,” he adds. This year there were 38 activities in São Paulo alone that day. “In November, the TV channels and newspapers remember that we are a majority Black country.” TV Globo – Brazil’s biggest TV channel and the most watched in Latin America – gave Black Consciousness Day a prime spot this year. “Soap operas are a huge thing here,” Tiago says, “and after the main soap opera, there was a 50-minute special about Black Consciousness Day that focused on Black people who are arrested wrongfully based on photo recognition, which is a huge problem.” *** Not everyone wants to celebrate Despite the celebrations, the day is still “a [powerful] demonstration of how Brazil is divided; there is still a lot of resistance and backlash”, Tiago says. Every 20 November, there is criticism from the far right – and even “the average Brazilian” – who claim “talking about racism brings more racism and that ‘Brazil is not a racist country’”. This commonly held view becomes more “aggressive” in November, Tiago says, especially amid the growing backlash over the fact that, in Luiz Inácio Lula da Silva, Brazil has a “progressive president who has been important for the Black movement”. This year, one mayor refused to comply with the law and did not observe the national holiday. I suggest to Tiago that this appears to be a contradictory situation, one where there is an incredible legacy of Black resistance and a vast population of African descent – the largest outside Africa, in fact – but even the most basic conversation about racism has not begun. Tiago agrees, and attributes this to Brazil’s unique history and specific type of racism, one that is rarely expressed publicly but manifested through prejudice and discrimination. “Unlike the US and South Africa, Brazil did not have segregationist laws – yet segregation here happens on a daily basis. In every single socioeconomic indicator, Black people occupy the worst positions: violence, education, health. At the same time, if you look at who runs the companies and who is in Congress, it is mostly white people.” Tiago says Brazilians will not be openly racist in most cases, only in private spaces. “It’s not easy to talk about racism because we always face arguments that Black people are still the ones trying to divide the country. It’s weird and difficult to compare to other countries,” Tiago says. “We have made so many advances” but are still so far from achieving equality. He says the most heartbreaking thing is that “a lot of Black people in Brazil still believe that talking about race only makes things worse. They think this way because of history, the media, and the money [used for propaganda] that help feed into this idea.” *** An inevitable march towards progress I ask Tiago if Black Consciousness Day is part of a pattern that over time will make Brazil appear, and think of itself, as a country with a large and increasing Black population, or if such a step will be challenging because the elites and establishment are not Black. “This is already happening,” Tiago says, adding that more needs to be done to achieve equality. In the meantime, he points to the importance of fighting against a sense of alienation, something I found so moving. Even as someone who has never visited Brazil, I immediately recognised what can only be described as an atmosphere of dispossession. Which is why Black Consciousness Day and its associated events are so crucial – they lay claim to public spaces. Tiago lays that claim through Black walks, a growing cultural movement of strolling through the Black areas in your town. These are physical and metaphorical steps of reclamation: “We fight for the right to feel comfortable in our own skin, our own cities, in our own country. We are the ones who literally built this country and we should be the ones who own it.” What we’re into In my early teens, I was big into hip-hop and downloading mixtapes off DatPiff (if you know, you know). So I was so ecstatic when J Cole’s 2009 mixtape, The Warm Up, finally dropped on streaming platforms last Friday. A true classic. Jason I stumbled on the AlMultaqa Chamber Orchestra, an Afro-Arab ensemble based in the United Arab Emirates that merges musical influences that land in my sweet spot. But the range of genres the orchestra plays is what is amazing. Check it out here. Nesrine These images from the Africa Foto Fair, held in Abidjan, Côte d’Ivoire, are a visual treat. I particularly love Taiwo Aina’s shot of a female boxer and Gus Sarkodee’s exploration of musicianship. Jason Stop splashing out on pricey protein bars and boil and season some lupin beans instead. I used to buy these on the roadside in Sudan but have finally mastered how to make them at home. Though it’s a long process, they make the perfect high-protein snack. You’ll be hooked, I promise. Nesrine Black catalogue Last weekend I spoke at the Cambridge literary festival on a panel celebrating the centenary of James Baldwin’s birth. Before we began, a clip from the Giovanni’s Room author’s legendary 1965 Cambridge Union debate against the conservative pro-segregationist William F Buckley was screened, which Baldwin won by a landslide majority with 544 votes versus 164. His distinction as a stylish orator, with singular moral clarity and the most admirable poise and elegance in the face of a political adversary, makes this an engrossing watch almost 60 years later. Take a look at the debate here. Jason Tap in Do you have any thoughts or responses to this week’s newsletter? Share your feedback by replying to this, or emailing us on thelongwave@theguardian.com and we may include your response in a future issue.",
        "web_url": "https://www.theguardian.com/news/2024/nov/27/pride-progress-parades-brazil-celebrating-black-heritage",
        "pub_date": "2024-11-27T12:17:00Z",
        "section_name": "News",
        "tags": [
            "Brazil",
            "Race",
            "Nigeria",
            "Ghana",
            "Black British culture",
            "Art",
            "Culture",
            "Photography",
            "Kendrick Lamar",
            "Drake",
            "Rap",
            "Hip-hop"
        ]
    },
    {
        "headline": "‘A revelation and a joy’: Mike Leigh pays tribute to cinematographer Dick Pope",
        "trailText": "Pope, who died this month, worked on every film Leigh has made since 1990. It was a professional partnership of ‘total harmony’, says the director",
        "bodyText": "Forgive the cliche, but my friendship and collaboration with the great cinematographer Dick Pope was a marriage made in heaven, and his loss is indescribably painful. Over the two decades before we met and first worked together, on Life Is Sweet in 1990, while I was making TV films and stage plays, Dick was shooting World in Action and many other documentaries in far-flung dangerous places. He also made several feature films and a lot of music videos, including Kylie Minogue’s Wouldn’t Change a Thing and I Want to Break Free by Queen. Some film directors happily change cinematographers from film to film, and many simply specify their basic requirements and leave the cameraperson to get on with it. But for me, the continuity of Dick’s and my joint artistic journey became essential. After Life Is Sweet, Dick shot everything I directed, including shorts and commercials (19 works in all), and we approached every project as part of our ongoing serious investigation into pushing the boundaries of cinematic heightened realism. Photographically and aesthetically, his work was unfailingly exciting, from his wizardry in creating the monochromatic nocturnal bleakness of Naked to the bold primary colours of the optimistic Happy-Go-Lucky, to his inspired use of Super-16 film to create the postwar world of Vera Drake, and his combination of 16mm film shot handheld with 35mm shot formally to differentiate between the past and present in Career Girls, to his beautiful rendering of the four seasons in Another Year, the sumptuous Victorian theatre imagery of Topsy-Turvy, his sensitive references in Mr Turner to the artist’s paintings, and his bold rendering of the turbulent world of Peterloo. All of which involved our discussions and Dick’s resourceful shooting of film tests; but then there was the actual shooting experience itself. No storyboards for us – that alien convention of deciding all the shots in advance, before ever seeing the action! After I’d created the action on the location, Dick and I would watch it together, and refine and define it, shot by shot, through the camera. Always on the same wavelength, we made our shooting decisions in total harmony. We shared a hatred of pretentious, unmotivated, gratuitous camerawork, always believing that the camera should serve the action, but also that the actors should serve the camera. Actors loved working with Dick; he had enormous respect for and an instinctive understanding of the integrity of their work, for their specific needs. This resulted in relaxed and confident performances, always enhanced by Dick’s subtle ability to give each actor space and depth in the way he photographed her or him. Similarly, he earned respect from his camera and lighting crews; his gentle but firm commanding skills meant that his teams were always a delight to work and spend time with. Most importantly, Dick always operated the camera himself, as well as lighting the film (many cinematographers don’t). Only ill-health prevented his doing so on our recent film Hard Truths, when the operator was our longtime collaborator Lucy Bristow, with Dick adjacent, overseeing proceedings on a monitor. The film has not yet been released, but it has been screened at several festivals, and the response has been overwhelmingly positive, with many voices praising Dick’s work in particular. Gratifyingly, although he was by this time very ill, his wife, Pat, tells us that he died in the knowledge of our early success. The final “look” of a movie is very much in the hands of the cinematographer, and Dick’s skills at this stage of post-production were those of a consummate artist. To sit with him in a grading session was always a revelation and a joy, and his final results were a privilege to share. I will miss Dick Pope for his passion for life, his impeccable good taste, his healthy anarchic outlook, his dry sense of humour, and for our shared passion for all things gastronomic, especially Chinese restaurants and oysters. • Hard Truths is out in the UK on 31 January 2025. A remastered version of Naked will screen on Film4 on 12 November.",
        "web_url": "https://www.theguardian.com/film/2024/oct/31/a-revelation-and-a-joy-mike-leigh-pays-tribute-to-cinematographer-dick-pope",
        "pub_date": "2024-10-31T15:00:21Z",
        "section_name": "Film",
        "tags": [
            "Film",
            "Mike Leigh",
            "Culture",
            "Happy-Go-Lucky",
            "Peterloo",
            "Vera Drake",
            "Another Year",
            "Mr Turner"
        ]
    }
]