[
    {
        "headline": "Ed Sheeran: Azizam review – a cross-cultural Persian experiment … which sounds incredibly English",
        "trailText": "After a couple of earthy, rootsy albums, Sheeran emphatically returns to pop with another of his indelible hooks, surrounded by Middle Eastern instrumentation",
        "bodyText": "Ed Sheeran’s new single arrives at an interesting point in his career. His last albums, 2023’s Subtract and Autumn Variations, felt not unlike a riff on Taylor Swift’s pandemic-era Folklore and Evermore: two albums released in the same year, produced by the National’s Aaron Dessner, a little woodier and more understated in tone than usual. Subtract in particular enjoyed the kind of critical acclaim that Sheeran’s work seldom attracts. They were also the first Sheeran albums not to yield a billion-streaming track: his commercial zenith, 2017’s Divide, contained five, among them Shape of You, one of only two songs in history have to topped 4bn streams on Spotify. Maybe a muted commercial response was part of the plan (or rather, a relatively muted commercial response by Sheeran’s standards: Subtract still went to No 1 in 13 countries). Having spent a decade voraciously pursuing vast success – and shifting 200m albums in the process – perhaps Sheeran had decided the moment was right to deliberately pull back, to do precisely what he wanted regardless of the sales figures. At first glance, Azizam seems like another supporting claim for that theory. It’s billed as a “cross-cultural collaboration”, an experiment in Persian music inspired by the Iranian heritage of Stockholm-based producer Ilya Salmanzadeh (co-author of hits including Sam Smith’s Unholy, Ellie Goulding’s Love Me Like You Do and Ariana Grande’s Break Up With Your Girlfriend, I’m Bored). The title is Farsi for “my dear one”, and its cast list involves an array of musicians playing Middle Eastern instruments such at the daf and santur, as well as the Citizens of the World Choir, which is made up of refugees and their allies. But once you hear the end result, it has pretty much the same relation to Persian music as Galway Girl did to sean-nós singing. There’s a noticeable lope to the rhythm that could well have its roots in Tehran, but could just as easily be an echo of the deathless glitterbeat that sprang out of early 70s glam. There’s a Middle Eastern cast to a counter-melody that appears during the chorus, but the rest is positively Anglo-Saxon: percussive acoustic guitar to the fore, a big chorus and a hearty vocal with lyrics about dancing with his wife. Azizam does its job with the kind of ruthless efficiency you might expect from Sheeran in unabashed pop mode. It has a hook that fully digs into your brain the first time you hear it, and proves impossible to dislodge thereafter: whether you consider that delightful or insufferable will depend entirely on your previously established opinion of Sheeran and his work. Whether it will restore him to the realm of billion-streamers is also open to question. Pop is widely held to have entered a new era, more brash and risky and characterful than the one that bore Sheeran to success in the first place, heralded by the rise of Chappell Roan and the success of Charli xcx’s Brat. But less widely reported is the fact that, new era or not, Sheeran still casts a long shadow over pop: Noah Kahan, Benson Boone and man currently at UK No 1, Alex Warren, have a considerable chunk of Sheeran in their musical DNA; Myles Smith, winner of the Rising Star award at this year’s Brits, seems to have modelled himself so closely that he’s even adopted Sheeran’s trademark short-scale acoustic guitar. You wouldn’t bank against Azizam muscling its way back to the top table. • This article was amended on 4 April 2025. An earlier version made reference to the ghatam, a south Indian instrument, but described it as Middle Eastern.",
        "web_url": "https://www.theguardian.com/music/2025/apr/04/ed-sheeran-azizam-review-a-cross-cultural-persian-experiment-which-sounds-incredibly-english",
        "pub_date": "2025-04-04T06:19:04Z",
        "section_name": "Music",
        "tags": [
            "Ed Sheeran",
            "Music",
            "Culture",
            "Pop and rock"
        ]
    },
    {
        "headline": "Ed Sheeran shares Persian culture with the world and the diaspora swoons – me included | Dellaram Vreeland",
        "trailText": "The star’s new single, Azizam, is a rare pop-cultural moment in which Iran is celebrated for the beauty of its culture",
        "bodyText": "As a second-generation Persian immigrant, my connection with my roots has always been relatively surface-level. Admiring the intricate artworks adorning the walls of our homes, hand-loomed rugs crafted by my own grandmother, barberry-laden rice and saffron-infused stews, the music of Googoosh, Bijan Mortazavi and Susan Roshan blasting from dawn to dusk. My parents spoke Farsi to one another and to me when I was a child and as such it was my mother tongue. But I was born in Australia, so it was only going to be a matter of time before I became more proficient in English. Now I stumble my way through conversations in broken Farsi, longing for the day when Iran will be safe enough to finally visit and I can hopefully scrub up my language skills. My parents have never returned to Iran. Not since they left at the beginning of the Islamic Revolution in 1979 due to their belief in the Bahá’í faith – a religion promoting the unity of mankind whose adherents have been persecuted in Iran since its inception in the mid 19th century. The closest my mother has ever been to her homeland was last year, when we stopped over in Qatar on our way to France. Iran has had a bad rap over the years; many in the west associate it with terrorism, religious extremism and crimes against humanity. And for good reason. It’s constantly under scrutiny for its oppression of women and other minority groups, and its identity is framed by the media’s negative portrayal of the country, its people and regime. And then, a white man sings. Ed Sheeran has released a new single titled Azizam, which translates to “my dear” or “my love” in Farsi – and the diaspora is going wild. The song was written and produced alongside Iranian-born Swedish songwriter Ilya Salmanzadeh. While the melody is all western pop, the Middle Eastern influences are clear, with instruments including the daf and santoor making a welcome appearance. Sign up for the fun stuff with our rundown of must-reads, pop culture and tips for the weekend, every Saturday morning My own children, who are Persian-Canadian and born in Australia, have always grappled with their cultural identity. When they heard Sheeran’s new song, they were euphoric. Here was a piece of music that was crossing cultural boundaries, allowing them to piece together who they were – albeit superficially. A white person, like them, singing in Farsi, also like them! Recently, Persian comedian Maz Jobrani posted a short explainer on his Instagram about why Persians are so excited about the new song, saying: “Ever since we came to the west, we’ve been getting negative press. From the hostage crisis, to the movie Not Without My Daughter … so anytime anyone in the west does anything remotely good about us, we get excited!” For so long, Iran has been regarded as just a country in peril. With Sheeran’s new song, the western world can now catch a glimpse of the beauty, excitement and life that has been harboured within the country – if only it had the freedom to share it more liberally. For my entire life, my parents made sure I knew that Iran was a country with potential. Over thousands of years, since ancient Persian civilisation, our culture has influenced fashion, architecture and language. The contributions it has made to art, music, faith and science are some of the most profound the world has ever known. We want the beauty of our culture to define us. The fact that Iran continues to commit the most cruel and intense human rights crimes is a cause for lament both in the country and beyond. Azizam was inspired by Sheeran’s wife, but it’s much more than a love song. It’s a showcase of the beauty inherent in Iran, and a reconceptualisation of its identity. To those who emigrated or fled, it is an ode to their own homeland; it evokes a yearning to reunite with their beloved. To those in the broader diaspora, it’s a connection with their heritage. When Sheeran releases the entire song in Farsi, I can just imagine the weddings, celebrations and mehmoonis (Persian gatherings) blasting the song from dawn to dusk; the chant becoming a rally cry reminiscent of the glory days – albeit in broken Farsi.",
        "web_url": "https://www.theguardian.com/music/2025/apr/19/ed-sheeran-shares-persian-culture-with-the-world-and-the-diaspora-swoons-me-included",
        "pub_date": "2025-04-18T15:00:13Z",
        "section_name": "Music",
        "tags": [
            "Ed Sheeran",
            "Culture",
            "Iran",
            "Music",
            "Pop and rock",
            "Middle East and north Africa"
        ]
    },
    {
        "headline": "Police in India stop Ed Sheeran busking on street before concert",
        "trailText": "Local channels show police officer walking up to star as he sings Shape of You and unplugging microphone",
        "bodyText": "Ed Sheeran has been stopped by police from busking in India after he was told he lacked permissions. The songwriter was seen singing the hit single Shape of You on a pavement in the southern city of Bengaluru before his concert on Sunday night. But a viral video clip shows a police officer walking up to Sheeran while he is singing with the crowd and unplugging the microphone, as onlookers jeer. A dismayed Sheeran puts down his guitar and walks off. Police said event organisers had been refused permission for the performance, which was in one of the busiest areas of a city of 12 million people that is notorious for its heavy traffic. A Bengaluru police official, Shekar T Tekkannanavar, told the news agency ANI: “I refused to give permission because Church Street gets very crowded. That is the reason he was asked to vacate the place.” But Sheeran, who is known for performing in unexpected places, insisted later on his Instagram account that he did have permission to perform Shape of You, which was the first song to reach 3bn streams on Spotify. He wrote: “We had permission to busk, by the way. Hence, us playing in that exact spot was planned out beforehand. It wasn’t just us randomly turning up. All good, though.” Fans shared their disappointment at the police decision on social media. PC Mohan, a local MP from the ruling BJP party, posted on X that the impromptu gig had taken on a “sour note” when police arrived, adding that “even global stars must follow local rules – no permit, no performance”. The artist is in India for a 15-day leg of his tour, The Mathematics, and performed in front of thousands of people at an open ground in Bengaluru later that night, accompanied by the Indian singer Shilpa Rao. He surprised fans by singing two hit songs in the Telugu language with Rao on stage. He performed two nights in Bengaluru on 8 and 9 February after an extra show was added due to huge demand.",
        "web_url": "https://www.theguardian.com/music/2025/feb/10/police-in-india-stop-ed-sheerans-impromptu-street-concert",
        "pub_date": "2025-02-10T13:03:00Z",
        "section_name": "Music",
        "tags": [
            "Ed Sheeran",
            "India",
            "Music",
            "South and central Asia",
            "World news",
            "Culture",
            "UK news"
        ]
    },
    {
        "headline": "Ed Sheeran: I wish I wasn’t on 40th-anniversary version of Band Aid",
        "trailText": "Singer says his ‘understanding of the narrative’ around Do They Know It’s Christmas? has changed since 2014 appearance",
        "bodyText": "Ed Sheeran has said he would rather not be on the forthcoming 40th-anniversary version of Band Aid charity single Do They Know It’s Christmas?, aligning himself with criticism of it as dehumanising and damaging to Africans. Sheeran is one of an all-star cast to be drawn from three previous recordings of the song, in 1984, 2004 and 2014 – he appeared on the latter version. Producer Trevor Horn has mashed up three sets of performances into a new “Ultimate Mix”, which will be released on 25 November, and also features George Michael, Robbie Williams, Sinéad O’Connor and many more. Writing on Instagram, Sheeran said: “My approval wasn’t sought on this new Band Aid 40 release and had I had the choice I would have respectfully declined the use of my vocals. A decade on and my understanding of the narrative associated with this has changed.” Sheeran shared a post by British-Ghanaian vocalist Fuse ODG, saying it “eloquently explained” his feelings about the song. Fuse ODG wrote of charity initiatives such as Band Aid: “While they may generate sympathy and donations, they perpetuate damaging stereotypes that stifle Africa’s economic growth, tourism and investment, ultimately costing the continent trillions and destroying its dignity, pride and identity. By showcasing dehumanising imagery, these initiatives fuel pity rather than partnership, discouraging meaningful engagement.” Fuse ODG said he wanted to “reclaim the narrative … today, the diaspora drives the largest flow of funds back into the continent, not Band Aid or foreign aid, proving that Africa’s solutions and progress lie in its own hands”. Band Aid has raised over £150m since being founded in 1984, including via the song – which topped the charts on each of its three releases – and the US-UK benefit concerts Live Aid. It originally targeted famine relief in Ethiopia and has since expanded to charitable efforts across Africa. But the song has been criticised for a paternalistic and generalising attitude towards Africans, and had its lyrics changed in 2014, including Bono’s climatic line “Well tonight thank God it’s them, instead of you” which was changed to “Well tonight we’re reaching out and touching you”. Fuse ODG was invited to appear on that version, but declined, writing in the Guardian at the time: “I, like many others, am sick of the whole concept of Africa – a resource-rich continent with unbridled potential – always being seen as diseased, infested and poverty-stricken.” Sheeran is gearing up to release his own Christmas song, Under the Tree, taken from the soundtrack to new Netflix film That Christmas, co-written by Richard Curtis and adapted from his children’s books. It stars Brian Cox as Santa Claus, with Jodie Whittaker, Fiona Shaw and Bill Nighy among the supporting cast.",
        "web_url": "https://www.theguardian.com/music/2024/nov/18/ed-sheeran-i-wish-i-wasnt-on-40th-anniversary-version-of-band-aid-do-they-know-its-christmas",
        "pub_date": "2024-11-18T16:33:56Z",
        "section_name": "Music",
        "tags": [
            "Band Aid",
            "Ed Sheeran",
            "Pop and rock",
            "Culture",
            "Music",
            "Charities",
            "UK news",
            "Africa"
        ]
    },
    {
        "headline": "Elton John backs Ed Sheeran’s call for UK to put £250m into music education",
        "trailText": "Coldplay, Harry Styles and Stormzy also join Suffolk songwriter in campaigning for music funding in schools",
        "bodyText": "Elton John, Coldplay, Harry Styles, Stormzy and Central Cee are among the artists backing a call from Ed Sheeran for Keir Starmer to commit £250m of funding for music education. As part of his newly launched Ed Sheeran Foundation, the Suffolk songwriter is campaigning for music funding in schools, training for music teachers, funding for grassroots venues and spaces, apprenticeships in music and a more diverse music curriculum. Sheeran wrote: “As an industry, we bring in £7.6bn into the UK economy, yet the next generation is not there to take the reins. Last year was the first in over 20 years without a UK global top 10 single or album in the charts.” Sheeran has called upon the government to provide a cross-departmental taskforce to work together on these issues to ensure music education remains high on the agenda. The letter continued: “The time to act is now. State schools – which educate 93% of the country’s children – have seen a 21% decrease in music provision … we also need you standing up for music education. Artists and industry can’t deliver on the world stage for the UK without schools, youth clubs and stages at home. “We collectively ask for a £250m UK music education package this spring to repair decades of dismantling music … Music in and out of school should be for all, not a few.” A 2025 report by Music Mark, the UK association for music education, found that the Labour government had inherited a £161.4m shortfall in its budget to ensure the future of music education over the next five years. Before winning the 2024 election, Starmer – a former child flautist who has spoken of the joys of travelling with his youth orchestra – told Classic FM that he “passionately” wanted to reverse the “degrading of creative arts and music” in state schools. Annie Lennox, Dave, Paloma Faith, YolanDa Brown and Sleaford Mods are also among the 500 signatories from the music industry. The Brit awards Rising Star winner Myles Smith has also signed; at the awards ceremony last month, he called on the government, venue conglomerates and music executives to support emerging artists. “How many more venues need to close, how many music programmes need to be cut before we realise that we can’t just celebrate success, we have to protect the foundations that make it?” he asked. Arts advocates are hoping Labour’s long-awaited curriculum review, led by Prof Becky Francis, will lead to a boost for the arts and greater educational inclusion, closing the access gap between state and private schools, and those in wealthy and less well-off areas. In 2022, the Conservative government published the second iteration of its national plan for music education, emphasising the “power of music to change lives”. It proposed that all children and young people should be able to learn to sing, play an instrument and create music together, and have the opportunity to progress their musical interests, including at a professional level. But music studies in schools are at a historic low. In August, the Independent Society of Musicians reported a 43% drop in A-level applicants and almost 40% in GCSE applicants since 2010, when then-education secretary, Michael Gove, introduced the Ebacc qualification, which does not include music or art. Last year, the Cultural Learning Alliance found that 42% of state schools enter no pupils for GCSE music. Femi Koleoso, a drummer with Ezra Collective, also advocated for support for music education when the London jazz band won group of the year at the Brit awards. The ensemble formed in 2016 after meeting through the Tomorrow’s Warriors youth jazz programme. Their victory, Koleoso said, was “because of the great youth clubs and the great teachers and the great schools’ that supported young people playing music. “The reason we continue to bang this drum is because so many of the problems that face greater society in the UK, where we’re unsure of how to fix it … the solution lies with giving a young person a trumpet, the solution lies with giving a young person a saxophone, because when you do that you give them a dream and aspiration and a goal,” he added. Sheeran previously called for public funding for music in schools in 2023. He signed a letter from Andrew Lloyd Webber to Starmer and Rishi Sunak, calling for funding to scale up the work of Lloyd Webber’s music education charity, the Music in Secondary Schools Trust, which provides free musical instruments and weekly music lessons in disadvantaged schools. A government spokesperson said: “High and rising standards are at the heart of this government’s mission to break down barriers to opportunity and we are committed to ensuring art, music and drama are no longer the preserve of a privileged few. “To help achieve this our curriculum and assessment review will seek to deliver a broader curriculum, and our new national centre for music and arts education will promote opportunities for children and young people to pursue their artistic and creative interests in school. “We are also expanding the creative careers programme to £3m over the next financial year, to help provide even more schoolchildren with information, advice and guidance on creative career routes.”",
        "web_url": "https://www.theguardian.com/music/2025/mar/23/elton-john-backs-ed-sheerans-call-for-uk-to-put-250m-into-music-education",
        "pub_date": "2025-03-23T11:24:25Z",
        "section_name": "Music",
        "tags": [
            "Ed Sheeran",
            "Elton John",
            "Music",
            "Education",
            "Schools",
            "Coldplay",
            "Harry Styles",
            "Central Cee",
            "Culture"
        ]
    },
    {
        "headline": "Ed Sheeran should know Band Aid did a lot of good, but development is better | Letter",
        "trailText": "<strong>Letter: </strong>The pop star has spoken out against his inclusion on the latest single – reflecting a common point of confusion about aid, writes <strong>Benny Dembitzer</strong>",
        "bodyText": "The comments made by Ed Sheeran (Ed Sheeran: I wish I wasn’t on 40th-anniversary version of Band Aid, 18 November), reflect the continuing confusion between “aid” and “development”. Band Aid was a terrific way to raise funds and public engagement to relieve the appalling starvation that affected Ethiopia (where I was most marginally involved) and other parts of Africa in 1985, after almost six years of drought and a vicious military government. “Development” is a much longer-term programme of prevention and nurturing the capacity of local people to look after themselves. The “aid” agencies, by constantly emphasising the need to relieve starvation, are benefiting from donations, but removing agency from local people. The global economic framework is preventing poor countries from using their own tools to develop. It therefore makes international NGOs and the World Food Programme the arbiters of who lives and who dies. Hunger is, as usual, a weapon of war. I try to explain the politics of aid in Toxic Aid, described on our website. Benny Dembitzer Grassroots Malawi • Have an opinion on anything you’ve read in the Guardian today? Please email us your letter and it will be considered for publication in our letters section.",
        "web_url": "https://www.theguardian.com/global-development/2024/nov/22/ed-sheeran-should-know-band-aid-did-a-lot-of-good-but-development-is-better",
        "pub_date": "2024-11-22T17:40:50Z",
        "section_name": "Global development",
        "tags": [
            "Global development",
            "Ed Sheeran",
            "Live Aid",
            "Malawi",
            "Aid",
            "Ethiopia",
            "World news",
            "Africa",
            "Music"
        ]
    },
    {
        "headline": "Critics may sniff at Ed Sheeran’s Persian fusion hit Azizam – but we Iranians love it",
        "trailText": "With its Iranian melodies, instrumentation and backing singers, Sheeran’s joyful new single is a reminder of how culture transcends borders",
        "bodyText": "The Farsi word “azizam” – meaning my dear or my darling in English – may not have the same level of global resonance as habibi or ma chérie, but to us Persians it’s a daily refrain. We use it with our family, partners, friends; my cat probably thinks it’s her middle name by now. So it felt huge when Ed Sheeran announced that the lead single from his new album would be called just that: Azizam. The track, inspired by the Iranian heritage of Stockholm-based producer Ilya Salmanzadeh, has divided critics, with a Telegraph review calling it “a slice of pure pop froth that couldn’t be any more generic and upbeat if it was written by an AI programme”. But these reproaches are missing a whole other dimension: that the song has triggered a huge emotional response from millions of Iranians around the world. “Hearing a beloved artist embrace our language with such care? We feel it. And we’re here for it,” said one popular comment on Sheeran’s Instagram. For so long, Iranians have become used to being ostracised or misrepresented in western popular culture. Take the movie 300, a fictional retelling of the Greco-Persian wars, in which the Persians were essentially depicted as barbarians; or Ben Affleck’s Argo, about the Iran hostage crisis, which stereotyped Iranians as fanatical and ignorant. “If you’re an Iranian and you live in the diaspora, you understand what it’s like to be misunderstood, especially if you grew up in the post 9/11 era,” a TikTok user said. “Non-Iranians or people who aren’t from the Middle East don’t understand how beautiful our culture is, our language, our history and our struggle, what we’ve been through.” So having one of the world’s best-selling artists celebrate that beauty has got to mean something. “Now you’re going to have a lot of non-Iranians be like … ‘what a beautiful word’.” Persians are incredibly proud of our culture and history. Iranians will be quick to tell you that Persia is the world’s oldest continuous civilisation, that poets like Rumi and Hafez and Ferdowsi influenced literary traditions for centuries. Many still love to claim Freddie Mercury – or “Farrokh joon” (dear Farrokh) – as one of our own (his parents were Parsi, an ethnic group descended from Persian Zoroastrians who emigrated to India in the eighth century). And Ed Sheeran will heretofore surely be known as Ed Shirini (“sweets” in Farsi), or as the comedian Shaparak Khorsandi joked in the manner of a typical Persian mum, Sheeran derives from Eee-ran anyway. Yes, I tell my friends, Brian Cox is a fantastic actor, but more importantly did you know he and his Persian wife’s cat is called Pishi (Persian for kitty)? Yes, Animal was a massive Bollywood hit, but did you know the song that enthralled Indian audiences from the film is a 50s Iranian tune? Critics have called Azizam inauthentic and derivative, but I disagree – it has a real Iranian flavour. This includes its hook, the use of instruments like the daf and santur, and backing vocals from huge Iranian pop stars Arash and Andy, the latter of whom delighted fans by playing it at a recent concert and saying he felt “deeply connected” to the song. There’s also a full Farsi version coming, featuring a singer “who’s as big as it gets in the Persian community” according to Sheeran. Then there’s the fact that it was released during Nowruz, the Persian new year marking the spring equinox, which is a time of celebration and coming together to eat (including a lot of shirini of course), give gifts and dance. This song will have been played in Iranian households around the world. The video alone amassed more than 8m views in two days, Tik Tok is full of Iranians “gher”-ing to it – that irresistible feeling that makes you want to shake your hips on the dancefloor – and the song will undoubtedly be played at Iranian weddings for years to come. But there is a deeper message: however fraught international relations become, culture can still bring us together. Sheeran has played to this before, collaborating with west African pop stars such as Burna Boy and Fireboy DML, and he learned Spanish for a record with Colombian singer J Balvin. Cynics have suggested this is canny, even craven: a way of courting a series of global audiences to expand Sheeran’s brand. More generally, exploitative sampling or insensitive imitation of global-majority artists has of course resulted in plenty of cultural appropriation over the years. But there’s evident joy in the way Sheeran sings over these fusions, and splicings of MENA music and British pop are often creative as well as commercial successes, as proved by the Chemical Brothers’ Galvanize, Blur’s Out of Time, or Coldplay’s recent We Pray, featuring Palestinian-Chilean singer Elyanna. Sheeran said the similarity of the Middle Eastern instruments on Azizam to the Irish traditional music he grew up with brought home how much “music connects us all and really is a universal language”. There’s no better representation of that than online videos of an American crowd in a pub in Ipswich, Massachusetts last week, blaring out “azizam” in unison. Jimmy Fallon even sang it on the Tonight Show. So for that, and all the above, I’ll simply say: Ed, you are our azizam.",
        "web_url": "https://www.theguardian.com/music/2025/apr/07/critics-may-sniff-at-ed-sheerans-persian-fusion-hit-azizam-but-we-iranians-love-it",
        "pub_date": "2025-04-07T13:23:21Z",
        "section_name": "Music",
        "tags": [
            "Ed Sheeran",
            "Iran",
            "Music",
            "Pop and rock",
            "Culture",
            "Middle East and north Africa"
        ]
    },
    {
        "headline": "Ed Sheeran, Fuse ODG: do they know they’re dead right about Band Aid? Africa needs more than a singalong ",
        "trailText": "No wonder pop stars and others feel uneasy about the project. However well-intentioned, it now does more harm than good, says author and broadcaster Nels Abbey",
        "bodyText": "Hey y’all: listen up to the chartbusting, pop-pickin’, time-addled DJ: “Yes indeed, Band Aid’s Do They Know It’s Christmas is back with a bang, a twist and a mix! This time our ultimate white saviour anthem is ready for for a generation weaned on AI remixes: a menage a trois of the original 1984 version mixed in with the 2004 and 2014 versions. Britain is about to feel good and “Africa” is finally about to get fed! WICK-ED! Joining us to discuss this is my mate, a fountain of all that is good in the world, the great Sir Bob Geldof …” We don’t know exactly what the forthcoming, 40th-anniversary version of Do They Know It’s Christmas?, featuring a mashup of previous versions into a new “ultimate mix”, will sound like. But I do fear the worst. So does Ed Sheeran, who is currently the 10th most-listened-to artist on Spotify and one of the stars of the 2014 version of Band Aid. Following the lead of British-Ghanaian Afrobeats star Fuse ODG, Sheeran has taken a principled stand against his unauthorised inclusion in the re-release. “My approval wasn’t sought on this new Band Aid 40 release, and had I had the choice I would have respectfully declined the use of my vocals. A decade on and my understanding of the narrative associated with this has changed.” Very well said. In a video released online, Fuse ODG painstakingly detailed the effect of Band Aid: “While they may generate sympathy and donations, they perpetuate damaging stereotypes that stifle Africa’s economic growth, tourism and investment, ultimately costing the continent trillions and destroying its dignity, pride and identity. By showcasing dehumanising imagery, these initiatives fuel pity rather than partnership, discouraging meaningful engagement.” In a just world, Fuse ODG would be showered with honours for his work on uplifting the image of Africa and helping to bring African music into popular culture. In the process, he helped to do the opposite of absolutely everything that he suggested Band Aid does. As I type these words, I am sitting by a pool in a hotel in Lagos – by dint of population, the Blackest place on Earth. To my left is a group of American business people and to my right a group of young British and Nigerian tourists. A table full of Chinese and Nigerian business people is not far from us. Though chronic poverty remains a serious issue, the signs of hard development and investment are stark. This is no easy achievement. My previous career in financial services left me with a vivid and vicious understanding of how difficult it was to raise investment for African ventures – no matter how polished your PowerPoint deck was, no matter how great or persuasive a presenter you were, how enticing the potential profits looked. It is unbelievably hard to compete with shocking imagery, children with flies on their faces, charity videos broadcast on TV every 15 minutes. Those adverts became the dominant perspective of the motherland. The power of Band Aid’s celebrity helped ensure that generations of Brits inherited this perspective of a hopeless Africa. Thankfully, initiatives such as Pledge for Change are helping to right that wrong. But Band Aid had an even darker impact. However well-intentioned, it turned out to be a western soft power coup and an assault on Africa. It arrived on the centenary of the 1884 Berlin Conference, at which European imperial powers grappled for control of Africa. So in 1984, at the very moment Britain and other western states should have been reflecting on the impact of that scramble and the subsequent explosion of colonisation, the British entertainment establishment released a charity single “for Africa”. This completely overshadowed any discussion of Britain’s and other western nations’ complicity in the very plight they were supposedly trying to help relieve. This became something of a tradition: the 2004 version of Band Aid eclipsed the 120th anniversary of the Berlin Conference, the 2014 version did the same for the 130th. Guess what? We’re now at the 140th anniversary of the Berlin Conference and – SURPRISE – we’re speaking about Band Aid and not the colonialism that created an opening for it to exist. The BBC plans to “mark” the 40th anniversary of Band Aid with a documentary “complete with footage that has never been broadcast”. And yet it was pretty mute on the 140th anniversary of the Berlin Conference (as it was the other landmark anniversaries of the conference – which helps explain why so many have never heard of it). Instead of a serious conversation about reparations or a Marshall plan for Africa, we get super dehumanising adverts seeking 50p a month and a well-timed national singalong that we trot out at the exact moment we should be speaking about economic justice and repair. Fuse ODG, Ed Sheeran, and other critics: they’re on to something. If people want to take a view of how to make this a fairer world, I applaud that. But we need long-term solutions. Do They Know It’s Christmas, however well meant, is just a charity singalong. These days, that doesn’t cut it. Nels Abbey is an author, broadcaster and the founder of Uppity: the Intellectual Playground Do you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our letters section, please click here.",
        "web_url": "https://www.theguardian.com/commentisfree/2024/nov/19/ed-sheeran-fuse-odg-band-aid-africa-pop-stars",
        "pub_date": "2024-11-19T16:15:20Z",
        "section_name": "Opinion",
        "tags": [
            "Band Aid",
            "Africa",
            "Ed Sheeran",
            "Music",
            "UK news",
            "Culture",
            "World news"
        ]
    },
    {
        "headline": "Coachella 2025: desert festival balances the new and the nostalgia",
        "trailText": "California music festival to see record highs and headlining sets from Lady Gaga, Post Malone and Green Day",
        "bodyText": "Stars such as Lady Gaga, Charli xcx, Ed Sheeran and Missy Elliott will face blazing temperatures this weekend at an unusually hot Coachella festival. The California-based festival will soar to potentially record-breaking highs of 103F (over 39C) in its first of two consecutive weekends, about 10-20 degrees Fahrenheit higher than what’s typically expected at this time of year. The festival, which usually attracts around 125,000 people a day, is following a year that saw its slowest sales to date, headlined by Doja Cat, Lana del Rey and Tyler, the Creator. The 2025 edition is being viewed by some as an unofficial comeback with headliners Lady Gaga, Green Day and Post Malone, who together boast 24% higher global Spotify streams than the previous trio. Gaga previously headlined Coachella in 2017, when she also filmed scenes for A Star Is Born. In a recent interview, she said she would focus on her new album, Mayhem, but also give fans the older hits they want. She said she saw it as “an opportunity to do something unique and special” but remained tightlipped about specifics. “I genuinely don’t want to give anything away about Coachella,” she said. “I know that is heartless of me, in a way, but I could honestly cry on the phone with you just thinking about how excited I am to do this show, and I want it to be a total surprise, and want everyone to have as much fun as possible.” The lineup boasts a wide variety of acts from different genres and eras. The newer guard is represented by Lola Young, Shaboozey, Amyl and the Sniffers, Rema, underscores and Glorilla, while nostalgia plays are led by Jimmy Eat World, Missy Elliott, Kraftwerk, Basement Jaxx and the Go-Gos. The weekend will also see the Prodigy play, returning to Coachella for the first time since Keith Flint died in 2019. “I will say that us carrying on isn’t a Keith tribute show,” band member Liam Howlett recently told the Los Angeles Times. “We want to honor him, and we will continue to do that, because Keith is more than just a person they saw on stage. Even though he wasn’t a musician, he was such an important person in the studio as a right-hand man.” Another throwback act playing is Weezer, a band who have been making headlines this week after bassist Scott Shriner’s wife, Jillian Lauren, was shot by police. Reports claim that she aimed a handgun at officers as they investigated an unrelated hit-and-run incident and she is now being charged with attempted murder. The band is still set to perform as scheduled with Scott saying “see you at Coachella” to journalists on Thursday. One act who won’t be performing is FKA twigs, who was forced to pull out “due to ongoing visa issues” related to her production team reportedly failing to fill out the correct paperwork in time. The star wrote that she was “devastated” in an Instagram statement. Rising costs and more complicated logistics have also caused trouble for other artists seeking visas to perform. “I just did visas for a Coachella band and it was $8,000,” a booking agency executive told the Los Angeles Times. “It’s becoming a huge financial hurdle because it takes so long through regular channels, you have to go for the heavy-duty expediting.”",
        "web_url": "https://www.theguardian.com/music/2025/apr/11/coachella-lineup-headliners-temperature",
        "pub_date": "2025-04-11T13:34:24Z",
        "section_name": "Music",
        "tags": [
            "Coachella",
            "Lady Gaga",
            "Charli xcx",
            "Green Day",
            "Ed Sheeran",
            "The Prodigy",
            "Weezer",
            "Missy Elliott",
            "Festivals",
            "Music",
            "Culture",
            "US news"
        ]
    },
    {
        "headline": "Band Aid 40 fails to reach UK Top 40 in opening week",
        "trailText": "All-star version of Do They Know It’s Christmas?, spliced together from previous versions, falls short of the No 1 success of those earlier hits",
        "bodyText": "The 40th anniversary version of Band Aid’s Do They Know It’s Christmas? has failed to enter this week’s Top 40, reaching No 45. The new version of the song was made up of performances spliced together from three previous versions, in an arrangement by producer Trevor Horn. But despite featuring the unusual A-list juxtaposition of George Michael, Sinead O’Connor, Chris Martin, One Direction and more, the new version has not yet matched the success of its predecessors, which each went straight to No 1 in 1984, 2004 and 2014. The 40th anniversary Ultimate Mix has struggled even though streams and sales of the original 1984 version also count towards its chart performance. But as it was released on Monday rather than Friday, the new version did not benefit from a full week of chart sales data, and could yet continue up the charts as the Christmas season progresses. The single – which features new cover art by Sir Peter Blake – continues the charity work of Band Aid, which was founded to raise funds for those affected by famine in Ethiopia, and continues to support a range of humanitarian projects there and across Africa. The song’s new version also features the original 1984 news reporting by Michael Buerk on the famine, which helped to bring the country’s plight to wider attention in the UK, and inspired the original Band Aid song as well as the Live Aid concerts the following year. The 40th anniversary version has been criticised in some quarters, as have previous versions. Ed Sheeran, whose 2014 vocals appear on the new version, said ahead of its release: “Had I had the choice I would have respectfully declined the use of my vocals”. He cited criticism by British-Ghanaian musician Fuse ODG, who wrote in his own statement that charity initiatives such as Band Aid “perpetuate damaging stereotypes that stifle Africa’s economic growth, tourism and investment, ultimately costing the continent trillions and destroying its dignity, pride and identity”. Bob Geldof, who founded Band Aid and co-wrote Do They Know It’s Christmas? with Midge Ure, defended the song in light of Fuse ODG’s criticism. He told CNN that he, along with Kofi Annan and others, had previously travelled Africa “lobbying exactly for what Fuse is saying” regarding the ability for African countries to be self-sustaining: “You inject the oil of cash into an economy and people fly.” But, he added, for African people “to be able to get Africa going and on its feet, they must be alive, and over the course of 40 years, hundreds of thousands of people, probably millions, are alive because of a little pop song. That is a ridiculous way to run the world and it should stop, but while it doesn’t, we will continue … doing this little song.” Earlier this month, responding to an article that argued the song perpetuated “colonial tropes”, he wrote: “‘Colonial tropes’ my arse … There IS endemic hunger due to the unforgiving soil conditions. Water IS scarce save for a scattering of unreliable wells. Rain IS increasingly unreliable … These are not ‘colonial tropes’ they are empirical facts.” The new version of Do They Know It’s Christmas? was outperformed by a number of other Christmas classics, with Wham’s Last Christmas at No 8 and Mariah Carey’s All I Want For Christmas Is You at No 10 before December has even begun. Eight other Christmas songs are in the Top 40, with Brenda Lee’s Rockin’ Around the Christmas Tree at No 20, followed by Ariana Grande’s Santa Tell Me (27), Bobby Helms’ Jingle Bell Rock (30), Ed Sheeran and Elton John’s Merry Christmas (31), Kelly Clarkson’s Underneath the Tree (32), the Pogues’ Fairytale of New York (34), Andy Williams’ It’s the Most Wonderful Time of the Year (39) and Shakin’ Stevens’ Merry Christmas Everyone (40). In the album chart, Kendrick Lamar goes to No 1 with GNX in its first week of release, his second No 1 album following 2015’s To Pimp a Butterfly. Three of the album’s songs (the maximum allowed under chart rules) reached the Top 10 of the singles chart. At No 4, Squabble Up becomes Lamar’s highest-charting solo single, while Luther is at No 5 and TV Off reaches No 6.",
        "web_url": "https://www.theguardian.com/music/2024/nov/29/band-aid-40-fails-to-reach-uk-top-40-in-opening-week",
        "pub_date": "2024-11-29T18:00:03Z",
        "section_name": "Music",
        "tags": [
            "Band Aid",
            "UK charts",
            "Music",
            "Pop and rock",
            "Culture",
            "Bob Geldof",
            "Ed Sheeran",
            "Charities",
            "Christmas",
            "UK news"
        ]
    },
    {
        "headline": "‘Who am I voting for? America!’ Chris Stapleton on patriotism, politics and being country’s great crossover star",
        "trailText": "With southern-gothic storytelling and a soulfully diverse sound, the Kentucky singer revolutionised the double-denim country scene. But as the US election hots up, he’s staying out of the culture wars",
        "bodyText": "Chris Stapleton has played five arenas in the UK over the past week, on a tour dubbed the All-American Road Show. Posters depicted his grandly bearded, cowboy-hatted visage framed by hills and skies in colours of red, white and blue. At first listen, his country music seems just as all-American. The 46-year-old has been writing and singing about women, heartbreak and drinkin’ for more than 20 years – whiskey alone has prompted Tennessee Whiskey (originally recorded by David Allan Coe), Whiskey and You, Whiskey Sunrise and his version of Willie Nelson’s Whiskey River; Stapleton recently launched his own brand of the stuff, Traveller. He’s sung the national anthem at the Super Bowl, and duetted with Taylor Swift. When discussing the upcoming election in November, I can almost hear a bald eagle cry as he declares: “I’m voting for America and a good glass of whiskey.” But Stapleton, a true American superstar with 10 Grammys and 22 million monthly listeners on Spotify, is rather more complicated than your average truck-drivin’ country singer – and he’s all too aware of the stereotypes. His atmospheric 2020 song Hillbilly Blood is less a country number and more a string of southern-gothic vignettes, “born out of a riff that sounded pretty mean”, and inspired by his native Kentucky. “The people where I’m from, sometimes we’re looked down upon as not as educated or not as smart, or that we don’t have much money, or any of those things,” he says. On his biggest recent hit, White Horse, he sounds like a classically macho country-rocker – until you realise he’s running away from love, too afraid to be a heroic “cowboy on a white horse / ridin’ off into the sunset”. As well as the Swift duet, there’s another with Metallica. And while country peers such as Jason Aldean have recently been dealing in aggressive nationalism, Stapleton is writing songs like Watch You Burn, a furious anthem about the 2017 mass shooting at Route 91 Harvest festival in Las Vegas, where 60 people were killed. “It’s important that you write songs sometimes that are timely,” he says, over the phone. “That’s part of our duty as songwriters, to connect with people in those ways: anger and frustration.” He certainly has the quintessential country roots, though: while Loretta Lynn sang of being a coalminer’s daughter, Stapleton is a coalminer’s son, and his mother worked at the local health department. He grew up in Staffordsville, a small, “three stoplight” rural town, where “the Friday night football game was the big gathering of the week, then it was church on Sundays. That was kind of it.” His earliest musical memories are of playing guitar with his uncle, and of his dad playing outlaw country and old R&amp;B in the car. “When my mom wasn’t in the car it would be a little louder than it should have been for children, probably,” says Stapleton. “But he loved to listen to music, and a lot of my love for my music probably comes from that.” He went to Nashville to study biomedical engineering at Vanderbilt University, then switched to business school, but he “just didn’t have an interest in doing any of that – a very strong disinterest, in fact”. Having taught himself guitar to a decent standard, he realised he could have a career in music when he met a salaried songwriter at EMI around the turn of the millennium. “I had no idea that was a job,” he says. He assumed if someone was singing a song, they wrote it. “I didn’t know that there was an entire community of people who, behind the scenes, were kind of song-factories. I became enamoured with that very quickly, and said: ‘Well, this is the job that I need to have.’” Over the next decade or so, Stapleton earned a reputation as a prolific, versatile songwriter for country stars old (Tim McGraw, Kenny Chesney, George Strait), and new (Luke Bryan, Dierks Bentley, Blake Shelton). In 2015, he even had the great honour of seeing a song he’d co-written with Thomas Rhett, South Side, performed by animated rodents in Alvin and the Chipmunks: The Road Chip. Stapleton had become another of Nashville’s song factories – he reckons he’s written more than 1,000 of them – but he never felt “like a cog in a machine. That’s not very romantic or sexy, but it was romantic. To get to dig in with all the people that I had gotten to dig in with – the best of the best in the country music songwriter world – was a real privilege: ‘the art behind the art’ kinda thing.” In this environment, Stapleton never felt compelled to perform himself – “Why would I? – but he had a number of “perfectly good songs sitting around going to waste”. So he formed a bluegrass band to play them called the SteelDrivers, followed by southern rockers the Jompson Brothers, before going solo. “My wife thought I was crazy because it was an income hit to go on tour,” he says. “I probably gave up 40% of my income just because I wasn’t working as hard at songwriting.” The title track of Stapleton’s debut album, Traveller, was composed while he and his wife, the singer-songwriter Morgane Stapleton, drove through New Mexico in 2013 (they met while working in adjacent publishing houses, married in 2007 and now have five children). The road trip had been her idea: she spent $10,000 on a Jeep in Phoenix, Arizona, and the 1,600-mile drive back to Nashville would be a welcome distraction for Stapleton, whose father had just died. “The whole record in a lot of ways was dedicated to him,” says Stapleton. “I tried to make a record that I thought he would have liked to have heard be made. I miss my father a great deal – he never got to see what we’re doing now. Never got to even have a notion of that. And you know, I find that difficult.” Traveller initially made little headway on mainstream country radio. “It wasn’t singles-based,” Stapleton says. “We were just going to play shows on it, and that was unusual.” But then came the 2015 Country Music Association Awards. A 37-year-old Stapleton took to the stage with Morgane and Justin Timberlake for a performance of Stapleton’s Tennessee Whiskey and Timberlake’s Drink You Away. Stapleton’s soulful crooning and brooding stage presence were electric, and the audience were stunned. The day prior, he still had a number of gigs with half-sold tickets. “The next day, they were all gone,” he says. “We knew there was a different ballgame, for sure.” Traveller re-entered the Billboard album chart at No 1, and has now sold more than 6m copies in the US. Stapleton’s breakthrough came at a time when Nashville was dominated by bro-country; the upbeat, poppy sub-genre preoccupied with trucks, women, beer and partying, sung by young men in double denim. Labels and listeners longed for something fresh, and Stapleton’s music – a cocktail of rock, Americana, bluegrass, R&amp;B and soul, with a rare vulnerability in his lyrics and a raw expressiveness in his voice – was what everyone was looking for, as was his look: part biker, part throwback to the outlaw country stars of the 70s. He believes the essence of country music is “stories”, and the Grammy-winning You Should Probably Leave is one example of his own talent in that regard: as two former lovers try and fail to resist temptation, the song crackles with shame and erotic tension. Stapleton became that rare thing: a crossover country superstar. Ed Sheeran and Adele called on him as a collaborator. Bus-loads of tourists began arriving outside his house in Nashville twice a day (“that felt a little unnerving”), while one fan drove two states over “and just kind of showed up in my driveway. That’s a level of fandom I don’t quite understand. Sometimes, if you’re trying to eat lunch with your kids or something like that, maybe you don’t want to be ‘on’. But that just comes with the territory.” His mum is evidently more comfortable with his fame – prior to one awards ceremony, “I was talking to her on the phone, and she said: ‘Well, have fun getting your awards!’ Like it was a foregone conclusion. She has an overabundance of pride.” And did you win that night? “Probably!” he says, laughing. By 2023, a GQ headline was asking “Is Chris Stapleton the one thing America could agree on?”, and for all that he trades in occasionally angry and even subversive songwriting, he has cultivated universal admiration by being very even-handed. Of the pressure celebrities are under to endorse a presidential candidate, he says: “I’m not saying celebrities shouldn’t endorse people – that’s American. I also think the right to keep that private, and the right to let politicians be politicians, to let people make their own choices based on what politicians say and do … that’s American, too.” He pays no attention to culture wars or online discourse (“I don’t give a shit about any of that”), and amid country’s recent boom in the pop charts thanks to the likes of Beyoncé, Shaboozey, Dasha and more, he is welcoming to the newcomers: “The notion of drawing lines or saying you can’t participate because you’re not from somewhere, whatever, that doesn’t interest me”. He has respect for and is moved by soldiers, and “all kinds of public servants” who “defend and protect”. Asked whether country music has issues with intolerance or sexism – last year country chart-topper Maren Morris distanced herself from the scene because of its misogyny and participation in culture wars – he has a politician’s non-specific condemnation: “There’s intolerance and sexism everywhere … you’re kidding yourself if you think those things don’t exist.” To Stapleton, American values are about “fairness and defending those who can’t defend themselves, or standing up for each other”, he says. “About coming together, understanding points of view that aren’t yours. American values would be someone who grows up in the city getting to sit down and talk with somebody who didn’t, like myself. And then we can still find common ground.” The stakes are so high with next month’s election that some might find Stapleton as evasive as the protagonist in his song White Horse. But as those tour posters suggest, he’s about being red, white and blue, rather than red, white or blue. “I doubt that all Americans could agree on me,” he continues, referring to that GQ headline. “But I’ll take it. If that’s true, I think it’s wonderful, because I think we need more things we can agree on.” • Traveller Whiskey is available now",
        "web_url": "https://www.theguardian.com/music/2024/oct/25/chris-stapleton-patriotism-politics-crossover-star",
        "pub_date": "2024-10-25T04:00:10Z",
        "section_name": "Music",
        "tags": [
            "Chris Stapleton",
            "Country",
            "Music",
            "Pop and rock",
            "Culture",
            "Taylor Swift",
            "Justin Timberlake",
            "Adele",
            "Ed Sheeran"
        ]
    }
]