[
    {
        "headline": "Gracie Abrams review – telling references tied together in a big, bland bow",
        "trailText": "Her songs recall Taylor Swift and Phoebe Bridgers, so much so it’s hard not to wish you were listening to them instead. Not that that bothers her excitable young fans",
        "bodyText": "How do you describe a Gracie Abrams concert in one word? Bows. There are thousands and thousands of them at the O2 Arena tonight, most of them pale pink, and therefore starkly visible among the floor crowd even from seats high-up. Bows are Abrams fans’ Swiftian friendship bracelets – a clear identifier of standom that might cause a commuter to text a friend and ask: “Do you know why there are so many girls with bows at the station?” It’s mildly ironic that Abrams’ fans are so clearly delineated given that Abrams’ tour for her second album, last year’s The Secret of Us, rarely feels so distinct. In a live setting, it’s hugely apparent that despite her astronomical success – her single That’s So True spent eight weeks as UK No 1; she supported on much of Taylor Swift’s Eras tour – the 25-year-old hasn’t yet carved out her own niche. Anyone just a few years older than the bulk of the crowd – a group that, judging by the pungent smell in the arena, is around that age where you’re old enough to sweat but not to have the confidence to ask your parents for antiperspirant – will probably identify Abrams’ songs by their reference points. Mixed in with the BO are the distinct scents of the National (Aaron Dessner produced both of Abrams’ albums), Lorde, Mumford &amp; Sons and – above all – Swift and Phoebe Bridgers: a nonspecific pastiche using energetically strummed acoustic guitar, quotidian lyricism and precious twig-snap percussion; coffeehouse folk for the contactless delivery era. The songs from The Secret of Us feel richer and roomier in this live setting – Abrams’ band thankfully not giving in to arena-pop tropes such as heavy-handed drums or needless guitar solos – and her voice sounds strong and tour fit. But it’s impossible to listen to Abrams perform I Love You, I’m Sorry and Risk without wishing you were watching those far superior artists. It may be an issue of scale. Slighter songs on the album, such as I Told You Things, are turned into beefy, rollicking singalongs in this setting, and Abrams delivers every lyric on every song with a goofy, endearing grin, clearly stoked to be here. But in such a large room, backed with relatively sparse production – a tiered stage and a B-stage designed to look like Abrams’ bedroom – tedium eventually sets in. Abrams feels like a consummate performer in search of slightly better songs, although the crowd would never let you know – the kids in bows are basically moshing throughout, even when the song doesn’t at all warrant it. And hey – successful careers have been built on less.",
        "web_url": "https://www.theguardian.com/music/2025/mar/07/gracie-abrams-review-taylor-swift-o2-arena-london",
        "pub_date": "2025-03-07T14:27:38Z",
        "section_name": "Music",
        "tags": [
            "Gracie Abrams",
            "Music",
            "Culture",
            "Pop and rock"
        ]
    },
    {
        "headline": "Gracie Abrams, the year’s biggest pop star: ‘Trump has only been in office a month, and everybody is more at risk’",
        "trailText": "After dodging toxic fans, ‘nepo baby’ jibes and her own projectile vomit, the 25-year-old has just spent eight weeks at UK No 1. She explains why she’s now writing about our dark, uncertain future",
        "bodyText": "On a video call from a hotel room in Hamburg, Gracie Abrams is expounding on the virtues of decoupling yourself from social media and living a life offline. “You can literally do so much when you’re not scrolling!” she enthuses. “You can retain more information; everything gets lighter. You have a greater capacity to be more present, to be there for the people in your life, to read a book that’s going to inspire your next album, or go on a hike and breathe air instead of sitting in a dark room on fucking Instagram. I’m doing lots of, like, tactile stuff, staying off social media,” she adds. “Needlepoint and shit like that. I’m just trying to make things … to have some tangible evidence of having lived this year.” Of course, this is nothing the world hasn’t heard before: we’re well used to being told about the benefits of a digital detox. Still, it feels like an intriguing statement coming from Gracie Abrams. For one thing, her single That’s So True spent most of January at No 1 in the UK: it spent most of November and December there as well, took a brief Christmas holiday, then reappeared to beat Bruno Mars, Lady Gaga et al once more. Her album The Secret of Us also reached No 1, and is now enjoying its 18th consecutive week in the Top 20, the kind of longevity only afforded to those artists who have broken through into the upper echelons of pop stardom. It’s the same story back home in the US, where The Secret of Us has spent 35 weeks on the charts: her previous album managed two. Abrams is calling from Hamburg because it’s the latest stop on a global tour that’s been filling vast arenas for months and is scheduled to keep doing so until August. You see what she means about needlepoint, but you do wonder how much tangible evidence of having lived this year a person might need. Even by latterday pop standards, her rise seems particularly bound up with social media. She first broke through in 2020, with I Miss You, I’m Sorry: a viral lockdown hit with its cheerfully amateurish, bedroom-bound video and lyrics that seemed to fit the prevalent mood (“Do you remember happy together? I do, don’t you?”). She already had a major label deal, but was initially famed for directly interacting with her audience online: responding to their comments on SoundCloud and Instagram, sending them DMs, referring to them not as her fans but her “friends” (“more friends than anyone has ever had ever!” she told an interviewer in 2021); becoming the first non-Korean artist to use Weverse, the K-pop platform designed to offer “a deeper level” of artist-fan interaction than that of traditional social media. It’s a smart way to build a committed fanbase, and it played into a pervasive idea of Abrams as what one writer called “gen Z’s most unfiltered storyteller”: a singer-songwriter whose work was essentially private diary entries set to music, and who whispered her lyrics as if personally confiding in the listener. But it’s clearly not an approach one can maintain after the kind of success garnered by The Secret of Us, an album noticeably brighter and less introverted than her previous work (the result, she says, of both “a crush that I had felt way more significantly than in previous years” and a new writing partnership with her best friend and roommate, Audrey Hobert). When you’re packing out the Alsterdorfer Sportshalle and Madison Square Garden, not everyone online wants to be your friend. “It’s definitely not halted full stop,” she says. “There are moments where I do feel really thrilled to interact directly; whether it’s through a DM or a comment, I feel tapped into their lives still.” But, she says, it’s “less frequent, because, honestly, mentally I don’t benefit from engaging heavily in the way I used to. The way the algorithm works, if you spend five extra seconds reading a comment and there’s a keyword with your name in it, that’s what it starts to feed you. So I’d open my phone in the morning and there would be lots of unsolicited opinions that were starting to make me feel sore, and then I would notice myself carrying that feeling. But if you don’t engage with it, you don’t feel so sick.” Being tapped into your audiences’ lives seems risky in an era when we hear a lot about toxic fandoms, when artists such as Chappell Roan feel compelled to call out fans for “creepy behaviour” and “harassment”. “The very large majority of the time I have been lucky, my interactions with fans out in the world haven’t been ones that make me go ‘oh shit’,” she says. “But I’ve definitely had moments like that. I’m walking with my headphones in, or my back is turned, or my head is down and a stranger comes in with a hug before anything else … that’s really not a good feeling. As an animal, you’re just like, ‘Oh fuck, what’s that?’ Ninety per cent of the time it’s really sweet introductions, or no crossing any lines with physical touch. But if you experience it even once, your guard can go up, because it feels unnatural. You want to walk a fine line between being attuned to what your audience feels and letting your own conviction guide you.” The occasional over-familiar fan aside, Abrams’ rise appears to have been remarkably smooth. Big names have flocked to work with her: The Secret of Us, like its predecessor Good Riddance, was made with the National’s Aaron Dessner, best-known as Taylor Swift’s chief latterday collaborator; Brian Eno unexpectedly cropped up on one track from Good Riddance. She has enjoyed a succession of profile-boosting celebrity co-signs. No sooner had I Miss You, I’m Sorry appeared than Olivia Rodrigo announced that her forthcoming single was inspired by it – the forthcoming single turned out to be themulti-bn streaming Drivers License – while Taylor Swift selected her as the support act on two sizeable chunks of the record-breaking Eras tour and appears as a guest and co-writer on The Secret of Us. Abrams recently posted a photo of herself embracing her idol, Joni Mitchell, who was apparently unfazed even when Abrams showed her a tattoo she has featuring Mitchell’s handwritten lyrics. She has pulled off the enviable trick of establishing a fanbase who feel her songs confide her innermost secrets to them, while also drawing a veil over her private life, only ever discussing it publicly in the vaguest terms (she is presumed to be in a relationship with actor Paul Mescal, but has never confirmed it to the wider world). “Sharing versus not sharing,” she nods. “I’m lucky to have this avenue, where, in my songs, I talk very openly about how I feel. It’s like when I’m writing, I’m talking to myself. Talking to strangers, there are naturally things you hope to protect a bit more. Some things feel sacred.” She seems smart, thoughtful and level-headed: at 25, she appears to be navigating the choppy waters of celebrity with admirable ease. This might have something to do with her background: her father is the Hollywood director/producer JJ Abrams. On the one hand, that means her success has played out to a constant background hum of sniping in which the phrase “nepo baby” figures heavily, but there are presumably worse preparations for fame than growing up in a celebrity-adjacent Hollywood family. Quite the opposite, she says: she was so introverted as a teenager that she thought a “public-facing career” was out of the question. “I knew that it would involve performing, and that was the part that felt so horrifying to me. I wrote songs because it was easier than talking about my feelings. I wasn’t interested in anybody hearing me. I was so turned off by the idea of confronting people face-to-face. That was what I loved about sharing music online – you could hide behind a profile.” As her major label courted her, she kept her fears hidden. “I remember signing my deal and feeling really nauseous about it.” So what changed? “Well, I see a therapist. And it hasn’t been some overnight thing. The first shows I ever played were over Zoom during the pandemic, so that was like a baby step versus truly facing my fear head-on. Then I played the tiniest rooms” – which, it should be noted, didn’t stop her “projectile vomiting” before going onstage – “so it’s almost like these tiny moments of exposure therapy.” Clearly it worked: you don’t see much evidence of introversion in the fan videos of her onstage, belting out I Miss You, I’m Sorry from a set designed to look like the bedroom in which she recorded the song’s original video, or lecturing audiences in a pre-election US about the necessity of voting when “democracy is hanging by a thread”. She was an ardent Harris supporter, and performed at one of her campaign rallies in Wisconsin. In the wake of the US election result, one theory that did the rounds was that the sheer wattage of celebrity endorsements Harris received was counterproductive – that they reinforced the notion that the Harris campaign was out of touch with ordinary voters’ concerns in a difficult economic climate. “I don’t think it was counterproductive,” Abrams frowns. “The issues were so much deeper, more systemic. How I feel about having played a tiny role in one of her many rallies that she crushed flawlessly every single time is that I’m proud to have been there and proud to have felt that energy in the room. That was so tangible and so real, and it’s something I’ve held on to since the results of the election. “Trump has only been in office for a month and has already done everything in his power to make every marginalised community feel smaller, to make everybody more at risk, to overwhelm us with information, or disinformation, so that we feel powerless and hopeless. And what I felt at that rally in Wisconsin that day was the opposite of hopelessness: I felt real strength in gathering. That’s the antidote right now. Obviously, there’s got to be so much more we do when we gather in that way. But I feel really lucky to have witnessed in person what that kind of light feels like, especially now in the face of this quality of darkness. It’s unprecedented, it’s global.” She was so crushed by Trump’s victory that she wondered about going on tour at all. “Right before going off, I was just like: how are we not all dedicating all of our time to fighting this … thing?” She decided that “if me, Gracie, in the position I’m in in this world – like the luckiest ever – is feeling this way, then everybody is feeling this fucking way. I can give people who are coming to these shows two hours to feel everything they’re feeling at an extreme, and be able to express it, or just distract themselves for two hours and recharge their battery. We’re going to have to work out how to do that every single day, not just for the next four years, because obviously the impact of the next four years is going to be long-lasting.” She says she spent a week at Dessner’s studio before departing for Europe to work on new material, and found herself writing noticeably different kinds of songs than she expected. “I was just like: shit, I don’t even know how to articulate the degree to which I feel sick inside about everything. Most of those songs from that week are not about relationships. They’re about the fact that LA just burned down, about the fact that I don’t understand how we’re supposed to really carry on. Of course those subjects will show up, it’s life, but they’re … different themes than I anticipated.” But then, as she points out, nothing has turned out like she expected. “After signing and starting to release music in a more real way, and after playing my first shows and realising I was wrong about how I felt about playing live because of the kindness of the people in the room, I started writing long letters to myself about dreams,” she says. “One of the things I wrote after my first show was ‘One day I want to open for Taylor Swift’. That was never going to happen, obviously. What’s been so lucky is that the goalposts keep kind of moving and my imagination has expanded and I feel excited about being out of my comfort zone. “Being proved wrong about what was the scariest thing in the world to me at the time has made me really excited to be wrong about everything else.” She laughs, before heading off to another packed arena. • Gracie Abrams’ UK and Ireland tour begins Monday 3 March at Nottingham Motorpoint Arena. The Secret of Us is out now.",
        "web_url": "https://www.theguardian.com/music/2025/feb/28/gracie-abrams-the-years-biggest-pop-star-trump-has-only-been-in-office-a-month-and-everybody-is-more-at-risk",
        "pub_date": "2025-02-28T05:00:48Z",
        "section_name": "Music",
        "tags": [
            "Gracie Abrams",
            "Pop and rock",
            "Music",
            "Culture",
            "Taylor Swift",
            "Donald Trump",
            "Kamala Harris"
        ]
    },
    {
        "headline": "Harris hails first-time and gen Z voters at Wisconsin rally: ‘I’m so proud of you’",
        "trailText": "Artists including Remi Wolf, Gracie Abrams and Mumford &amp; Sons join VP at rally briefly interrupted by Gaza protesters",
        "bodyText": "Kamala Harris warned a crowd that time was running out at a get-out-the-vote event in Madison, Wisconsin, on Wednesday, joined by a lineup of folk and pop musicians including Remi Wolf, Gracie Abrams and Mumford &amp; Sons. “We have six days left in one of the most consequential elections of our lifetime,” the vice-president and Democratic nominee told the crowd, denouncing Donald Trump and issuing a dire warning about the consequences of a second Trump presidency. “On day one Donald Trump would walk into office with an enemies list,” said Harris, before launching into a speech highlighting her policy planks, including a proposal to cut taxes on small businesses and to expand healthcare coverage for families caring for an elderly parent at home. To prolonged applause, Harris rallied the crowd in support of abortion rights, vowing to sign protections for reproductive healthcare into law. As she has often during her campaign, Harris projected a centrist image, pledging “to listen to experts, to those who will be impacted by the decisions I make, and to people who disagree with me”. During her speech, protesters in two different sections of the crowd interrupted her to draw attention to Israel’s war in Gaza, shouting “free Palestine” and unfurling banners. Pausing to address the demonstrators, Harris said: “We all want the war in Gaza to end and get the hostages out as soon as possible, and I will do everything in my power to make it heard and known.” She added, to cheers: “Everyone has a right to be heard, but right now I am speaking.” Harris has repeatedly visited Wisconsin, a key swing state where elections are decided by the razor-thin margins. She has paid special attention to Madison, and its suburbs, which reliably turn out overwhelming majorities for Democratic party candidates in races that generate unusually high turnout. In the 2020 presidential election, voter turnout in Dane county reached 89%. The campaign has invested in youth organizing in Wisconsin, hiring seven full-time campus organizers and a youth organizing coordinator. To broad applause, Ty Schanhofer, a first-time voter and student at the University of Wisconsin, introduced Harris and encouraged students to vote early. Don’t miss important US election coverage. Get our free app and sign up for election alerts “I love your generation, I just love you guys,” said Harris, during the rally, praising young people for being “rightly impatient for change” and enumerating a list of challenges, including the climate crisis and school shootings, that have come to define the gen Z experience. “I see your power, and I’m so proud of you. Can we hear it for our first-time voters!” The former lieutenant governor Mandela Barnes spoke at the rally too, highlighting the narrow margins that have come to define statewide elections in Wisconsin. “I want us to feel joy once again,” said Barnes, who ran for a seat in the US Senate and lost by one point to Ron Johnson, the incumbent Republican who has bolstered Donald Trump’s wildest conspiracy theories – including his claims of a stolen election in 2020. Chris LaCivita, a senior staffer on the Johnson campaign, is co-manager of Trump’s 2024 presidential campaign. The campaign punctuated speeches including Barnes’s with musical acts to rally the crowd. “We have values and ideas that deserve a platform,” said the singer-songwriter Gracie Abrams, a popular gen Z musician whose performance drew uproarious applause. “Our participation and our vote have never been more crucial.” Abrams was probably a draw for some in the audience, which leaned young. The campaign also offered the elder millennials in the crowd something of their own: a performance by the British folk-pop band Mumford &amp; Sons, whose lead singer announced to some surprise that he has voted in California, where he was born. Harris has featured a lineup of celebrity endorsers and performers at her rallies during the 2024 election cycle. At a rally in Texas last week, Beyoncé herself endorsed Harris’s presidential bid, and Jennifer Lopez is scheduled to appear with Harris at a rally later this week. The star-studded series of events could give the Harris campaign a boost. When Harris campaigned in Eau Claire, Wisconsin, the folk band Bon Iver – from the Eau Claire area – opened for her. The Madison crowd was energetic on Wednesday night, but with less than a week to go before election day, some Democrats at the venue seemed anxious. “I’ve been making calls for Harris,” said Mary Ann Olson, a retired teacher, who waited in pouring rain for the rally. “If she doesn’t win, and I didn’t do anything, I think I would hate myself.” Olson’s daughter, Chelsea, said she was “really stressed out”, adding: “I’m not sure I can handle four more years of Donald Trump.”",
        "web_url": "https://www.theguardian.com/us-news/2024/oct/30/kamala-harris-madison-rally",
        "pub_date": "2024-10-31T02:11:07Z",
        "section_name": "US news",
        "tags": [
            "US elections 2024",
            "Kamala Harris",
            "Wisconsin",
            "US news",
            "Democrats",
            "US politics",
            "Gaza",
            "Israel-Gaza war",
            "Gracie Abrams"
        ]
    },
    {
        "headline": "Glastonbury 2025: the 1975, Neil Young and Olivia Rodrigo to headline",
        "trailText": "Charli xcx, the Prodigy and Loyle Carner will headline the Other stage, with first-time sets from Alanis Morissette, Doechii and En Vogue",
        "bodyText": "This year’s Glastonbury set will feature two first-time headliners in the British pop-rock group the 1975 and the US pop-punk songwriter Olivia Rodrigo. The band, led by Matty Healy, will top the Friday night billing on the Pyramid stage. Rodrigo will perform on Sunday. In 2022, the Drivers License singer performed on the Other stage, a set that boasted a guest spot from Lily Allen and an excoriation of the US supreme court following the overturning of Roe v Wade a day earlier. In between on Saturday comes a previously – accidentally – announced headline set from Neil Young and his band the Chrome Hearts. On 1 January, Young declared, out of the blue, that he was withdrawing from this year’s festival owing to his perception that it was under broadcast partner the BBC’s “corporate control”. Two days later, he said he had received “an error in information” and that the festival was “back on our itinerary”. He previously headlined in 2009. The soul-pop star Raye will play on the Pyramid stage before Young. The 27-year-old Londoner is already something of a national treasure after walking away from her major label to find critical and commercial success with her debut album, My 21st Century Blues. The festival previously revealed that Rod Stewart would take this year’s “legends” slot. Stewart, who turned 80 in January, said he was “more than able to pleasure and titillate” at his age. The Other stage headliners have also been revealed. After turning the world lime green with her culture-dominating album Brat last summer – and rivalling Dua Lipa’s headline extravaganza with merely a DJ set at Glastonbury 2024 – Charli xcx will headline the festival’s second stage on Saturday. The London rapper Loyle Carner headlines it on Friday, and the Prodigy will close the stage on Sunday – the dance group’s first Glastonbury performance since the death of their frontman, Keith Flint, in 2019, just before that year’s festival. A raft of talents old and new are among this year’s first-time performers. At the breakout end of the scale, there is the Stick Season troubadour Noah Kahan, the That’s So True songwriter Gracie Abrams, the Messy singer Lola Young, the euphoric Brits-minted star Myles Smith, the cheeky American-Ghanaian rapper Amaarae and the A Bar Song (Tipsy) star and Beyoncé collaborator Shaboozey. There are more surprising debuts from Alanis Morissette, Busta Rhymes, Brandi Carlile – who will be fresh off the back of a duets album with Elton John – the US girl group En Vogue, Anohni and the Johnsons, the cult British funk act Cymande, the hard-touring Osees and everyone’s friend electric, Gary Numan. Worthy farm stalwarts scheduled to perform include Ezra Collective – riding high off winning best group at this year’s Brit awards – the Australian punk tykes Amyl and the Sniffers, Jorja Smith, Creedence Clearwater Revival’s John Fogerty and the roots reggae stars Burning Spear and Black Uhuru. Friday also sees the return of the Isle of Wight indie duo Wet Leg, presumed to be back this year with their second album. The Irish pop star CMAT is another returning talent, along with the Bath dance iconoclast PinkPantheress and Sheffield’s Self Esteem, who returns with her new album, A Complicated Woman, in April. After winning best rap album for her mixtape Alligator Bites Never Heal at this year’s Grammy awards – which also featured a performance hinting at the magic she will bring to Worthy Farm – the Florida rapper Doechii will headline the West Holts stage on Saturday. That day also sees the Glastonbury debut of Jade, formerly of the UK girl group Little Mix. She joins a well-rounded day that features the London rock duo Nova Twins and the capital-born rapper Pa Salieu, the returning Scissor Sisters and New York indie stalwarts TV On The Radio, who have received rave reviews for the 20th anniversary tour of their 2004 album Desperate Youth, Blood Thirsty Babes. On Sunday, the British indie quartet Wolf Alice mark their return, four years after their critically acclaimed third album, Blue Weekend. The Libertines – now a venerable indie institution far from their chaotic 00s heyday – lead an indie-heavy lineup that also features the resurgent Maccabees. From varying sides of the US rock firmament, St Vincent will perform songs from her 2024 album All Born Screaming, and the presence of Baltimore hardcore band Turnstile indicates that they may finally release the much clamoured-over followup to 2021’s Glow On. More acts are yet to be announced in the coming months, with performances rumoured from Chappell Roan, Sabrina Carpenter and – take it with a pinch of salt – Rihanna, which seems incredibly unlikely given that the three Pyramid headliners have already been revealed. This year’s festival takes place from 25 to 29 June. It will take a fallow year in 2026 to allow the farm land to rest; the last intentional one was in 2018. The festival did not take place in 2020 or 2021 owing to the Covid-19 pandemic. The Glastonbury 2025 lineup in full Friday The 1975 Loyle Carner Biffy Clyro Alanis Morissette Busta Rhymes Maribou State Gracie Abrams Four Tet Wet Leg Anohni and the Johnsons BADBADNOTGOOD Blossoms Burning Spear CMAT Denzel Curry En Vogue English Teacher Fatboy Slim Floating Points Franz Ferdinand Glass Beams Inhaler Osees PinkPantheress Self Esteem Myles Smith Supergrass Vieux Farka Touré Faye Webster Wunderhorse Lola Young Saturday Neil Young and the Chrome Hearts Charli xcx Raye Doechii Deftones Ezra Collective John Fogerty Amyl and the Sniffers Amaarae Beabadobee Bob Vylan Caribou Brandi Carlile Father John Misty Beth Gibbons Lucy Dacus Yussef Dayes Greentea Peng Jade Japanese Breakfast Kaiser Chiefs Kneecap Leftfield Nick Lowe Nova Twins Gary Numan Tom Odell Pa Salieu Scissor Sisters The Script TV on the Radio Weezer Sunday Olivia Rodrigo Rod Stewart The Prodigy Noah Kahan Nile Rodgers and Chic Wolf Alice Jorja Smith Overmono The Libertines AJ Tracey Black Uhuru The Brian Jonestown Massacre Celeste Joy Crookes Cymande Future Islands Girl in Red Goat The Maccabees Parcels Pawsa Katy J Pearson Royel Otis The Selecter Shaboozey Snow Patrol Sprints St Vincent Kae Tempest Turnstile",
        "web_url": "https://www.theguardian.com/music/2025/mar/06/glastonbury-2025-the-1975-neil-young-and-olivia-rodrigo-to-headline",
        "pub_date": "2025-03-06T08:00:21Z",
        "section_name": "Music",
        "tags": [
            "Glastonbury 2025",
            "Glastonbury festival",
            "Music",
            "Culture",
            "Festivals",
            "Pop and rock",
            "Rap",
            "Hip-hop",
            "Olivia Rodrigo",
            "The 1975",
            "Neil Young",
            "Charli xcx",
            "Raye",
            "Rod Stewart",
            "Loyle Carner",
            "The Prodigy",
            "Gracie Abrams",
            "Gary Numan",
            "Ezra Collective",
            "Amyl and the Sniffers",
            "Music festivals"
        ]
    },
    {
        "headline": "Saturday Night Live: Chris Rock can’t save a flat episode",
        "trailText": "The comedian was stuck with a string of mostly unfunny ho-hum sketches in a disappointing week",
        "bodyText": "Episode nine of Saturday Night Live’s 50th season opens with Nancy Grace’s (Sarah Sherman, doing a solid impression for a change) YouTube show’s coverage of Luigi Mangione, the recently apprehended alleged murderer of UnitedHealthcare CEO Brian Thompson. The hypocritical Grace is morally outraged over Mangione’s status as a sex symbol, dismissing people’s fury over the state of healthcare in America: “Then how come my dentist gives me breast exams for free?” She briefly interviews a psychiatrist (Ashley Padilla), a witness from the McDonald’s where Mangione was captured (Kenan Thompson), and a man who looks like the assassin (Emil Wakim). Aside from Thompson’s witness, no one can get a word in between the apoplectic Grace and the nonstop ads for bro-y fitness scams. This is a nothing of a cold open that wastes the resemblance between Wakim and Mangione to instead parody Grace, a figure who hasn’t been relevant in almost a decade. Former cast member Chris Rock returns for hosting duties. He delivers a standup routine about current events, getting in a good line about Brian Thompson (“I have real condolences … but, you know, sometimes drug dealers get shot”) before doling out several lazy – not offensive, mind you, just lazy – jokes about Mexicans getting deported under Trump. Rock’s material has been better. The first sketch of the night takes place at a mall Santa’s village. Rock’s happy elf gives visitors two options to choose from – a white Santa and a Black Santa – forcing uncomfortable white parents to choose or flee. A few years ago, this premise might have proved cutting, but post-Trump’s re-election, these pokes at fragile Caucasians and their white guilt complexes just don’t land with the same force. At an office secret Santa party Rock’s employee is gifted a portrait of himself as a Simpsons character. He’s so psyched about it that he creates his own episode, one where he plays Bart’s dance instructor, who discovers Homer is physically abusing Marge. He decides to take matters into his own hands, hunting down Homer at Moe’s, where he beats him to death (“as he lays dying on the floor, he utters his final words: D’oh!”). The imagined episode ends with him and Marge in bed, orgasming together. This one coasts on easy pop culture nostalgia, but it also contains some unexpectedly funny lines (such as Chloe Fineman excitedly exclaiming “I can’t wait to try these!” when given a box of tampons for a present). Then, a group of friends discover a magical car from the 1950s, only to find that it’s super racist and sexist. One note and over before it begins. Musical guest Gracie Abrams performs her first song, then it’s time for Weekend Update. The segment’s first guest is a bald man (Andrew Dismukes in a bald cap), there to comment on a British court’s recent ruling that calling someone bald is a form of harassment. The chrome dome commenter angrily chides Colin Jost and others for their constant jokes and stereotypes, even as he makes himself look like a stick of deodorant and polishes his head like a bowling ball. Silly and stupid, in a good way. Later, Jost welcomes freshman cast member Jane Wickline to debut a new Sabrina Carpenter-styled song. Rather than attempting to do an impression of Carpenter or sing in her style, she explains that, for the purposes of the performance, she simply “is” her. The song is about her jealousy over fan speculation of every other celebrity’s sexuality: “Why am I the only straight pop star taken at their word?” The audience is initially cold to the bit, but Wickline gradually wins them over. A surgery goes awry when the doctors realize they’ve removed the patient’s gallbladder instead of his appendix, like they were supposed to. The blame lies on nervous nurse Leslie (Sherman), who marked the wrong organ for removal (she also lost one of her air pods in the patient and didn’t give him enough nitrous oxide to stay sedated). Despite how bad she messed up, the patient himself – played by Adam Sandler in a surprise reveal – defends her, even as he douses the room in blood from his open incision. This goes completely off the rails thanks to faulty special effects, but Sandler salvages things simply by being his goofy, charming self. After Abrams’s second song of the night, we get a monster truck-style advertisement for a corporate office Christmas party featuring uncooperative music apps, annoying kids, interminable Secret Santa games, jealous spouses, pissed off cleaning staff and DUIs. Your standard roll call sketch that doesn’t give any joke the room to breathe, but at least this one uses a different template. As seems to be the new tradition, we end on a sketch set in a restaurant. Ego Nwodim’s nervous single awaits her blind date, only to be met by Rock’s horny, scheming interloper. He’s a lying scumbag who constantly interrupts their conversation to ask if she would like to have sex in her car. She naturally rebuffs him, but when her actual date shows up and turns out to be a smug, young finance douchebag, she realizes he was actually the lesser of two evils and decides to put out. A flat note to end a mostly flat episode. On paper, Rock seemed like the type of host this season should be stacked with. However, his most memorable moments during his three years on the show came about in Weekend Update appearances where he was himself, so it wasn’t like he had any popular characters to bring back. That would be fine if he were a more natural sketch comedian, but he came off noticeably awkward most of the time. Sandler helped pick up the slack, but it wasn’t enough to redeem the episode. Noticeably absent was Dana Carvey, breaking what had been the longest streak of consecutive guest appearances in the show’s history. It would have been nice to see him, Sandler and Rock together, since they are all season 17 and 18 alumni, but alas.",
        "web_url": "https://www.theguardian.com/tv-and-radio/2024/dec/15/saturday-night-live-chris-rock-hosts",
        "pub_date": "2024-12-15T15:58:49Z",
        "section_name": "Television & radio",
        "tags": [
            "Saturday Night Live",
            "Television & radio",
            "Chris Rock",
            "Culture",
            "TV comedy",
            "Comedy",
            "Television",
            "US television",
            "Gracie Abrams"
        ]
    },
    {
        "headline": "Beyoncé at Kamala Harris rally says ‘time for America to sing a new song’ – as it happened",
        "trailText": "Harris campaign says crowd of 30,000 is largest to date, while Trump is delayed for rally in swing-state Michigan",
        "bodyText": "Closing Summary This blog is closing now, thanks for following along. You can read our US elections coverage here. Here are the major developments from today: In Houston, Kamala Harris was joined onstage by superstar singer Beyoncé, congressman Colin Allred, musician Willie Nelson, actress Jessica Alba, several Texas-based OB-GYNs and families impacted by the state’s abortion ban in what her campaign is calling their largest rally to date. Harris focused her remarks on the state’s abortion ban, which sparked a slew of abortion restrictions nationwide, and was joined on stage by Amanda and Josh Zurawski, a Texas couple who sued the state after Amanda was unable to access treatment for a life-threatening pregnancy complication. Donald Trump’s rally in Traverse City, Michigan was delayed several hours after the ex-president’s interview with podcast host Joe Rogan lasted three hours. Trump Harris and Trump are tied at 48% each for the popular vote for the US presidential election, according to the final New York Times/Siena College national poll published on today. Chinese hackers have targeted phones used by Donald Trump and JD Vance, the New York Times reported on Friday, citing people familiar with the matter. According to the sources, investigators are trying to determine what communication data may have been taken or observed. On Friday, Joe Biden formally apologized for the United States government’s role in running at least 523 Indian boarding schools. His remarks were given at the Gila Crossing community school outside Phoenix, Arizona, and marked his first visit to Indian Country as president. The Washington Post declined to endorse a presidential candidate for the first time since the 1980s. Senior Democratic figure Susan Rice, who was US ambassador to the United Nations and national security adviser under Barack Obama and then director of the US domestic policy council under Joe Biden, made a blistering post on X about the Washington Post. “So much for ‘Democracy Dies in Darkness’,” she said, referring to the newspaper’s slogan. Two Senate Democrats have written a letter urging the justice department to investigate, and if necessary prosecute, Elon Musk over his potentially illegal $1m giveaway for registered voters. And another top Democrat is calling for an investigation into Musk for the tech billionaire’s ties to Russia. During his rally in Scranton tonight, Tim Walz took a moment to express his appreciation for Joe Biden, who was born in the Pennsylvania city and remains a popular figure there. “This country owes a huge debt to you and a huge debt to Joe Biden,” Walz said. Harris raised $97m in the first half of October, compared with Trump’s $16m, according to reports filed with the Federal Election commission. In an appearance on the Cats &amp; Cosby podcast, a conservative talk radio show, Donald Trump said special counsel Jack Smith should be deported. Trump made news yesterday when he said he would fire Smith, the justice department official who is prosecuting him for allegedly plotting to overturn the 2020 election and hide classified documents, “within two seconds” of becoming president. Harris has concluded her rally in Houston, calling on voters to cast their ballots in the next 11 days. “Do we trust women? Do we believe in reproductive freedom? Do we believe in the promise of America, and are we ready to fight for it?” Harris said, before concluding, “And when we fight, we win.” “We know weeping may endure for a night, but joy cometh in the morning,” Harris says, quoting Psalm 30:5 and encouraging voters to get out to the polls before 5 November. Speaking to Gen Z voters in the audience, Harris says that she “sees your power”. “It ain’t right that you may have fewer rights than your mother or your grandmother,” Harris said, before asking the crowd: “Can we applaud our leaders who are voting for the first time?” Seeking to cast herself in contrast to Donald Trump, Harris said she will restore reproductive freedom if elected president. “When Congress passes the bill to restore reproductive freedom, I will proudly sign it into law,” Harris said. “Since Roe was overturned, every time reproductive freedom has been on the ballot, from Kansas to California to Kentucky and Michigan, Montana, Vermont and Ohio, the people of America have voted for freedom.” Harris is continuing, speaking about the stakes of the supreme court if Trump is re-elected. “And now the attorney general of Texas is suing the United States government so that Texas prosecutors can get their hands on private medical records of women who leave the state to get care,” Harris said. “On the one hand, Donald Trump won’t let anyone see his medical records. I gave up mine. And on the other hand, they want to get their hands on your medical records. “Let us be clear, if Donald Trump wins again, he will ban abortion nationwide,” Harris said. “No one is protected if there is a Trump national abortion ban. “If Donald Trump is president again, he will likely get to appoint at least one justice” to the Supreme court, Harris said. “At which point Donald Trump will have packed the court with five out of nine justices.” Kamala Harris is continuing to excoriate Donald Trump, sharing the stories of women who’ve been denied healthcare since Roe was overturned. “Texas, what is happening across this state, in our country, is a health care crisis. And Donald Trump is the architect of it,” Harris said. She went on to share the story of Ryan Hamilton, who found his wife alone and bleeding after being denied care for a miscarriage. “Let’s be clear, men across America, this needs to be said, men across America do not want to see their sisters and mothers put at risk because their rights have been taken.” Kamala Harris has just shared the story of Kate Cox, a Texas woman who was denied emergency abortion care by the Texas Supreme Court, and is introducing Shanette Williams, the mother of Amber Nicole Thurman. “Amber Nicole Thurman, I promised her mother, I would speak her name, a vibrant 28 year old mother of a six year old son who died of preventive death because of Georgia’s abortion ban,” Harris said. Harris has continued, denouncing Republican leaders who have neglected maternal and infant healthcare while denying abortion care across the US. “For decades, these extremist leaders, who have neglected prenatal care, maternity care and postpartum care, and who now continuously failing support women and children, claim to care of women and children. I have a question for them, where you been?” Harris said. “Where have you been when it comes to helping pregnant women and new mothers? Where have you been when it comes to affordable child care?” “The hypocrisy abounds,” she said, before showing a video combining testimony of families who’ve suffered under abortion bans alongside Donald Trump saying he did “a great thing” by appointing the Supreme court justices who overturned Roe v. Wade. Speaking onstage at her rally in Houston, Kamala Harris is making a powerful call for reproductive rights. “You are ground zero in the fight for reproductive freedom,” she said. “We know what’s happening here in Texas, doctors and nurses could go to prison for life simply for providing reproductive care.” “Texas has a law now that offers a cash bounty for turning in someone who merely helps a friend or a family member get the care they need,” Harris added. “In some counties in Texas, they have passed travel bans to prevent women from going to other states to receive care.” “When Donald Trump was president, he hand selected the United States Supreme Court with the intention that they would undo the protections of Roe v Wade, and as he intended, they did. And now more than 20 states have a Trump abortion ban.” “Now, one in three American women live in a state with a Trump abortion ban,” she said. “And let us agree, one does not have to abandon their faith or deeply help to agree the government should not be telling her what to do with her body.” Beyoncé has welcomed Kamala Harris on stage, with her song Freedom playing in the background. “It’s time to sing a new song,” Beyoncé said. “Our generations of loved ones before us are whispering a prophecy, a quest, a calling, an anthem, our moment right now. It’s time for America to sing a new song.” Beyoncé and Kelly Rowland are speaking onstage at the Harris rally in Houston. “We are grabbing back the pen to write a new American story, a story of community, of equality, strength, of kindness and of hope,” Rowland said. “When I was a little girl and I pledged allegiance to the United States of America, that flag meant something to me, and today that means grabbing that pen and casting my vote as I already did two days ago, for Kamala Harris and Tim Walz.” “I’m not here as a celebrity. I’m not here as a politician. I’m here as a mother,” Beyoncé said. “Imagine our daughters growing up seeing what’s possible with no ceilings, no limitations.” “Your voice has power and magnitude. Your vote is one of the most valuable tools. And we need you. Your freedom is your God given right, your human right,” she added. Tina Knowles, an American businesswoman, fashion designer and mother of Beyoncé, is speaking now at Harris’ rally in Houston. “I’ve been so blessed to have many careers, many Black jobs,” Knowles opened, referencing Donald Trump’s statement that immigrants are going to take so-called “Black jobs” from Black Americans. “The best job that I’ve ever had is being a mother.” “I’m so proud to be here with two of my daughters,” Knowles said, before welcoming her daughter Beyoncé and good friend Kelly Rowland. After a long intermission, Ondrea Cummings has begun speaking at the Harris rally in Houston. Cummings, a resident of San Antonio, is featured in a new ad that the Harris campaign released earlier this week, telling her story of nearly dying after a pregnancy complication. “In the fall of 2022, after many prayers, my husband and I found out that we were expecting. Everything changed when my one evening far too early into my pregnancy, after going to the ER and my OB GYN, and learning that my pregnancy was not viable, I was given no options. Despite being at high risk for infection because of Texas extreme laws, I was told I had to wait, which I did in the hospital for days,” Cummings said. “My baby girl, Emery J, was born five days after my water broke. She lived only for a few minutes, but I hold my baby close to my heart,” she said, describing how she developed a severe infection that left her hospitalized for three weeks afterward. “Today is the first time I’m sharing my story. It’s taken many months of physical and emotional healing to get where I am today,” Cummins said. “Texas abortion bans unleashed by Donald Trump almost cost me my life,” she added before noting that Black and brown womens’ pain is often ignored. The Harris campaign reports that 30,000 people are at her Houston rally tonight, the largest crowd to date for her campaign. Follow along here: Colin Allred, the Democratic congressman running to unseat Texas senator Ted Cruz, is speaking at Kamala Harris’ rally in Texas, denouncing his opponent and recalling his experience in Congress on January 6. “I believe in a very different Texas than Ted Cruz does,” Allred said. “My time in Congress, I’ve been the exact opposite of Ted Cruz, because I never forgot where I came from, never forgot the folks who gave me a chance. I’ve been the most bipartisan Texan in Congress, because that’s how you get things done.” “Ted Cruz is too small for Texas,” Allred said, recalling how Cruz took refuge in a supply closet during the January 6 attack on the Capitol while Allred prepared to defend his colleagues, using the strength he says he built as an NFL linebacker, and how Cruz fled the state during a deadly winter storm. He went on to lead the crowd in a chant of “You gotta lose your job.” Amanda and Josh Zurawski, a Texas couple who sued the state after Amanda was unable to access treatment for a life-threatening pregnancy complication, are speaking now at Kamala Harris’ rally in Houston. “After 18 months of grueling fertility treatments in the spring of 2022 we were thrilled to find out that she was pregnant with our first baby, a girl. We were over the moon,” Josh said. “My first trimester was smooth sailing, but suddenly at 18 weeks, I suffered complications we were, with 100% certainty going to lose our baby girl. We were devastated. What I needed at that point was an abortion so that I could safely and with dignity, deliver our daughter and begin the healing process,” Amanda added. “But this was Post Roe Texas, the near total abortion ban had gone into effect just two days after Amanda’s water broke, ending the pregnancy would have been illegal abortion under the Texas ban, our doctor risked losing her license and even face jail time,” Josh continued. “Eventually, Amanda’s temperature spiked. She was shaking and disoriented. We rushed to the emergency room, and by this time, Amanda had developed an infection, which had become septic.” “I was finally close enough to death to deserve health care in Texas,” Amanda said. “It is unthinkable to me that anyone could cheer on the cruel abortion bans that nearly took Amanda’s life, but that’s exactly what Donald Trump and Ted Cruz have done,” Josh said. “The decision about if and when to start a family should be ours to make. Not Donald Trump’s, not Ted Cruz’s. That’s why we need to elect vice president Harris, representative Colin Allred and Democrats up and down the ballot to restore our reproductive freedom.” Lifelong Texan and beloved musician Willie Nelson is on stage at the rally performing Mammas Don’t Let Your Babies Grow Up to Be Cowboys and On the Road Again. The 91-year-old Texan wore his signature braids and red bandana as he performed on stage with a band. Yesenia Gamez Gamboa, a Tucson-area immigration lawyer, is sharing her experience healing from an ectopic pregnancy and pursuing IVF in order to conceive a family with her husband. “Access to a safe and quick abortion was what saved my life and preserved my fertility and now those very same protections are gone,” she said, on stage at Kamala Harris’ Houston rally. “I trust women to make decisions over their own bodies, and I trust Texas Women to tell men like Ted Cruz. JD Vance and Donald Trump that they are done, their turn is over.” Kamala Harris’s campaign is playing another ad between speakers at its Houston rally. This one features a woman who recalls being impregnated by her abusive stepfather at the age of 12. “I didn’t know what to do. I was a child. I didn’t know what it meant to be pregnant at all. But I had options,” she says. “Because Donald Trump overturned Roe v Wade, girls and women all over the country have lost the right to choose, even for rape or incest. Donald Trump did this. He took away our freedom.” Todd Ivey, a Houston-based OB-GYN, is speaking now at Kamala Harris’ rally in Texas, and is joined on stage with several colleagues in their white coats. “Today in Texas, because of Donald Trump, I could be thrown in prison for life for providing reproductive health care,” Ivey said. “As a result, many of my patients with tragic pregnancy complications have been forced to flee up to get the health care that they need and that they deserve.” “Nearly 7 in 10 OB-GYNs say that abortion bans have worsened their ability to manage pregnancy related emergencies, and here in Texas, three and four OBGYNs have said they simply can no longer practice evidence based medicine,” he added. “Tens of thousands of Texas women traveled out of state for abortion care last year, leaving their jobs, leaving their homes and leaving their families just to get medical care.” “I was shocked when Roe was overturned, but I’ve never been more shocked to hear Donald Trump continue to brag about them,” Ivey said. “So let me be clear about one thing, there is no place for Donald Trump in my exam room.” Between speakers at Kamala Harris’ rally in Houston, the campaign briefly displayed an ad featuring the family of Amber Nicole Thurman, a Georgia woman who died because of the state’s abortion ban. “This is the result of what happens when you try to control a woman’s body. My daughter is gone because of what Donald Trump did. She would be here had they helped her,” Thurman’s mother, Shanette Williams, said in the video. Kamala Harris’s rally in Houston has gotten under way this evening, with actor Jessica Alba kicking off the event. “It was here in Texas that I learned the importance of looking out for your neighbors, lending a hand without hesitation and treating people the way you would want to be treated,” Alba said, noting that she spent a portion of her childhood living in Del Rio, Texas. “As a woman, I know we need a leader like Kamala Harris who is dedicated to protecting reproductive freedom,” she added, also noting her support for Harris’s proposed child tax credit. “So let’s hear it Houston, We are not going back,” Alba concluded. Leonard Sanchez is attending the Harris rally with other members of his Local UFCW455, which represents grocery and retail workers in southern Texas and Louisiana. Being a long-time Democrat in a perennially red state can be “rough,” he conceded. But he hopes Harris’s star-studded event in the final stretch of the campaign jolt apathetic voters in the state, who feel their vote matters. But he said so much is on the line, especially in Texas, which has a near-total ban on abortion. While Sanchez is supportive of Harris, he also fears a return of “the other guy” to the White House. “He’s too anti-immigrant,” he said, adding that Trump was not a real ally of labor. Sanchez said he is baffled by union members who are abandoning Democrats for Republicans, especially in a right-to-work state like Texas. He is hopeful Harris will take on big corporations and fight for better wages, but progress will also depend on changing the state’s politics. “Every year we get a little bit closer and closer,” Sanchez said. Among the crowd at the Harris rally in Houston, many said they waited for hours to get in, as temperatures climbed to 90F, just shy of a record for late October. Sara Gonzales, 32, of Splendora, Texas, rearranged her work schedule and drove to the stadium as soon as she finished her early-morning shift at Starbucks. Gonzales said she was an independent and and wrote-in a candidate for president in 2020. But the political stakes changed when the Supreme Court overturned Roe, and Texas enacted a near-total ban on abortion. “Being a woman in Texas right now, it’s not ok. I should have freedom over my own body,” she said. She views Harris as a protector of hard-fought “freedoms” from abortion access to LGBTQ+ rights. Seated in the front row behind the stage, Tiffany Hiza, 48, and her mother Joyce Hiza, 80, wore green shirts touting their Jamaican ancestry, which they’re proud to share with Harris. Being a Democrat in Texas can feel like “swimming against the tide,” Tiffany Hiza said. She and her mother voted on the first day of early voting this week for Harris, a poignant moment for her mother, who had come to fear she might never see a woman president after Hillary Clinton lost in 2016. In the final stretch, they’ve tuned out the polls and the analysis. Both said they feel sanguine about Harris’s chances. Donald Trump’s rally in Traverse City, Michigan – originally scheduled for 7:30pm ET – has been postponed several hours following the ex-president’s interview with podcast host Joe Rogan. Trump campaign spokesman Steven Cheung posted on X that the former president’s interview lasted three hours, delaying his departure from Austin. “We’re coming now, Michigan!” Cheung wrote. He posted the message at 7:19 pm ET. The Upper Michigan Source reported that Trump is now expected to arrive in the state around 10:30pm ET. During his rally in Scranton tonight, Tim Walz took a moment to express his appreciation for Joe Biden, who was born in the Pennsylvania city and remains a popular figure there. “This country owes a huge debt to you and a huge debt to Joe Biden,” Walz said. “[Presidents] have always put this country above themselves, no matter the cost to their personal ambitions or what happened to them. Joe Biden has secured his place in history by upholding that tradition.” The Scranton crowd erupted into cheers of “Joe!” as Walz spoke. Michael McNulty, a 47-year-old voter from Scranton, lives down the street from Biden’s childhood home and expressed gratitude for the president but said he felt invigorated by the Harris-Walz ticket. “I think there’s a real sense of optimism and hope here. It’s not just against Trump,” McNulty, wearing a Harris-Walz camo hat, said after the Scranton rally. “They’re sharing a vision for the future of the country that is one I want to live in. It’s one that I want to raise my children in and that I’m really proud to go out and contribute to make happen.” Biden won Pennsylvania by 1.2 points in 2020, four years after Trump carried the state by 0.7 points. Although polls show a tied race, McNulty is confident that Harris will win the Keystone State this time around. “We’re going to push this over the finish line here for the Harris-Walz ticket,” he said. “PA is going to deliver, and we’re going to have Madame President.” Thousands of fans waited for hours to attend Kamala Harris’s event in Houston. Inside Shell Energy stadium, the crowd buzzed in anticipation of a performance by Beyoncé in her native Houston. Lots of cowboy boots and cowboy hats. Some wore shirts that said “My president is a Black Woman”. One man wore a sequined white blazer over a “comma la” T-shirt. It’s been decades since a Democratic presidential nominee stopped in the Lone Star state this close to Election Day and the Democrats here are ecstatic to be on the receiving end of some political love. The DJ just encouraged the crowd to let loose. “It’s your American right,” he said. The fifth circuit court of appeals ruled today that Mississippi violated federal law by counting mail ballots that are postmarked by election day, but arrive after that. The ruling, which was issued by a panel of three judges, does not require the state to make any changes before the election. The court’s decision is a victory for the Republican National Committee, which brought the lawsuit, and a loss for Democrats and voting rights advocates, who worry the case will impact other states. Although the court’s ruling is only binding in three states under the fifth circuit’s jurisdiction (and not in effect for the current election), Democrats fear the decision could impact the outcome of elections in other states that allow ballots to be counted after election day – such as Nevada, Ohio, Virginia and Maryland – especially if the election is contested. Eight Washington Post columnists have issued a response to their paper’s decision not to endorse a presidential candidate. “An independent newspaper might someday choose to back away from making presidential endorsements. But this isn’t the right moment, when one candidate is advocating positions that directly threaten freedom of the press and the values of the Constitution,” they write. The letter’s signatories include Perry Bacon Jr, EJ Dionne Jr, David Ignatius, Ruth Marcus, Dana Milbank, Eugene Robinson, Jennifer Rubin and Karen Tumulty. A San Antonio election clerk was assaulted at a polling site yesterday – in what is believed to be the first instance of violence against an election worker this fall, The Texas Tribune reports. The suspect has been arrested on suspicion of injury to an elderly person, a felony. According to a Bexar County sheriff’s report, the suspect, 63-year-old Jesse Lutzenberger, entered the polling location wearing a Make America Great Again hat. Displaying political slogans in polling sites is considered electioneering. The poll worker asked Lutzenberger to remove his hat and Lutzenberger proceeded to vote, but put the hat back on after. As the poll worker escorted Lutzenberger out of the building (after he cast his ballot), Sheriff Javier Salazar said a surveillance video showed Lutzenberger throw “several punches right at the face of the victim.” The poll worker received emergency medical treatment and Lutzenberger was booked into jail before being released on a $30,000 bond today. “This has been an especially contentious elections cycle,” Salazar said at a Friday briefing. “We’ve had several incidents where people show up wearing inappropriate clothing,” that qualifies as electioneering. Tim Walz is currently campaigning in Joe Biden’s hometown of Scranton, Pennsylvania. The vice presidential nominee has praised Biden, saying “This country owes a huge debt to you and a huge debt to Joe Biden.” Current Guardian polling shows Harris leading Trump by less than a point in the crucial swing state. Meanwhile, former president Barack Obama is in North Carolina campaigning for Kamala Harris. The Democratic Party has not won the swing state since 2008, when Obama was elected president. Our polling shows Harris trailing Trump by two points in the Tar Heel state. Another top Democrat is calling for an investigation into Elon Musk – this time for the tech billionaire’s ties to Russia. Rep. Adam Smith, the ranking Democrat on the House Armed Services Committee, has called for the defense department to investigate a report that Musk has been in regular contact with Russian President Vladimir Putin, Politico reports. “We should investigate what Elon Musk is up to to make sure that it is not to the detriment of the national security of the United States,” Smith said. Senator Jeanne Shaheen, a senior member of the Senate Foreign Relations Committee and Armed Services Committee, echoed Smith. “Elon Musk—who has billions in contracts that support some of our most sensitive military operations—reportedly has an open line to Putin,” Shaheen said. Musk’s spacecraft company SpaceX has multiple contracts with the defense department and NASA. According to a Wall Street Journal report published yesterday, the billionaire has had previously unreported discussions with Putin since 2022. Musk has been one of Donald Trump’s greatest supporters this election cycle, donating $118m to his pro-Trump super Pac. Trumphas long been a vocal admirer of Putin’s. After concluding his remarks in Austin this afternoon, Donald Trump spoke with executives from Blue Origin, the aerospace company owned by Jeff Bezos. Bezos, the billionaire founder of Amazon, also owns the Washington Post, which announced today that it wouldn’t endorse a candidate for president. The Washington Post Guild, the union that represents many of the paper’s staffers, said that according to the paper’s reporters and Guild members, the endorsement for Harris was already drafted and the decision not to publish was made by Bezos himself. According to the Associated Press, Trump spoke briefly with Blue Origin’s CEO, David Limp, and vice-president of government relations, Megan Mitchell, as he left a hangar where he spoke to supporters and journalists at the Austin airport. Here’s more from the Guardian’s Anna Betts: Although Donald Trump refused to appear in a CNN townhall alongside Kamala Harrris this week, his running mate JD Vance will appear on the network this weekend. The vice presidential nominee will appear on CNN’s State of the Union with Jake Tapper and Dana Bash, alongside former Wyoming congresswoman Liz Cheney, a longtime Republican who has endorsed Harris. Kamala Harris is expected to discuss the “fundamental fight for the freedom of women to make decisions about their own body” at her Houston rally this evening. She’ll appear alongside families that have been affected by abortion bans like Texas’ – including Amanda and Josh Zurawski, a Texas couple who sued the state after Amanda was unable to access treatment for a life-threatening pregnancy complication, and Shanette Williams, the mother of Amber Nicole Thurman, a Georgia mother who died from an infection she feared seeking treatment for under the state’s restrictive laws. “Sadly, the elected leaders of Texas, a lot of them, have made Texas ground zero in this fundamental fight for the freedom of women to make decisions about their own body,” Harris told reporters earlier today. “This is not just some theoretical concept. Real harm has occurred in our country, a real suffering has occurred. People have died.” At a rally in Austin earlier today, Donald Trump said Harris was only campaigning in Texas in order to “rub shoulders with woke celebrities.” Excerpts of Harris’ prepared remarks show that the vice-president also intends to criticize Texas attorney general Ken Paxton (who sued the federal government “so that Texas prosecutors can get their hands on the private medical records of women who leave the state to get care”) and Trump (“Donald Trump won’t let anyone see his medical records. But these guys want to get their hands on yours?”). Harris is also expected to argue that no state will be safe if Trump is re-elected and imposes a nationwide abortion ban – a policy Trump has fluctuated on despite nominating three of the conservative supreme court justices who ruled to overturn Roe v Wade. “What happens in this election will determine the future of reproductive freedom for generations to come,” Harris is expected to say. Two Senate Democrats have written a letter urging the justice department to investigate, and if necessary prosecute, Elon Musk over his potentially illegal $1m giveaway for registered voters. On Wednesday, the justice department sent a letter to Musk’s America Super Pac warning that a $1m-a-day sweepstake the billionaire and Tesla CEO began last week may violate federal elections law. Despite the warning, Musk has continued the giveaway, naming two winners yesterday. In their letter to the attorney general, Merrick Garland, Vermont senator Peter Welch and Connecticut senator Richard Blumenthal urge that the justice department to hold Musk accountable: “Permitting this scheme to proceed without consequences makes a mockery of democracy and the law,” the senators wrote in a letter first obtained by CNN. “We urge you to investigate whether Elon Musk’s cash prizes are prohibited payments for voter registration and take appropriate enforcement action, including prosecution, if his actions prove to be illegal.” Musk, who has endorsed Trump, has donated more than $118m to his pro-Trump political action committee and has recently begun campaigning for the ex-president in person. Kamala Harris’s rally this evening with superstar singer Beyoncé will be far from her last appearance alongside a celebrity musician. On Monday, Harris and her running mate, Tim Walz, will campaign in Ann Arbor, Michigan, with singer-songwriter Maggie Rogers. Then, on Wednesday, Harris will rally voters at the University of Wisconsin, Madison, alongside performances by Mumford &amp; Sons, two members of the band the National, Gracie Abrams and Remi Wolf. The performances come in the final days of a high-stakes election season, as both Democrats and Republicans urge voters to get out to the polls. In an appearance on the Cats &amp; Cosby podcast, a conservative talk radio show, Donald Trump said special counsel Jack Smith should be deported. Trump made news yesterday when he said he would fire Smith, the justice department official who is prosecuting him for allegedly plotting to overturn the 2020 election and hide classified documents, “within two seconds” of becoming president. The Guardian’s Hugo Lowell has more: Thirteen “lifelong Republican” former Trump administration staffers released a letter today echoing former Trump chief of staff John Kelly’s warnings about the ex-president’s authoritarian tendencies. Here’s Joanna Walters with more: A fresh group of “lifelong Republican” former aides to Donald Trump added their voices on Friday to the chorus of criticism of the Republican nominee’s character and fitness for the White House, speaking out in support of John Kelly, who earlier this week called his old boss a fascist. “The revelations General Kelly brought forward are disturbing and shocking. But because we know Trump and have worked for and alongside him, we were sadly not surprised by what General Kelly had to say,” a letter from more than a dozen staffers who worked in Trump’s administration says, as first reported by Politico. Here’s a look at where things stand: Chinese hackers have targeted phones used by Donald Trump and JD Vance, the New York Times reported on Friday, citing people familiar with the matter. According to the sources, investigators are trying to determine what communication data may have been taken or observed. On Friday, Joe Biden formally apologized for the United States government’s role in running at least 523 Indian boarding schools. His remarks were given at the Gila Crossing community school outside Phoenix, Arizona, and marked his first visit to Indian Country as president. The new publisher of the Washington Post, controversial British journalist Will Lewis, squashed the paper’s plans to endorse Kamala Harris for the White House in this election, according to a report. The Columbia Journalism Review has just published an article saying that senior figures at the Post had been preparing to publish the announcement that the Post was endorsing Harris, the Democratic nominee for president – but there were delays. Senior Democratic figure Susan Rice, who was US ambassador to the United Nations and national security adviser under Barack Obama and then director of the US domestic policy council under Joe Biden, has made a blistering post on X about the Washington Post. “So much for ‘Democracy Dies in Darkness’,” she said, referring to the newspaper’s slogan. Joe Biden has formally apologized for the US government’s role in running more than 500 Indian boarding schools. The Guardian’s Adria R Walker reports: On Friday, Joe Biden formally apologized for the United States government’s role in running at least 523 Indian boarding schools. His remarks were given at the Gila Crossing community school outside Phoenix, Arizona, and marked his first visit to Indian Country as president. “After 150 years, the United States government eventually stopped the program,” Biden said. “But the federal government has never, never formally apologized for what happened – until today. I formally apologize, as president of the United States of America, for what we did. I formally apologize. That’s long overdue.” “Federal Indian boarding school policy, the pain it has caused, will always be a significant mark of shame, a blot on American history,” he said. “For too long, this all happened with virtually no public attention.” For the full story, click here: Chinese hackers have targeted phones used by Donald Trump and JD Vance, the New York Times reported on Friday, citing people familiar with the matter. According to the sources, investigators are trying to determine what communication data may have been taken or observed. They added that Trump’s and Vance’s teams have been alerted this week and that the two men were “among a number of people inside and outside the government whose phone numbers had been targeted through the infiltration of Verizon phone systems”, the New York Times reports. It added that Trump campaign spokesperson Steven Cheung did not directly address whether the phones used by Trump and Vance have been targeted. The outlet did however report that Cheung blamed the Biden-Harris administration for allowing a foreign adversary to target the campaign. In August, the FBI said that Iranian hackers targeted the Trump campaign and sent documents to the Biden campaign. Iran’s efforts include “thefts and disclosures” and “are intended to influence the US election process”, a joint statement by the FBI, the office of the director of national intelligence and the Cybersecurity and Infrastructure Security Agency said at the time. Joining Donald Trump on stage was Alexis Nungaray, the mother of 12-year old Jocelyn, who was murdered earlier this summer. The people accused of killing Jocelyn are Franklin Pena and Johan Jose Martinez Rangel, two undocumented men from Venezuela. Addressing the crowd, Nungaray said: She was just being a child and due to the Biden-Harris policies we have here are why she’s not here any more. She was taken from her vulnerability and they made her a target, and ran with that and now I will for ever be a grieving mother and my son will for ever be a grieving brother who will no longer get to grow up with his sister. Kamala Harris has never reached out to me, just even as a human to give her condolences as a humane person running this country. I think it’s very sad that she can’t even just give me an open apology, sincere apology. She’s attempted to apologize to me just days before this election. I find it very inconvenient and convenient for her. I appreciate everything Donald Trump and Senator Ted Cruz have done for me. They’ve been a tremendous amount of help for me and my family during this incredibly hard, hard journey. Donald Trump has taken the stage at a campaign rally in Austin, Texas. Addressing the latest decision from a federal judge that Virginia must restore voter eligibility to more than 1,600 people after their eligibility was illegally removed, Trump said: The outrageous decision goes against the very bedrock of our democracy. Trump, who has also falsely claimed that the 2020 election was stolen from him, called the decision “blatantly non-American, it’s election interference”, and went on to baselessly accuse Kamala Harris of being “behind it”. Kamala Harris is talking to reporters in Houston, in one of her new, impromptu quick comments on camera at short notice and willingness to take questions on the hop. She has just criticized Donald Trump for his comments on the campaign trail last night when he called the country a “garbage can” because of immigration policies under the Biden administration. “It’s just another example of how he really belittles our country,” Harris said. The Democratic nominee for president is standing against a backdrop of American flags, shortly after arriving in Houston, Texas, which, despite being a strongly Republican-voting state, is a place her campaign thinks is a powerful springboard for a national message. Harris is appearing with Beyoncé and Willy Nelson tonight. Harris continued on about Trump, the Republican nominee, about him enjoying a bully pulpit. “And this is how he uses it? To tell the rest of the world that the United States is trash?” she said. She said it was not how the president of the United States should behave. Asked whether she has voted yet, she said no, not yet. Asked if she could get pro-choice legislation through Congress to restore the rights of Roe v Wade – taken away by a US supreme court stacked by Trump to the right – she pointed out, revealingly, that if Democratic candidate Colin Allred can unseat GOP Senator Ted Cruz in Texas, it will boost her party’s hopes of keeping control of the US Senate, which is crucial to pass legislation. The new publisher of the Washington Post, controversial British journalist Will Lewis, squashed the paper’s plans to endorse Kamala Harris for the White House in this election, according to a report. The Columbia Journalism Review has just published an article saying that senior figures at the Post, including in the opinion section and on the board, had been preparing to publish the announcement that the Post was endorsing Harris, the Democratic nominee for president – but there were delays. Then earlier today, the publication announced it would not endorse either Harris or her Republican rival Donald Trump – and that the plan to back Harris had been reversed by Lewis. It quoted a democracy expert, Ian Bassin, from a previous CJR article calling the decision by the Post – and also this week by the Los Angeles Times, which is also owned by a billionaire – not to endorse “anticipatory obedience” in trying to appease Donald Trump in case he wins. Trump has called the mainstream media “the enemy of the people”. Senior Democratic figure Susan Rice, who was US ambassador to the United Nations and national security adviser under Barack Obama and then director of the US domestic policy council under Joe Biden, has made a blistering post on X about the Washington Post. “So much for ‘Democracy Dies in Darkness’,” she said, referring to the newspaper’s slogan. She continued: “This is the most hypocritical, chicken shit move from a publication that is supposed to hold people in power to account.” There is welling disquiet over the Washington Post’s announcement that it will decline to endorse either Kamala Harris or Donald Trump in this election. A former long-serving senior editor from the paper called it “appalling”, especially “given the choice this year”. Robert McCartney has previously speculated that the Post would endorse Harris and also had heard on the grapevine that they would dodge. Here’s his reaction on X now: McCartney had posted yesterday: “There’s speculation in newsroom that owner Jeff Bezos may want to avoid risk of endangering Amazon’s government contracts if Trump wins.” Publisher Will Lewis was a controversial choice by Bezos at the Post, which the Amazon mogul owns. A British police special enquiry team is examining allegations that Lewis presided over the deliberate destruction of emails at Rupert Murdoch’s UK newspaper business when he worked for the company 13 years ago. Sally Buzbee, the editor who took over from Marty Baron, was forced out last year in a move instigated by Lewis, who wanted to replace her with fellow Brit Robert Winnett, but he shortly after backed out amid uproar at the Post. Marty Baron, the distinguished former editor of the Washington Post, has excoriated his old employer’s decision not to endorse either Kamala Harris or Donald Trump in next month’s presidential election. Baron, who was editor of the Boston Globe before he moved to the capital to run the Post in 2013 – both of which publications have won Pulitzer prizes under his leadership – has called the Post’s move to avoid picking a favored nominee for the White House “cowardice”. He posted on X that it represented: “Disturbing spinelessness at an institution famed for courage.” Baron retired from the Washington Post in 2021. You can read the Guardian’s profile of him then, here. As Tim Walz prepares to take the stage in Philadephia for a campaign rally event, here’s a look at where things stand in the world of US politics: For the first time since the 1980s, the Washington Post has said it will not endorse any US presidential candidate this year nor in any future presidential elections. A note from publisher Will Lewis that was posted on X on Friday said: “We recognize that this will be read in a range of ways, including as a tacit endorsement of one candidate, or as a condemnation of another, or as an abdication of responsibility. That is inevitable. We don’t see it that way.” Kamala Harris and Donald Trump are tied at 48%, according to a new poll by the New York Times and Siena College. Published on Friday, the poll also revealed that 31% of registered voters view Trump as very favorable while 29% view Harris as very favorable. More young Americans favor Kamala Harris over Donald Trump in the 2024 presidential race, according to a new Harvard Youth Poll published today by the Institute of Politics at Harvard Kennedy School. The poll, which surveyed 2,001 voters under the age of 30 between 3 and 14 October, found that Harris leads Trump by 20 points among registered voters under 30 and by 28 points among likely voters. Joe Biden has issued a statement ahead of his presidential apology for the federal Indian boarding school era, calling it “one of the darkest chapters of American history”. In his statement, Biden said: “The Federal Indian Boarding School Era is one of the darkest chapters of American history. The trauma experienced in those institutions haunts our conscience to this very day.” Jill Biden is set to campaign alongside Gwen Walz in Michigan and Wisconsin next week. In a press release issued on Friday, the Harris-Walz campaign said that the two educators will campaign in Michigan and Wisconsin, marking the first time they campaign together. With just a few days away from the election, Kamala Harris’s campaign continues to raise significantly more funds than Donald Trump’s. In the first half of October, Harris’s campaign reported $97m raised, according to reports filed on Thursday with the Federal Election Commission, Politico reports. Meanwhile, Trump’s campaign raised $16m during this time period. Kamala Harris and Donald Trump are taking a detour from barnstorming the battleground states that will decide November’s election with Friday stops in Texas, a conservative state that was the first to implement a near-total abortion ban. Superstar singer Beyoncé is expected to join Harris at her Houston stop and perform, two sources told Reuters. Harris has made Beyoncé’s song Freedom her campaign anthem. For the first time since the 1980s, the Washington Post has said it will not endorse any US presidential candidate this year nor in any future presidential elections. A note from publisher Will Lewis that was posted on X on Friday said: We recognize that this will be read in a range of ways, including as a tacit endorsement of one candidate, or as a condemnation of another, or as an abdication of responsibility. That is inevitable. We don’t see it that way. We see it as consistent with the values The Post has always stood for and what we hope for in a leader: character and courage in service to the American ethic, veneration for the rule of law, and respect for human freedom in all its aspects. We also see it as a statement in support of our readers’ ability to make up their own minds on this, the most consequential of American decisions – whom to vote for as the next president. Our job at The Washington Post is to provide through the newsroom non-partisan news for all Americans, and thought-provoking, reported views from our opinion team to help our readers make up their own minds. Most of all, our job as the newspaper of the capital city of the most important country in the world is to be independent. And that is what we are and will be. Kamala Harris has released the following statement to mark one year since the Lewiston shootings in Maine when 18 people were killed and another 13 were injured by a gunman who stormed a bowling alley and a restaurant: One year ago, an act of senseless violence carried out with a weapon of war took the lives of 18 loved ones and injured 13 others in Lewiston, Maine. Doug and I join all Mainers in remembering those who lost their lives on that fall night, standing with their families, and thinking of the survivors of this horrific mass shooting. In the 12 months since this tragedy took place at a local restaurant and a bowling alley, the Lewiston community has shown incredible unity, resilience and strength. They have responded by reminding the nation of the unacceptable fact that far too many families have experienced the tremendous pain and trauma caused by the epidemic of gun violence. This is exactly why I have worked to take action to address this issue with the urgency it demands and keep our loved ones safe … I continue to call on Congress to pass universal background checks, red flag and safe storage laws, a ban on bump stocks, and a renewal of the assault weapons ban. In a new tweet on Friday, Kamala Harris warned of Donald Trump’s threats of using the justice department against his enemies, saying: Donald Trump has been very clear that he would weaponize the Department of Justice against his political enemies. You know who does that? Dictators do that. More young Americans favor Kamala Harris over Donald Trump in the 2024 presidential race, according to a new Harvard Youth Poll published today by the Institute of Politics (IOP) at Harvard Kennedy School. The poll, which surveyed 2,001 voters under the age of 30 between 3 and 14 October, found that Harris leads Trump by 20 points among registered voters under 30 and by 28 points among likely voters. In the seven key swing states, Harris’s lead narrows to 9 points among registered voters under 30. Interestingly, the survey found that peer influence might play a crucial role in voter turnout for those under 30. When young Americans believe their friends will vote, 79% say they plan to vote as well, per the survey, compared with just 35% for those who think peers will not participate. “The social dynamic of youth voting has never been more clear: when young Americans believe their friends will vote, they’re nearly two and a half times more likely to cast a ballot themselves,” John Della Volpe, the polling director of the Institute of Politics, said in a statement. “It’s peer influence, not just politics, that could determine youth turnout this year – and ultimately who becomes the next president.” Here is the live stream of Tim Walz’s campaign event in Philadelphia: Stay tuned as we bring you the latest updates. Tim Walz is scheduled to attend a campaign rally in Philadephia later this morning. The vice-presidential candidate’s visit to the City of Brotherly Love comes as part of his campaign stops across Pennsylvania, which will also include Allentown and Scranton. Ahead of his Philadelphia rally, Walz spoke to Philadephia-based radio station WHYY on which he said: Donald Trump’s tendencies now are fascist tendencies, he has a long history of his racial comments. His running mate, JD Vance, said voters just don’t like the racist part of Donald Trump. Walz’s comments about Trump follow a slew of similar comments made by Democrats and former Trump allies in recent days who have likened the former president to a fascist. The ongoing elections in Ohio could decide control of the US Senate. Stephen Starr reports for the Guardian: When the Democrat Sherrod Brown was first elected to the US Senate in 2006, Ohio, with its large urban populations and manufacturing industries, was fairly reliable territory for Democrats. Barack Obama claimed the state in 2008 and 2012 on his way to the White House. Democrats boasted strong representation in Ohio’s politics. Analysts zealously watched its voting patterns, such was its prominence as a bellwether state. In the years since, the state has become older, whiter and more conservative. Manufacturing has shrunk and population has stagnated. Brown is now the only Democrat holding a statewide seat in Ohio. And he is weeks out from a crucial Senate election against former luxury car dealer Bernie Moreno, a contest that could reshape US politics for years to come, For one, keeping Brown’s seat is crucial if Democrats hope to maintain their control of the US Senate. For the full story, click here: Joe Biden has issued a statement ahead of his presidential apology for the federal Indian boarding school era, calling it “one of the darkest chapters of American history”. In his statement, Biden said: The Federal Indian Boarding School Era is one of the darkest chapters of American history. The trauma experienced in those institutions haunts our conscience to this very day. Today, I’m in Arizona to issue a long overdue presidential apology for this era – and speak to how my Administration has worked to invest in Indian Country and our relationships with Tribal Nations, advance Tribal sovereignty and self-determination, respect Native cultures, and protect Indigenous sacred sites. On my watch, we’ll remain committed to ushering in a new era between our government and nation-to-nation relationships – one that is grounded in dignity and respect. We must remember our full history, even when it’s painful. That’s what great nations do. And we are a great nation. Jill Biden is set to campaign alongside Gwen Walz in Michigan and Wisconsin next week. In a press release issued on Friday, the Harris-Walz campaign said that the two educators will campaign in Michigan and Wisconsin, marking the first time they campaign together. In Bay City, Michigan, they will attend a Women for Harris-Walz event which will focus on reproductive freedoms. In Traverse City, Michigan, the two women will join Harris-Walz campaign supporters for a volunteer mobilization event. In La Crosse, Wisconsin, they will attend an Educators for Harris-Walz event. Former model Stacey Williams says Donald Trump and Jeffrey Epstein ‘coordinated’ the groping incident at Trump Towers in 1993. The Guardian’s Jessica Glenza reports: Former model Stacey Williams said she thought Donald Trump groped her to show off to her then boyfriend, the late financier and sexual abuser Jeffrey Epstein, when the couple dropped by to visit him in Trump Tower in New York in 1993. In her first detailed, on-camera interview since discussing assault allegations with the Guardian, Williams late on Thursday told CNN that she recalled the former president and Epstein smiled at each other as the property mogul was feeling her up, which gave her the impression the entire incident was a “coordinated” game between the two men. Her account comes just weeks before the presidential election, in which Trump and Democratic nominee Kamala Harris are essentially tied, according to polls. Trump has denied Williams’s accounts. “The second he was in front of me, he pulled me into him and his hands were just on me and didn’t come off,” Williams told CNN, echoing her account to the Guardian. “Then the hands started moving on the side of my breasts, on my hips, back down to my butt, back up, sort of – they were just on me the whole time, and I froze,” she said. For the full story, click here: With just a few days away from election day, Kamala Harris’s campaign continues to raise significantly more funds than Donald Trump’s campaign. In the first half of October, Harris’s campaign reported $97m raised, according to reports filed on Thursday with the Federal Election Commission, Politico reports. Meanwhile, Trump’s campaign raised $16m during this time period. The outlet reports: The picture looked slightly better for Trump when looking at his overall political operation, including money raised through joint fundraising committees, but Harris still maintained a significant advantage, with $176 million raised across her network compared to $97 million for Trump when including his affiliated fundraising groups.” It also added that in the first 16 days of October, Harris’s campaign outspent Trump’s campaign significantly – $166m compared with $99m. For both candidates, paid media was the largest category, with Harris’s campaign spending $127m and Trump’s campaign spending $88m. Kamala Harris and Donald Trump are tied at 48%, according to a new poll by the New York Times and Siena College. Published on Friday, the poll, the poll also revealed that 31% of registered voters view Trump as very favorable while 29% view Harris as very favorable. Ms Harris’s position, if anything, may have declined among likely voters since the last Times/Siena College poll, taken in early October. At the time, she had a slight lead over Mr Trump, 49 percent to 46 percent. The change is within the margin of error, but The Times’s national polling average has registered a tightening in polls over the past few weeks as well, suggesting at the very least that this contest has drawn even closer. In response to which candidate would do a better job of handling the issue voters regard as most important, 46% said Harris while 49% said Trump. Additionally, 45% said they believe Harris would do a better job on the economy, compared to 52% who indicated their preference for Trump. On abortion, 55% indicated Harris as the candidate who would do a better job to address the issue, compared to 40% who chose Trump. On immigration, 43% chose Harris while 54% chose Trump. Speaking on CNN in response to what she thinks Kamala Harris needs to do to avoid repeating the 2016 loss to Donald Trump, Hillary Clinton said: “I don’t think she has Jim Comey in the wings waiting to kneecap her so that’s good.” Clinton made the comment in reference to then-FBI director who reopened the investigation into her private email server days before the 2016 election. Clinton went on to add: “I think she is doing what she needs to do, and…a number of the voters who were at [the CNN] town hall have said she convinced them, that she had shown the kind of empathy and concern about their problems, that she had come forward with her ideas, her suggested policies. So, I think she’s doing what she needs to do.” Kamala Harris and Donald Trump are taking a detour from barnstorming the battleground states that will decide November’s election with Friday stops in Texas, a conservative state that was the first to implement a near-total abortion ban. Superstar singer Beyoncé is expected to join Harris at her Houston stop and perform, two sources told Reuters. Harris has made Beyoncé’s song “Freedom” her campaign anthem. Texas hasn’t backed a Democratic president since 1976, and Republican Trump is almost certain to win the state’s 40 electoral college votes, Reuters reported. But Democrats are betting it will provide a powerful backdrop for vice-president Harris to talk about abortion rights in the final days before the election. Harris will speak about the danger former president Trump and Republicans could present to abortion rights across the country if he’s elected, a campaign source said, and be joined by women who have suffered after Texas’ anti-abortion regulations were passed and their family members. Texas implemented a first-of-its kind law in September 2021 that banned abortion after six weeks and allowed anyone to sue abortion patients in violation and those who assisted them. A former model has said Donald Trump and the late sexual abuser Jeffrey Epstein were “looking at each other and smiling” while the former president groped her body. Stacey Williams accused the former president of groping and sexually touching her in an incident in Trump Tower in 1993, in what she believed was a “twisted game” between the two men. Williams, who worked as a professional model in the 1990s, said she first met Trump in 1992 at a Christmas party after being introduced to him by Epstein, who she believed was a good friend of the then New York real estate developer. Williams said Epstein was interested in her and the two casually dated for a period of a few months. Speaking to CNN yesterday, she said Trump greeted them outside his office: The second he was in front of me, he pulled me into him, and his hands were just on me and didn’t come off. And then the hands started moving, and they were on the, you know, on the side of my breasts, on my hips, back down to my butt, back up, sort of then, you know – they were just on me the whole time. And I froze. I couldn’t understand what was going on. I think I probably was trying to smile and go through the motions of being engaged the way you would in a social situation. But it was an out of body experience. So, I don’t know if I spoke, I don’t know if I answered questions, I don’t know. It was one of the strangest moments of my life. More than 80 Nobel prize winners have endorsed Kamala Harris for the presidency, warning that Donald Trump would “jeopardize any advancements in our standards of living” given his earlier proposals for enormous cuts to science funding. In an open letter, a copy of which was obtained by The New York Times, 82 Nobel prize winners from the US in the fields of physics, chemistry, economics and medicine, said “this is the most consequential presidential election in a long time, perhaps ever, for the future of science and the United States”. The letter, which commends Harris for recognizing that “the enormous increases in living standards and life expectancies over the past two centuries are largely the result of advances in science and technology”, called Trump a potential threat to progress who could “jeopardize any advancements in our standards of living and impede our responses to climate change”. The Nobel laureates range from a physicist involved in the discovery of remnant light from the Big Bang, to an immunologist instrumental in the development of a specific type of Covid-19 vaccine. They include signatories who won Nobels this month such as molecular biologist Gary Ruvkun, chemist David Baker, physicist John Hopfield and economist Daron Acemoglu. Donald Trump, campaigning in the border swing state of Arizona on Thursday, called the country a “garbage can” because of immigration policies under the Biden administration. “We’re like a garbage can, you know, it’s the first time I’ve ever said that,” Trump said in Tempe, Arizona, the home of Arizona State University. “And every time I come up and talk about what they’ve done to our country, I get angry. First time I’ve ever said garbage can, but you know what, it’s a very accurate description.” Candidates and their surrogates for both presidential campaigns are blitzing swing states like Arizona in the final two weeks before election day. The Republican vice-presidential candidate JD Vance held two campaign rallies in Arizona earlier this week. Joe Biden and the former president Barack Obama are set to visit this week, as is Tim Walz, the Democratic vice-presidential pick. A banner behind the stage said, “Vote early!” – a change in strategy for Republicans and Trump, who have cast doubt on early and mail-in voting by falsely claiming it is an avenue for widespread fraud. He said of Arizona voting: “They got a problem. Gotta make it too big to rig.” An image of Trump, raised fist and bloodied ear after his assassination attempt in Butler, Pennsylvania, showed before he came out. Early on, he displayed on screens behind him the chart of migration that he has attributed with saving his life. Democratic candidate Kamala Harris and Republican Donald Trump are tied at 48% each for the popular vote for the US presidential election, according to the final New York Times/Siena College national poll published on Friday. Kamala Harris and Barack Obama shared the stage at her Georgia rally on Thursday night. Our video editors have put together this clip from the event: Bruce Springsteen urged voters to back Kamala Harris in the presidential election, warning that Donald Trump is a would-be “tyrant”. “I want a president who reveres the constitution, who does not threaten but wants to protect and guide our great democracy, who believes in the rule of law and the peaceful transfer of power, who will fight for a woman’s right to choose, and who wants to create a middle-class economy that will serve all our citizens,” Springsteen said at the Thursday evening rally. The rally at James R Hallford Stadium in Clarkston, Georgia, drew about 20,000 people, according to the Democratic nominee’s campaign, which would make it her largest political rally yet, besting the 17,000 Harris drew in Greensboro, North Carolina, in early September. “There is only one candidate in this election who holds those principles dear: Kamala Harris. She’s running to be the 47th president of the United States.” The Born in the USA singer is among the many celebrities stumping for Harris; directors Spike Lee and Tyler Perry, as well as actor Samuel L Jackson, were also in attendance. Good morning and welcome to the US election live blog. I’m Tom Ambrose and I’ll be bringing you all the latest from the campaign trail over the next couple of hours. We start with news that vice-president Kamala Harris appeared with Barack Obama for the first time, offering closing arguments targeting Black voters in Atlanta’s eastern suburbs, a vibrant, symbolic part of Georgia. “Ours is a fight for the future,” Harris said at the rally in Clarkston. She touched on familiar themes – reducing the costs of drugs, housing and groceries. “I come from the middle class, and I will never forget where I come from. Harris said she believes “healthcare should be a right and not just a privilege for those who can afford it”, and said Trump would gut the Affordable Care Act and roll back the $35 cap on insulin. The Democratic nominee also reaffirmed her support for abortion rights, referring to the death of Amber Nicole Thurman, a Georgia woman whose death was recently found to be a result of the state’s abortion ban. Harris said: “Donald Trump still refuses to acknowledge the pain and suffering he has caused … women are being denied care during miscarriages.” For more on the rally, see George Chidi’s full report here: Meanwhile, in other news: The family of Amber Nicole Thurman, a Black 28-year-old mother who died just weeks after Georgia’s abortion ban went into effect, was in attendance at the Harris rally. Harris is expected to make another high profile appearance today, this time alongside Beyoncé in Houston, where the vice-president hopes to rally support for Senate candidate Colin Allred. Donald Trump rallied supporters in Tempe, Arizona, where he spoke alongside Senate candidate Kari Lake. Earlier in the day, Trump made news when he vowed that, if elected, he would immediately fire Jack Smith, the justice department special counsel who is prosecuting him for allegedly plotting to overturn the 2020 election and hide classified documents. Trump called the country a “garbage can” because of immigration policies under the Biden administration. “We’re like a garbage can, you know, it’s the first time I’ve ever said that,” Trump said in Tempe, the home of Arizona State University. “And every time I come up and talk about what they’ve done to our country, I get angry. First time I’ve ever said garbage can, but you know what, it’s a very accurate description.” Phoenix police arrested a man suspected of setting fire to a mailbox there, damaging mail-in ballots. The news comes just days after Tempe police arrested another man in connection with three shootings at Democratic party campaign offices in Tempe. An Arizona prosecutor said the second man had more than 120 guns and more than 250,000 rounds of ammunition in his home, leading law enforcement to believe he may have been planning a mass casualty event. Harris picked up the endorsement of two Republicans, one a former congressman from Michigan, the other a mayor in a pivotal county in Wisconsin. Joe Biden announced he will issue an apology for the US government’s role in forcing thousands of Indigenous American children to attend Indian boarding schools – a policy which has been widely recognized as an element of genocide. The news comes as Harris is trailing in the polls in Arizona, a state that Biden famously won in 2020, largely due to the support of Indigenous American voters. More than 29 million people have voted already in the 2024 election, at least partly driven by Republicans embracing early voting at Donald Trump’s direction. So far, Republicans have cast 32% of ballots, up from 27% at this point in 2020. Whereas Democrats have cast 42% of the votes, down from 47% at this point in the last presidential election.",
        "web_url": "https://www.theguardian.com/us-news/live/2024/oct/25/kamala-harris-donald-trump-us-election-politics-barack-obama",
        "pub_date": "2024-10-26T02:55:06Z",
        "section_name": "US news",
        "tags": [
            "US elections 2024",
            "US politics",
            "Kamala Harris",
            "US news",
            "Donald Trump",
            "Republicans",
            "Democrats",
            "World news",
            "Houston",
            "Texas",
            "Beyoncé",
            "Music",
            "Culture",
            "Gracie Abrams"
        ]
    }
]