[
    {
        "headline": "Kanye West announces he has been diagnosed with autism",
        "trailText": "Rapper and fashion designer says he was misdiagnosed as bipolar in podcast appearance where he also opines on the Drake-Kendrick beef and new album Bully",
        "bodyText": "Kanye West has said he was misdiagnosed with bipolar disorder, and has now been diagnosed as autistic. Speaking to Justin Laboy on his podcast The Download, West, who now goes by the name Ye, said his wife Bianca Censori suggested he get rediagnosed. “I went to this doctor … My wife took me to do that because she said, ‘Something about your personality doesn’t feel like it’s bipolar, I’ve seen bipolar before.’ And I’ve come to find that it’s really a case of autism that I have.” He said the diagnosis helped him better understand some of his behavioural patterns, such as in 2018 when he wore a cap reading Make America Great Again and praised Donald Trump, including saying “the mob can’t make me not love him”. “Autism takes you to a Rain Man thing,” West said. “‘I’ma wear this Trump hat because I like Trump in general.’ And then when people tell you to not do it, you just get on that one point. And that’s my problem. “When fans tell me to do my album a certain way, I’ll do it the opposite way,” he added, and referred to the title of his hit song Can’t Tell Me Nothing. He mentioned his friend and former manager Don C, saying: “It’s been so hard on him because he loves me. It’s so difficult for them, because this is like a grown man – you can’t take control of his bank account, you can’t control what I’m saying on Twitter.” Autism is not a mental illness. But in 2020 Kim Kardashian, then West’s wife, similarly acknowledged the difficulty of managing West’s mental health. “Those that understand mental illness or even compulsive behaviour know that the family is powerless unless the member is a minor. People who are unaware or far removed from this experience can be judgmental and not understand that the individual themselves have to engage in the process of getting help no matter how hard family and friends try.” West himself referred to his diagnosed bipolar disorder in numerous tracks, while the cover of his 2018 album ye features the jokey words: “I hate being Bi-Polar it’s awesome”. West said: “A lot of what was sending me into those episodes … the constant feeling of not being in control spun me out of control,” citing the breakdown of his deal with Adidas, which ended its lucrative collaboration with the musician in 2022 after he made a series of antisemitic remarks. West said he no longer takes medication for his mental health; as autism is not an illness, it is not medicated. “I haven’t taken the medication since I found out that bipolar wasn’t the right diagnosis. It’s finding stuff that doesn’t block the creativity, obviously that’s what I bring to the world. It’s worth the ramp-up, as long as y’all get the creativity.” He said he is watchful for episodes of poor mental health. “I watch for it beforehand – but if you get to the point it goes, you’re going to stay in that position for a while. It might go for three days, four days, a week. Some people if they get into it, you’ve got to put them in a place that’s not in public.” Elsewhere in the interview, West said that his new album Bully would be released on his daughter North West’s birthday, 15 June. He said he has reconciled with Mike Dean, the producer who was one of his chief creative foils and appeared on all of his studio albums until a dispute between the pair meant Dean was not part of West’s two Vultures albums. West said of Bully: “I feel like it is my Miseducation [of Lauryn Hill], my Gnarls Barkley album.” He also said that the White Stripes were a major inspiration for a series of solo tracks, namely how Seven Nation Army would be chanted at football games. “I tried two times to do it: the first time was Black Skinhead. The second time was All Day – Paul McCartney wrote that melody [on his Wings song When the Wind Is Blowing].” West then repeated the chant motif on Carnival, his Vultures I single which topped the US chart in March 2024, making him the only rapper to have a US No 1 in three separate decades. West also offered his thoughts on the beef between Kendrick Lamar and Drake – West and Drake previously had a dispute that ran across a number of tracks and public statements: “I was like: man, [Lamar] killed my nemesis!” West compared Drake to a superhero who “just goes away for a couple of films”, but said that it was only “for now … Drake added something to the algorithm, to our frequency, he advanced us. Future advanced us, now Kendrick has advanced the frequency … if you don’t really learn as a professional rapper, as a sport, what Kendrick is doing, you might be wiped out. “I’m the greatest that ever existed, and other people shouldn’t feel that, because I’m here … But if you’re going to rap against Kendrick, you will lose.” West caused controversy this week after he turned up to the Grammys alongside Censori, the latter wearing a revealing sheer minidress. The outfit was seen as unnecessarily provocative by some, while others suggested it was a form of coercion by West. West himself framed it as a collaboration, writing on X: “We tailored that invisible dress 6 times and just like magic poof we disappeared”, and cited her “rightful strength”. Asked about the couple’s appearance, Raj Kapoor, executive producer of the Grammys acknowledged that the “artistic black tie” dress code at the awards is “open to interpretation”, adding: “Obviously there is a dress code for anybody actually performing on the show that we have to adhere to standards and practices. But as far as people attending and nominees attending, that would be something the Academy would have to answer.”",
        "web_url": "https://www.theguardian.com/music/2025/feb/06/kanye-west-ye-autism-diagnosed",
        "pub_date": "2025-02-06T11:27:48Z",
        "section_name": "Music",
        "tags": [
            "Kanye West",
            "Music",
            "Rap",
            "Culture",
            "US news"
        ]
    },
    {
        "headline": "Kanye West sued and dropped by talent agency over antisemitic slurs",
        "trailText": "Rapper’s fashion brand Yeezy also taken offline by Shopify after he sold T-shirt with swastika design and praised Hitler",
        "bodyText": "Kanye West has been sued and dropped by his talent agency after he posted a stream of antisemitic abuse, put T-shirts with a swastika on sale in his online shop, and was alleged to have described himself as Hitler to a Jewish employee. Last week West, also known as Ye, wrote a barrage of antisemitic posts on X including, “I’m a Nazi … I love Hitler”. The swastika T-shirt was placed for sale on the website of his fashion brand Yeezy, with the product line “HH-01”, assumed to be code for “Heil Hitler”. Shopify, the company that provided the online platform for Yeezy, has now taken the store offline, stating: “All merchants are responsible for following the rules of our platform. This merchant did not engage in authentic commerce practices and violated our terms.” On Monday, the talent agency representing West removed him from their roster. Daniel McCartney of 33 &amp; West wrote in a statement that his working relationship with West was over, “effective immediately … due to his harmful and hateful remarks that myself nor 33 &amp; West can stand for”. On Tuesday, a former staff member for West’s company – anonymised as Jane Doe – filed a lawsuit against him in Los Angeles superior court, alleging wrongful termination, and gender and religious discrimination. The woman, who is Jewish, alleges a series of incidents between January and June 2024, including that he fired her after sending her a text message reading “Hail [sic] Hitler”. Another alleged text message read: “Welcome to the first day of working for Hitler.” The woman’s lawyer, Carney Shegerian, described “a relentless and deliberate campaign of antisemitism and misogyny” from West. West has not commented on the lawsuit, nor the actions of Shopify and 33 &amp; West. The Guardian has contacted his management for comment. Over the weekend, X allowed the antisemitic slurs to remain on its site, but later intervened when West began posting links to pornographic videos on his account. Elon Musk, the owner of X, commented: “Given what he has posted, his account is now classified as NSFW [not safe for work]. You should not be seeing that any more.” West deactivated his X account later that day, writing: “I’m logging out of Twitter. I appreciate Elon for allowing me to vent.” West has made antisemitic remarks for several years. In October 2022, he said he was “going death con 3 on Jewish people … You guys have toyed with me and tried to black ball anyone whoever opposes your agenda.” After widespread condemnation, the sportswear brand Adidas cut ties with him, ending their lucrative partnership on Yeezy-branded trainers. West continued to make antisemitic comments, telling rightwing pundit Alex Jones: “There’s a lot of things that I love about Hitler.” On X, he posted an image of a swastika intertwined with a Star of David. In response, X suspended his account for eight months. The then US president Joe Biden put out a statement shortly after the comments, though without naming West, saying: “The Holocaust happened, Hitler was a demonic figure.” In 2023, West apologised, writing in Hebrew on social media: “I sincerely apologise to the Jewish community … It was not my intention to hurt or demean, and I deeply regret any pain I may have caused.” But at the weekend, West wrote: “I’m never apologising for my Jewish comments … I’m calm as ice this is how I really feel.” Earlier this month, West made a controversial appearance alongside his wife Bianca Censori at the Grammy awards, where he told her to remove her fur coat, revealing a sheer minidress that left her essentially naked. Referring to the stunt, West write on X: “I have dominion over my wife.” The rapper recently told a podcast host he had been diagnosed as autistic, and misdiagnosed with bipolar disorder. He is due to release his next album Bully in the summer. His last two, Vultures 1 and Vultures 2, released in 2024, reached No 1 and No 2 in the US chart respectively.",
        "web_url": "https://www.theguardian.com/music/2025/feb/12/kanye-west-sued-dropped-by-talent-agency-and-retail-platform-over-antisemitic-remarks",
        "pub_date": "2025-02-12T11:54:40Z",
        "section_name": "Music",
        "tags": [
            "Kanye West",
            "Music",
            "Culture",
            "Antisemitism",
            "US news",
            "Rap",
            "Fashion"
        ]
    },
    {
        "headline": "Jimmy Kimmel: ‘Somehow Donald Trump has managed to transform the stock market into Kanye West’",
        "trailText": "Late-night hosts discuss Trump’s escalation of a trade war, including 104% tax on Chinese imports, as markets plunge toward global recession",
        "bodyText": "Late-night hosts recap Donald Trump’s escalation of a trade war that many expect will lead to a global recession. Jimmy Kimmel “What a crazy country we live in. It’s hard to remember what things we used to be worried about,” said Jimmy Kimmel on Tuesday evening, as the markets once again roiled with Trump’s escalation of his tariffs on nearly all countries. “The Dow, the Nasdaq, the S&amp;P all down again today. Somehow Donald Trump has managed to transform the stock market into Kanye West.” Trump, meanwhile, didn’t seem bothered by the worst week on Wall Street since March 2020. Instead, he posted on Truth Social that he would undergo his annual physical examination at Walter Reed medical center on Friday. “I bet it’s going to be an excellent report,” Kimmel deadpanned. “Let me guess: his physical strength and stamina are extraordinary, his blood pressure is astonishing and he is by far the healthiest president to successfully tank the world economy overnight. “I will say, after all he’s put us through, it will be nice to know that on Friday, somebody will be squeezing his balls for a change,” he added. In light of the economic downturn, Kimmel referenced an old quote of Trump, saying: “There’s a lot of opportunity in the bad times.” “And now there’s nothing but opportunity as far as the eye can see,” Kimmel joked. “It’s a Chernobyl of opportunity right now.” On Tuesday, Trump heaped even more tariffs on Chinese imports, effectively a 104% tax on all goods. “How’s he even coming up with these numbers?” Kimmel fumed. “‘What do you think about a tariff of 100% on China? Not enough! Make it 104!’” In response, the Chinese ministry of commerce said the tariffs were “mistake on top of a mistake” – “which is also what Trump said when Eric was born”, Kimmel quipped. Stephen Colbert “The tariffs are already hitting Americans right in the joystick,” said Stephen Colbert on the Late Show. Gamers were supposed to be able to order Nintendo Switch 2 consoles on Wednesday, but now the company has delayed orders to the US because of Trump’s tariffs. “What am I supposed to do without a new Mario game?” Colbert wondered. “Take a bunch of mushrooms and jump on turtles in real life? That’s what got me banned from the petting zoo.” The markets had a brief upturn on Tuesday, when rumors circulated that Trump may back down from his trade war. Asked by reporters if he would back down or if the tariffs were permanent, Trump answered paradoxically: “It could both be true.” “No, you can’t say it’s temporary and it’s permanent,” said Colbert. “That’s like being asked to call heads or tails and saying ‘I call coin.’” But around noon local time on Tuesday, the White House confirmed that they would levy a 104% tariff on all Chinese imports starting at midnight on Tuesday, “and the market stepped on a rake and then stepped down a mineshaft”, said Colbert. “One hundred and four percent Chinese tariffs are going to make everything more expensive – iPhones, laptops, those wonderful knockoff toys you can find only at the gas station like New Style Ninja Tortoise.” As for the Chinese ministry of commerce’s response – “the US threat to escalate tariffs on China is a mistake on top of a mistake” – Colbert had a wisecrack: “Coincidentally, it’s also what it’s called when Don Jr gives Eric a piggyback ride.” Seth Meyers On Tuesday, Trump welcomed the World Series champion Los Angeles Dodgers to the White House, and praised star player Shohei Ohtani with “he’s got a good future, I’m telling you”. “Not exactly a bold prediction – ‘I think that guy who won three MVP awards is going to turn out to be a pretty good ballplayer,’” Seth Meyers joked on Late Night. In other news, Elon Musk and the so-called “department of government efficiency” (Doge) are reportedly working with Boeing to resolve delays in the new model of Air Force One. “Because nothing inspires confidence like hearing ‘Boeing built this in a hurry,’” Meyers joked. On Friday, Trump headlined a fundraiser at Mar-a-Lago that cost $1m a plate. “Unfortunately, due to the price of groceries, they only broke even,” Meyers quipped. And according to a new analysis by the Washington Post, Trump has spent one-third of his days in office at his golf courses. “And I think we might be better off if we could somehow get that up to three thirds,” said Meyers. The Daily Show “It’s been one week since Donald Trump announced his bold vision for destroying the economy,” said Desi Lydic on the Daily Show. “And guess what? His plan is working.” Lydic pointed to a graph of the Dow Jones since Trump took office, which plunged precipitously after the president announced his tariffs. “I’m not an economist, but it’s probably a bad sign when the chart itself looks like it jumped off the roof,” she said. “Look at that drop! Six Flags is going to make a roller coaster of that.” “The president may have singlehandedly tipped us into a global recession,” Lydic continued. “And with so much uncertainty, the world is glued to the financial news networks, who are surely focusing on this story 24/7, right Fox Business?” In fact, Fox’s business network focused on the LA Dodgers visiting the White House, and not Trump’s 104% tax on Chinese imports. “This is getting really serious. We’ll know exactly how serious one we get China to do the math for us,” Lydic joked. “But point is: Trump is out of control right now. I’d say he’s like a bull in a china shop, but at 104%, I can’t afford to say that.”",
        "web_url": "https://www.theguardian.com/culture/2025/apr/09/jimmy-kimmel-trump-tariffs-stock-market",
        "pub_date": "2025-04-09T14:30:14Z",
        "section_name": "Culture",
        "tags": [
            "Late-night TV roundup",
            "Seth Meyers",
            "Jimmy Kimmel",
            "Stephen Colbert",
            "TV comedy",
            "Comedy",
            "Culture",
            "Television & radio",
            "Television",
            "Donald Trump",
            "Trump tariffs",
            "Trump administration",
            "US economy",
            "US news",
            "US politics"
        ]
    },
    {
        "headline": "Scarlett Johansson warns of dangers of AI after Kanye West deepfake goes viral",
        "trailText": "Short film falsely depicts actor and other Jewish celebrities opposing recent antisemitic remarks from pop star",
        "bodyText": "Scarlett Johansson has warned of the “imminent dangers of AI” after a deepfake video of her and other prominent Jewish celebrities opposing recent antisemitic remarks from Kanye West went viral this week. The video contained AI-generated versions of more than a dozen celebrities, including Johansson, David Schwimmer, Jerry Seinfeld, Drake, Adam Sandler, Stephen Spielberg, and Mila Kunis. It opened with a deepfake likeness of Johansson in a T-shirt that was emblazoned with a hand and middle finger extended, a Star of David and the name Kanye. The video was set to an electronic version of “Hava Nagila”, a Jewish folk song that is typically played at celebratory cultural events, and ended with the slogan: “Enough is enough. Join the fight against antisemitism.” Other stars depicted included Sacha Baron Cohen, Jack Black, Natalie Portman, Adam Levine, Ben Stiller and Lenny Kravitz. “It has been brought to my attention by family members and friends, that an AI-generated video featuring my likeness, in response to an antisemitic view, has been circulating online and gaining traction,” Johansson said in a statement to People. “I am a Jewish woman who has no tolerance for antisemitism or hate speech of any kind. But I also firmly believe that the potential for hate speech multiplied by AI is a far greater threat than any one person who takes accountability for it. We must call out the misuse of AI, no matter its messaging, or we risk losing a hold on reality.” West, now known as Ye, repeatedly referred to himself as a “Nazi” and praised Hitler on X before deactivating his account. He also appeared in an advert during the Super Bowl directing people to his website, which started selling only one product – T-shirts with swastikas on them. The site was later taken down by Shopify due to policy violations, while Fox Television Stations CEO, Jack Abernethy, also condemned the ad in a note to staff. Johansson has been one of the most vocal celebrities against the use of non-consensual AI. Last year she threatened legal action against OpenAI after the company used a voice resembling her own in its new ChatGPT product – nine months after she said she turned down the company’s request to voice their AI system. OpenAI eventually removed the heavily promoted voice option from ChatGPT after a widespread reaction. Johansson said she had been “a very public victim of AI, but the truth is that the threat of AI affects each and every one of us”. She added: “There is a 1,000-foot wave coming regarding AI that several progressive countries, not including the United States, have responded to in a responsible manner. It is terrifying that the US government is paralysed when it comes to passing legislation that protects all of its citizens against the imminent dangers of AI.” The actor urged elected officials to take legislative action against AI abuses, calling it a “bipartisan issue that enormously affects the immediate future of humanity at large”. Her comments come as the UK’s Advertising Standards Authority said fake adverts featuring celebrities remain the most common type of scam adverts appearing online. The AI video was created by Ori Bejerano, who describes himself as a generative AI expert on his Instagram bio. His original post included a notice that said the content was “digitally created or altered with AI to seem real”.",
        "web_url": "https://www.theguardian.com/technology/2025/feb/13/scarlett-johansson-ai-kanye-west-deepfake",
        "pub_date": "2025-02-13T17:24:20Z",
        "section_name": "Technology",
        "tags": [
            "Artificial intelligence (AI)",
            "Scarlett Johansson",
            "Film",
            "Culture",
            "Kanye West",
            "Technology",
            "Piracy",
            "Intellectual property",
            "Film industry"
        ]
    },
    {
        "headline": "Irv Gotti, Murder Inc founder and producer of DMX, Ja Rule, Kanye West and others, dies aged 54",
        "trailText": "Def Jam says it is deeply saddened by death of music mogul who ‘reshaped the soundscape of hip-hop and R&amp;B’",
        "bodyText": "Irv Gotti, the chart-topping producer and music label executive who was instrumental in the careers of Ja Rule, Ashanti and DMX as the co-founder of Murder Inc Records, has died at the age of 54. The Grammy winner died on Wednesday in New York City, his family told media, but they did not reveal his cause of death. Gotti’s representatives had confirmed last August he had suffered a “minor stroke” in early 2024, saying at the time: “He’s been successful in making a full recovery.” Def Jam, the record label of which Murder Inc was an imprint, issued a statement on Wednesday night saying it was “deeply saddened” by Gotti’s death. “His contributions at Def Jam, as both an A&amp;R executive and in partnership with Murder Inc, helped pave the way for the next generation of artists and producers, a force that reshaped the soundscape of hip hop and R&amp;B,” it wrote. Gotti was born Irving Lorenzo, one of eight children in a Queens family, in 1970. He rose to prominence as a tastemaker in the 90s, working at Def Jam to break artists including Jay-Z – who christened him Gotti – and DMX. He had an early credit on Jay-Z’s 1996 debut album, featuring as DJ Irv on the track Can I Live. The next year Gotti helped sign DMX to Def Jam before executive producing the rapper’s first album, It’s Dark and Hell Is Hot – a record which debuted at No 1 on the Billboard charts, sold 5m copies worldwide, and immediately established DMX as a major MC. Gotti’s early success led to the formation of his label, named after the early 20th-century New York organised crime group. Murder Inc, which Gotti founded with his brother Chris, released its first album in 1999: Ja Rule’s debut, Venni Vetti Vecci. Like DMX’s debut, Venni Vetti Vecci quickly made Ja Rule a hip-hop star; Gotti executive produced and had a credit on every track. By the early 2000s Gotti’s label was a commercial success, transitioning from a cult hip-hop sound to more mainstream, radio-friendly pop rap. It produced two more smash albums by Ja Rule as well as signing Ashanti and releasing her self-titled debut. This topped the Billboard chartsand won Gotti a Grammy. Gotti collaborated Jennifer Lopez, Eve and Alicia Keys. “People get confused because it sells like pop music,” Gotti told the Guardian in 2002. “But we make black music first and foremost, and all our records is ‘hood first’.” His image was tarnished by Ja Rule’s long-running feud with 50 Cent and a raid in 2003 of his label’s offices by federal agents who suspected it of laundering drug money. Two years later Gotti and his brother were charged with money laundering but they were acquitted of all charges. Amid the controversies, Gotti rebranded Murder Inc as The Inc. In the late 2000s it signed Vanessa Carlton and continued to release albums by Ashanti and the R&amp;B singer Lloyd but the label struggled as artists left and distribution deals fell through. Gotti created BET’s hip-hop anthology television series Tales, as well as having producing credits on several Kanye West tracks. Lyor Cohen, a music entrepreneur who held several executive roles at Def Jam from 1988 to 2004, told the Hollywood Reporter that the label “has lost one of its most creative soldiers who was hip-hop”. “When we were on bended knee, he brought the heat and saved our asses,” Cohen said. “It’s an honor and a privilege to have known him. Irv, you will be missed.”",
        "web_url": "https://www.theguardian.com/music/2025/feb/06/irv-gotti-death-age-54-dmx-producer-murder-inc-founder",
        "pub_date": "2025-02-06T04:53:10Z",
        "section_name": "Music",
        "tags": [
            "Music",
            "Hip-hop",
            "Rap",
            "Culture"
        ]
    },
    {
        "headline": "Kanye West and Adidas end ‘fight’ over decision to drop rapper over antisemitism",
        "trailText": "Adidas chief executive says dispute with rapper ‘belongs to the past’, and that the last of its Yeezy stock will be sold by the end of the year",
        "bodyText": "Adidas says it has reached an amicable agreement with rapper Kanye West to end all legal proceedings between them, without any money being exchanged. The German sportswear giant had been locked in a dispute with the artist, who now goes by the name Ye, since they cut ties in 2022 after allegations of antisemitism against him. “There [aren’t] any more open issues and there is no … money going either way,” the Adidas chief executive, Bjorn Gulden, told reporters on a conference call on Tuesday, without giving any details of the agreement. “There were tensions on many issues [but] ... both parties said we don’t need to fight any more.” The drama with West “belongs to the past”, he added. “When you have conflicts like this, you take provisions and you have legal opinions and there are negotiations and there are settlements being done, and this is the end to it. “No one owes anything to anybody any more. Whatever was is history.” Adidas and West launched a business deal in 2014 after the rapper ended his affiliation with Nike. The partnership was one of the most successful sportswear tie-ups in history and the resulting Yeezy range went on to help make West a billionaire. But when West made a series of antisemitic comments on social media in October 2022, Adidas announced it was ending the partnership, calling his remarks “unacceptable, hateful and dangerous”, adding that it would “not tolerate antisemitism and any other sort of hate speech”. West went on to repeat many of his claims in multiple interviews, and later said his wealth crashed by $2bn in a single day as a consequence as different companies dropped him. Gulden defended West a year later, saying that the rapper’s comments were “very unfortunate, because I don’t think he meant what he said and I don’t think he’s a bad person – it just came across that way”. “That meant we lost that business. One of the most successful collabs in history – very sad,” he told the podcast In Good Company. “But again, when you work with third parties, that could happen. It’s part of the game. That can happen with an athlete, it can happen with an entertainer. It’s part of the business.” Ending the partnership in 2022 left Adidas with unwanted Yeezy stock worth some €1.2bn including shoes and other goods. Adidas has been selling its huge inventory of Yeezy products in batches and donating the proceeds to NGOs, including a foundation launched by the company itself in March to support anti-discrimination initiatives. The remaining Yeezy stocks will be sold by the end of 2024, the company said. Gulden addressed the drama with West as he presented the company’s third-quarter results, already made public earlier in October. Between July and September, Adidas sales totalled €6.4bn (US$7bn), a 7% increase on the same period last year. Adidas said it had increased its financial guidance for the year “to reflect the better-than-expected performance during the quarter and the current brand momentum”. Gulden said the company had managed to boost its sales with other lucrative shoe collections, such as the Samba, Gazelle and Campus ranges. Agence-France Press contributed to this report",
        "web_url": "https://www.theguardian.com/music/2024/oct/30/kanye-west-ye-adidas-legal-settlement-yeezy-range-brand",
        "pub_date": "2024-10-29T23:19:31Z",
        "section_name": "Music",
        "tags": [
            "Kanye West",
            "Music",
            "Culture",
            "Fashion",
            "Antisemitism",
            "Germany",
            "US news"
        ]
    },
    {
        "headline": "‘Somebody’s up there saying: good karma!’ Phil Manzanera on Roxy Music, Cuban grooves and making a fortune off Jay-Z and Kanye West",
        "trailText": "Born into a line of pirates and possible spies, the guitarist went from Castro-era Cuba to art-pop’s greatest group. As his solo work is reissued, he explains why he was too adventurous for his old band",
        "bodyText": "In the booklet that accompanies Phil Manzanera’s career-spanning, 11-CD box set, 50 Years of Music, there is a photocopied page of small ads from a 1971 edition of Melody Maker. In between the news that chart-topping comedy trio the Scaffold need a “sensitive musician” for a university tour, and an unnamed German rock drummer “seeks a good heavy group (no time-wasters)”, lurks an appeal from an “avant-rock group” in search of a guitarist. It says nothing about their sound or their influences, but offers an intriguing set of adjectives: the successful applicant will be “fast, slow, elegant, witty, scary, stable, tricky”. As Manzanera explains, had he not been sufficiently intrigued to apply, “we wouldn’t be sitting here today” – on a video call, with him in his London studio. He didn’t initially get the job with the nascent Roxy Music, but stayed in the band’s orbit. When their first choice didn’t work out, he stepped in, joining something he wryly describes today as less a band than “an art collective experiment, by two different branches of the art world – Brian Eno’s art education, Bryan Ferry’s art education. And I was just a puppet in this sort of art project, which I’m very proud to have been”. Experiment or not, six months later he was on Top of the Pops, miming to Virginia Plain, his eyes hidden behind a vast pair of sunglasses with their lenses entirely covered in diamanté studs. They lent his solos a certain avant garde edge, he says, because he couldn’t really see what he was doing. It’s still the image that springs to mind when you hear Manzanera’s name. But, as 50 Years of Music underlines, he has enjoyed an intriguing parallel career away from Roxy Music – one that takes in everything from working with Pink Floyd and Tim Finn (he first encountered Finn’s band Split Enz while touring Australia in the 70s, and they’ve sporadically collaborated ever since) to his and Brian Eno’s deliberately short-lived mid-70s band 801, to albums filled with psychedelic rock and music inspired by South America. Central and South America are rooted in Manzanera’s youth. He had already led an extraordinary life before he answered Roxy Music’s ad, spending his childhood in Cuba – he can remember sheltering in the bathroom of the family home in Havana as Fidel Castro’s Barbudos revolutionaries fought a gun battle in their back garden – and Hawaii, before being packed off to boarding school in Britain. His mother was Colombian. His father was an Englishman who ostensibly worked for the British Overseas Airways Corporation (BOAC) airline, but circumstantial evidence suggests he was probably a spy (and possibly the model for Wormold, the lead character in Graham Greene’s Our Man in Havana). In fact, Manzanera’s family history was even more exotic than he first realised. When he was 40, his aunt told him that his father was, in fact, the son of a Neapolitan opera singer called Mr Sparano. “She thought I was going to be upset, but I thought it was fantastic, exciting, he wasn’t some boring guy from Kent.” Then, when attempting to get a Spanish passport after Brexit by proving he had Sephardic Jewish heritage, he discovered he was a direct descendant of Moses Cohen Henriques, the 17th century’s most famous Jewish pirate of the Caribbean. “I found a painting of him,” laughs Manzanera, “and he looks like me on the cover of the first Roxy album. Long hair, boots – absolute ringer!” Nevertheless, it was his time in Cuba that most affected him creatively. The first music he learned to play – on his mother’s guitar – was “boleros and all that type of thing, the acoustic music people later heard on Buena Vista Social Club”. As he points out, the homegrown musical culture of Cuba was so strong, “a groove that was so much part of social and cultural life”, that rock’n’roll struggled to make any impact. He can remember being taken to Havana’s famous El Tropicana nightclub as a child – “there was a fabulous recreation of it in The Godfather Part II, set exactly when I was there, Christmas 1958” – and seeing Celia Cruz and pianist Rubén González perform. “Nobody asked me anything about my background or South America in the whole 12 years of Roxy. Latin music had a weird image in Britain – it was all Edmundo Ros and Carmen Miranda with bowls of fruit on her head. I sort of kept quiet about it, I was a bit embarrassed. In Roxy, they were a bit older than me. I just wanted to learn and get on with it. But [Cuban music] was bursting to get out of me; I had to stick it into Roxy somehow by stealth. So I played a 6/8 echo groove against [drummer] Paul Thompson’s 4/4 beat – the 6/8 time signature is the basis of cumbia.” Once he was away from Roxy, Manzanera’s musical influences came gushing out: the opening track of his 1975 solo debut, Diamond Head, was called Frontera and featured Robert Wyatt singing in Spanish. And his South American roots were made more explicit still on 1990’s Southern Cross – featuring his retelling of his childhood experience of the Cuban revolution, the track Dr Fidel – and 1999’s Vozero. In fact, you get the feeling that a considerable amount of Manzanera’s solo work was a reaction to Roxy Music, in which life always seems to have been slightly fraught. He once compared the band to a Rolls-Royce he bought at the height of their success: beautiful, but so difficult to drive that it was best only occasionally taken out of the garage. Certainly, Manzanera’s stark, drum-machine-driven 1982 instrumental album Primitive Guitars sounds like a response to the lushness and intricacy of Roxy Music’s final album, Avalon, the making of which was so strained that Manzanera departed the band after the subsequent tour by shaking Bryan Ferry’s hand and offering the words: “Goodbye – it’s been a great pressure working with you.” “Oh, absolutely, 100%,” he nods. “I understand [the sound of Avalon] better now, because Bryan’s a fine artist and it’s his work of art. But I was more rebellious. I thought: I’ll just do an album with drum boxes and all sorts of shit on it, more experimental, distilling everything down.” None of his solo work ever sold in vast quantities. Occasional Roxy reunions notwithstanding, he says, he’s proudly been “indie since about 1983”, having realised early on that “I’d have to go and ask someone’s permission to make music for the rest of my life, unless I acquired the means of production – and there we are, referencing Marx and Che Guevara”. Nevertheless, some of it has unexpectedly found its way to a mainstream audience, not least when the title track of his 1978 solo album K-Scope ended up being sampled on No Church in the Wild, the opening track of Jay-Z and Kanye West’s 2011 album Watch the Throne and subsequently a triple-platinum-selling single (it recently popped back up on the Gladiator II trailer). He had been sampled by hip-hop producers before – his riff from Roxy Music’s Amazona turned up on Ice-T’s That’s How I’m Livin’ in the early 90s – but even so, it came as a shock. Manzanera claimed he earned more from the sample’s use than he did in 50 years of Roxy Music, and No Church in the Wild’s producer, 88-Keys, felt the urge to visit him backstage and fill him in on how he came to use it. “He came to see me when I was playing with David Gilmour at Radio City in New York, and he brought his copy of K-Scope with him. He told me he specialises in sampling vinyl records made between 1976 and 1978; he goes through the bins in record stores and that’s how he found it. He slowed it down so much I didn’t recognise it at first, but that’s the genius of 88-Keys. I gave him a huge hug and said, ‘Man, I love you.’ It was like an act of God, like there’s somebody up there saying ‘good karma – stay in your lane, be nice to people, just chill out and things will happen’.” It has, he concedes, been quite a journey. His latest musical project is a collaboration with Roxy’s Andy MacKay and Paul Thompson, involving “90% improvised music”. They played some tiny gigs in London last year, and intend to release the recordings next year. Struggling to describe what it sounds like – “improvised but not jazz … strange sounds, space and texture” – he suddenly mentions the old ad in Melody Maker that started all this. “Avant-rock!” he says, happily. “We’re back in the avant-rock space. It’s come full circle. We’re back in the experimentation business.” • 50 Years of Music is released on 1 November",
        "web_url": "https://www.theguardian.com/music/2024/nov/01/somebodys-up-there-saying-good-karma-phil-manzanera-on-roxy-music-cuban-grooves-and-making-a-fortune-off-jay-z-and-kanye-west",
        "pub_date": "2024-11-01T08:00:42Z",
        "section_name": "Music",
        "tags": [
            "Pop and rock",
            "Music",
            "Roxy Music",
            "Culture",
            "Experimental music"
        ]
    },
    {
        "headline": "It’s Emperor Kanye and his ‘chief architect’ – guess which one wasn't wearing any clothes? | Marina Hyde",
        "trailText": "Outside the Grammys, Bianca Censori dropped her coat to reveal a barely-there dress to the waiting cameras. Was it art? Was it fashion, asks Guardian columnist Marina Hyde",
        "bodyText": "What precisely is the deal with Kanye West and his wife, Bianca Censori, whose latest very surprising red-carpet outing very unsurprisingly featured her being next-to-naked? Bianca’s husband, who dresses like a Minecraft security guard, seemed to be giving her the signal to shed her fur coat and reveal herself outside Sunday night’s Grammys, to which they don’t appear to have been invited. Certainly a hot new twist on the old 13th fairy act. Given that Bianca is rarely photographed in anything heavier than a 5-denier sex poncho, half the internet seems to have settled definitively on the conviction that she is being coercively controlled. The other half has decided the pair enjoy the attention their “art project” is receiving. I’m not sure it’s entirely clear which is the case, or indeed whether it’s a bit of both for now, and in any case she may reevaluate her opinions about the situation in retrospect as time goes by. By way of a recap for Guardian readers not obsessed with the byzantine court politics of Yeezy (guys, please: this stuff is important): Kanye and Bianca married in 2023, following the sundering of his union with reality-industrial-complex mogul Kim Kardashian. Bianca and Kanye seem to have met via the latter’s previously mentioned fashion brand, where she was hired as the chief architect. Stay with this, because the sneakers Kanye produces are so hideously absurd that they may well have featured mock-Tudor heel gables and Juliet balconies. Even so, being the chief architect of a fashion company does feel a little like being the chief veterinary officer of a teapot factory. Then again maybe all virulent antisemites need a chief architect. I’m not saying Bianca was the Albert Speer of Yeezy, planning ever more triumphalist colonnaded sneakers, only for these dreams to end in rubble when the boss overreached himself. But the fact remained that Kanye’s collaboration with Adidas did end up imploding, shortly after he fired out a barrage of Jew-hate across pretty much every possible platform, appended by the explainer: “I can literally say antisemitic shit, and they can’t drop me.” Not so, as it turned out. (Maybe he read some second world war history books and wrongly assumed the old rules of the firm still applied.) These days, the Wests stage regular silent happenings for the paparazzi, which are parsed by everyone from lip-readers to armchair hostage video experts to determine if Bianca is having fun or not. She certainly seemed to be, in an enthusiastic karaoke performance at a Grammys afterparty – but appearances can be deceptive. There’s rather more to run on this one before the world can know for sure. For now, perhaps we have to take the word of Bianca’s tirelessly curated personal website, which is a strong pusher of the notion that she and Kanye are a mutually supportive pair of performance artists. “While many were initially fascinated by her private life,” it acknowledges of her rise to fame, “her role at Yeezy – West’s fashion brand – quickly became the focus.” Did it though? Perhaps more luck will be had on that front now, thanks to Bianca’s announcement that she is releasing a documentary about herself this year. “The documentary will also highlight her collaborative relationship with Kanye West, focusing on how their creative partnership drives innovation across various fields. While both have kept much of their work under wraps,” it goes on, suggesting a metaphorical fur coat is about to be dropped by both Wests, “this series will offer unprecedented access to their joint creative processes, revealing how Bianca’s architectural sensibility influences Kanye’s futuristic fashion designs.” Righto. The network/streamer on which you’ll be able to view this remains tantalisingly unconfirmed. But I think I’d be more interested in it than Meghan’s upcoming tablescaping debut on Netflix, if that means anything. In the end, though, the Kanye and Bianca show seems not a lot more than a bi-weekly occasion for drawing attention to staggering creative decline. For someone whose music was once layered and groundbreaking – and look, for someone whose architecture might well have also been layered and groundbreaking – the message of this now fairly long-running exercise in minimal dressing seems embarrassingly pedestrian, based on a somewhat teenage belief that sex is oo-er-rude and transgressive. As an art project, what is its point supposed to be? No offence, but it has about as much depth and nuance as a Banksy or late-stage Damien Hirst – in fact, it makes the actor Sydney Sweeney’s funny snap of herself in a grey sweatshirt reading “Sorry for having great tits and correct opinions” look like a Renoir. As for where the show goes next, I have suspected for a while now that one future staging post on this provocative artistic journey will be for Bianca to appear on some red carpet or other wearing a full-body veil, while Kanye remains nice and comfy in his customary T-shirt and trousers. Should this development be realised, it’s hard to know whether people will find it offensively shocking, finally sufficiently modest, or coercive in a different manner. It’ll definitely be a lot harder for them to talk about in the “right” way than nudity is, though. In fact, judging by the full chatterati meltdown over Bianca and Kanye’s Grammys outing, the choice or otherwise of nudity remains much more acceptable to discuss than the choice or otherwise of being fully covered. Perhaps Mr and Mrs West have accidentally made an interesting point after all. Marina Hyde is a Guardian columnist Do you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our letters section, please click here.",
        "web_url": "https://www.theguardian.com/commentisfree/2025/feb/04/kanye-west-bianca-censori-grammys-clothes",
        "pub_date": "2025-02-04T14:28:35Z",
        "section_name": "Opinion",
        "tags": [
            "Kanye West",
            "Grammy awards 2025",
            "Grammys",
            "US news",
            "Music",
            "World news",
            "Culture"
        ]
    },
    {
        "headline": "Five Great Reads: the brain collector, teacher-less pilates, and squatting in Kanye West’s mansion",
        "trailText": "Guardian Australia’s weekend wrap of essential reads from the past seven days, selected by <strong>Claire Keenan</strong>",
        "bodyText": "Happy Saturday, readers! There’s less than a fortnight to go until the US’s political fate is decided (for our coverage, see here). But there are plenty of other things going on in the world – today, read about the secrets of brains and what it’s like living in Kanye West’s abandoned mansion. I saved my favourite for the end. 1. The Faustian pact between stars and the public The death of Liam Payne has prompted worldwide tributes for the former One Direction member, but it has also sparked something of a reckoning about celebrity culture. This piece by crisis PR consultant and author Mark Borkowski urges us to treat celebrities like humans and not gods – and points out that while stars may think they understand the demands of public life, many don’t. “Celebrity in 2024 is like stepping into a spotlight that continues to follow you when you leave the stage,” he writes. “And, believe me, there’s no line this invasive spotlight won’t cross. Once you’re in it, the media and public don’t easily respect boundaries. They view public figures as akin to public property, commodities whose personal lives are of as much interest as their professional output.” How long will it take to read: Three minutes. ‘Liam Payne was just getting started’: In the hours after his death, Alexis Petridis penned a beautiful piece on Payne. And regardless of whether you fell in love with One Direction at 13, Kate Solomon’s tribute is worth your time. 2. On sleeping with older men The first man Daniel fell for was his humanities teacher – a straight, married man who was 37 when Daniel was born. “This entirely unrequited crush (which I never admitted to anyone until I was well into adulthood) planted the germ of who I became,” Daniel writes in this colourful chronicle of early sexuality, during which he attempted “to counter society’s assumption” that he was chasing older men “because I wanted their money”. “Intergenerational gay relationships are always scrutinised for being transactional,” he writes. “Acquisitive stereotypes cut both ways: the younger partner worries about seeming conniving, while the older partner fears being fed a line, as if his significant other is the dating equivalent of a phishing email. My commitment to self-sufficiency was not what allowed Jeff and I to transcend these preconceptions. It was the strength of our attachment, the reality that we fell in love.” How long will it take to read: Six minutes. Further reading: Sticking to the theme of love, read this interview with actor Richard E Grant who talks about heartbreak, ambition and grieving the loss of his wife. 3. Cracking the secrets of ancient brains The very idea of a 2,500-year-old brain is mind-blowing. How does a brain preserve itself? Why do some become “shrunken, spongy or crumbly to touch”, while others completely disintegrate and all that is left is the mighty secure skull? Alexandra Morton-Hayward has been busy studying “the molecular processes that occur after death to preserve brain tissue” – or as we might say, brain preservation. What she and other experts have found is groundbreaking and somewhat bleak – “many preserved brains come from people whose lives ended miserably”. The scientist’s own story is an illuminating tale as to why people often pursue the work they do: she traces her fascination with the brain to a very specific time – when her own brain began to torture her. How long will it take to read: Eleven minutes. Another brainy read: The secrets of millions buried in the Paris catacombs – what killed them and what diseases they suffered from – are finally coming to light. “Astonishing as it may seem, there has never been any serious scientific study of the catacombs,” the forensic pathologist leading this project says. 4. Teacher-less pilates: ‘There is a soothing quality to the digital instructor’s voice’ As someone who tried reformer pilates, only to fail to activate my core and fall like a gasping fish to the ground, I am impressed by Michael Sun. He cringes about the last reformer class he attended – rescued by the instructor after his entire body caved into a gap – and now relishes in his first time at a “45-minute virtual session featuring pre-recorded demonstrations by a digital teacher”. “An abhorrently cheerful voice radiates from a screen at the front of the room: ‘You got this!’” he writes. “I grunt in response.” Suffice to say, this is a very fun read. How long will it take to read: Three minutes. 5. John Safran’s week of squatting in Ye’s mansion What is it like to squat in Kanye West’s house? Apparently not very fun, according to John Safran. The Jewish Australian comedian-journalist flew from Melbourne to LA to spontaneously slip inside the rapper’s (abandoned and unlocked) Calabasas mansion and spend a week “trying to understand West’s psyche”. The result is unnerving. Guardian Australia’s Sian Cain navigates the comedian’s latest stunt, which he describes as a “writer’s retreat” (but what others would just call trespassing) – “sleeping in the rapper’s bed and raiding the pantry” – with great contextualisation and brilliant questions. It’s one of my favourite interviews of the year. Safran’s reasoning: “You know, I blame society for me breaking into Kanye West’s mansion,” he tells Cain, faux-seriously. “The signs were there. You could have stopped me.” What does one eat in a vacated Kanye house? Some old pasta cooked in a bucket of rainwater. How long will it take to read: Four minutes. Sign up If you would like to receive these Five Great Reads to your email inbox every weekend, sign up here. And check out out the full list of our local and international newsletters, including The Stakes, your guide to the twists and turns of the US presidential election.",
        "web_url": "https://www.theguardian.com/australia-news/2024/oct/26/five-great-reads-the-brain-collector-teacher-less-pilates-and-squatting-in-kanye-wests-mansion",
        "pub_date": "2024-10-25T21:00:13Z",
        "section_name": "Australia news",
        "tags": []
    },
    {
        "headline": "The exposure of Bianca Censori’s body is contrasted with the enigma of her mind | Moira Donegan",
        "trailText": "No one knows what she thinks of her own public nudity or of her relationship with Kanye West – or of anything at all, for that matter, since she never talks",
        "bodyText": "Apparently, they got kicked out pretty quickly. On Sunday night, the rapper Kanye West and his wife, the Australian former model and “Yeezy” brand architectural designer Bianca Censori, appeared at the Grammy awards. West wore black sunglasses; Censori wore basically nothing. In a stunt for the cameras, West posed behind Censori as she turned her back to the paparazzi and lowered a long fur coat down her shoulders. When she turned to face the photographers, she was wearing a fully transparent mini dress, and no underwear. The effect was that she appeared completely nude. According to Page Six, the pair were “escorted out” following the incident, though others claim that the couple left of their own accord. West, after all, was only nominally a contender for a Grammy this year: he was nominated in just one category, best rap song, for Carnival, his collaboration with Ty Dolla $ign. He ultimately lost, but he didn’t come to the Grammy awards expecting to win. What he wanted out of his attendance was what he got when Censori dropped her coat. The clothing, or rather lack thereof, is typical of Censori in her appearances with West. Since the pair married in early 2023 – shortly after West finalized his divorce from reality star Kim Kardashian – Censori has rarely been seen without West, and rarely wearing clothes. On a 2024 trip to a restaurant in Los Angeles, she wore a sheer flesh-colored bodysuit with long sleeves but no coverage over her breasts; that same summer, at the Chateau Marmont, she wore thong underwear without any pants; on a trip to the movies, she wore a sheer crop top with no bra, and a pair of shorts so short, they tipped into the genre of briefs. The effect of her nudity and near-nudity is heightened by the proximity of Kanye West, her husband, who is usually wearing too much clothing beside Censori’s too little: long pants, long sleeves, high necks, and layers of jackers, sweatshirts, and ponchos, often combined with a beard and dark sunglasses that conceal his face. Risque fashion is a tradition of its own, and the bodies of celebrity women are offered up for exposure and visual consumption in a kind of conventional ritual that often carried its own critique. In terms of sheer exposure, Censori’s “outfit”, as it were, at the 2025 Grammys is not so different from Rihanna’s famous sparkly-sheer flapper-inspired number from the 2014 Council of Fashion Designers of America awards. And yet Censori’s habit of nudity is darker, less playful, and not just because it declines to partake of the coquettish ritual of faux-concealment that is typical of so much other revealing fashion – and, indeed, of celebrity itself. There is a clear desire to shock in her appearances with West, but there is no playfulness. In vain one scans the photos of Censori in search of a smile, a twinkle in her eye, a sign of conspiratorial pleasure, or of being in on the joke, or even of mere willingness. One sees only the blankness of her expression, vacant and somewhat sad. Writing in the New Yorker, Naomi Fry called her a “pure, mute spectacle of flesh”. The exposure of Censori’s body is contrasted with the enigma of her mind. Officially speaking, no one knows what she thinks of her own public nudity, or of her relationship with West – or of anything at all, for that matter, since she never talks. West, however, is somewhat less of a mystery. Around the time of his messy divorce from Kardashian, with whom he shares four children, West’s behavior became erratic. He launched a half-hearted run for president before endorsing Donald Trump; he praised Hitler and tweeted that he would “go death con 3 on JEWISH PEOPLE”. This public behavior was allegedly paired with increasingly disturbing private actions, especially concerning sex and women. Back before he lost his partnership with Adidas, he showed executives there pornographic videos on his phone during a meeting. He is being sued by at least two women for sexual assault. One, a model for a music video that West worked on, says that he strangled her and shoved his fingers in her mouth during a music video shoot at New York City’s Chelsea hotel in 2010, allegedly yelling “This is art, this is fucking art,” during the attack. Another, his former assistant, accuses West of sexually assaulting her on multiple occasions, including one incident in which she claims that West drugged her in the presence of the rapper and accused sex trafficker Sean “Diddy” Combs. West has called the allegations “baseless”. As for Censori, her mother came to California from Australia not long after the marriage, reportedly because she was concerned about her daughter. On one of the visits, according to West’s former assistant, West told Censori that he wanted to have sex with Censori’s mother and to make Censori watch. It would be generous – and easier on our consciences – to imagine Censori and West partaking, together, in a critique of gender and celebrity. In this version of events, what West is doing when he stands behind Censori and watches her undress for paparazzi photographers is not using her degradation and vulnerability as proof of his status, but indicting us, the viewer. His vampiric consumption of her body becomes ours: the brutal depiction of heterosexuality as a practice of domination and value extraction is shown to be the same as the practice of celebrity and its consumption. But if that critique is contained in West and Censori’s spectacle, it may be we, not them, who puts it there. Censori’s consent and knowingness is not, actually, in evidence here; and even if it was, consent exists, often, even in situations of asymmetry and violence, even in situations where great harm is being done. Critiquing Censori as an artist allows us to see her differently, as something more hopeful and complicated than a victim of brutality. But sometimes things are what they look like. Moira Donegan is a Guardian US columnist",
        "web_url": "https://www.theguardian.com/commentisfree/2025/feb/04/bianca-censori-kanye-west-grammy",
        "pub_date": "2025-02-04T20:00:18Z",
        "section_name": "Opinion",
        "tags": [
            "Kanye West",
            "US news",
            "Grammy awards 2025",
            "Grammys"
        ]
    },
    {
        "headline": "Rapper Rhymefest on Trump, Kanye and David Cameron: ‘There’s a political realignment happening in the US’",
        "trailText": "Che ‘Rhymefest’ Smith co-wrote some of Ye’s biggest hits. Now he’s plunging into the vipers’ pit that is Chicago city politics",
        "bodyText": "Che Smith is your favorite rapper’s favorite wordsmith. As Rhymefest, the Chicago native announced himself as a formidable battle rapper, verbally sparring with Eminem and other stars in the late 90s. He co-wrote some of Kanye West’s biggest hits, not least the Grammy-winning Jesus Walks, while carving out his own exemplary career as a conscious emcee. He won a Golden Globe and an Oscar for Glory, the Selma film soundtrack theme he co-wrote with John Legend and Common, a fellow Chicagoan. Even as the successes piled up, Smith, 47, never stopped thinking about his humanitarian obligation to his home town of Chicago, cut down to a metonym for urban violence and rot. This year, when Chicago held school board elections, the first in the city’s history, Smith decided to run as an independent because he believed his experiences and relationships in the art and music community could prove beneficial. “I had my eye on this,” says Smith, an imposingly sage presence who commands attention whether on the stage or the stump. “I knew how historic an elected school board would be to Chicago, the last major municipality that did not have the democracy of an elected school board.” Pitted against a pastor, a non-profit CEO and a former district principal, Smith won with 32% of the vote. Once sworn in, he hopes to use art to expand students’ horizons. “In terms of Stem – science, technology, engineering and math – why are we not adding arts to make Steam?” says Smith, a former teaching fellow at the University of Chicago’s Institute of Politics. “I know it sounds cliche, but if you’re taking a trigonometry class and learning angles, and you’re in art class learning angles, it could make you better at trigonometry.” Smith’s twinning of commercial artistry with activism separates him from his rap celebrity peers who’d sooner shovel money into a foundation and occasionally turn up to hand out school supplies. He might have become one of those check-writing celebrities if West’s mother, Donda, hadn’t intervened. “One of my biggest teachers,” Smith says of the late mentor he called Miss Maya, for Maya Angelou. “We would [come to campus] and play music for her when we’re 14 or 15. When she would hear us talk about shooting or selling dope, she would ask, ‘Is that really who you are? And if you get famous, is that who you want to be? Because if that is who people perceive you as, you’re going to have to live inside that character for the rest of your life.’” Smith and Ye (as the artist is now known) have been friends since they were teenagers, bonding over music. They came of age as Chicago was emerging as a hive of socially conscious rap and hip-hop force to rival the coasts. With Common and the producer No ID as guides and Twista and Lupe Fiasco pushing them, Smith and Ye emerged as a dynamic duo – the former putting weighty words to the latter’s chipmunk soul beats, inspiring generations of homegrown talents that run from Chance the Rapper to Earl Sweatshirt. In 2011, Smith and Ye founded Art of Culture, a youth mentoring non-profit where Smith teaches writing and leads cultural retreats around the world. It was originally named Donda’s House. But differences of opinion over how the non-profit should be run drove a years-long rift between the two. Things are better between them now. “What we do have is brotherhood,” Smith says. “And I think we as human beings in America have to learn how to have brotherhood and village without always expecting somebody to make our dream come true.” Smith’s imagination has carried him quite a distance. Unlike Ye, who was raised middle-class, Smith grew up poor and was raised by a single mother who had him at 15. He recounts some of this in a 2015 Showtime documentary called In My Father’s House. In it, Smith is driven to reunite with his father, absent from his life since age 12, after purchasing his childhood home. Despite dropping out of high school to pursue music, Smith gravitated to Donda and other individual teachers in his neighborhood – not least the Rev Jesse Jackson, who opened up the south side headquarters of his Operation Push civil rights organization for Wu-Tang concerts and rap shows featuring local artists. After seeing that combination of song and social responsibility play out so seamlessly up close, with Donda’s “sage counsel” still ringing in his ears, Smith committed himself to a more practical brand of rap realness. “When you hear lines like ‘we all self conscious / I’m just the first to admit it’ [from Ye’s All Falls Down], that didn’t come from how brilliant we are as artists,” Smith says. “That came from teachers that trained us how to be authentic. We have great teachers here that work with you in art. And the same way that was done for me, it’s my duty to serve in that way for up and coming artists.” Chicago city politics are notorious for being a vipers’ pit of sharp-elbowed, take-no-prisoners wheeler-dealing, defined by major party crony favor-trading for the better part of a century. The standard was set by Richard J Daley, the imperious mayor fabled to have fixed the 1960 presidential election for John F Kennedy. Decades later the same political machine would put Barack Obama in the White House. It’s only in the last few years that the Chicago Teachers Union has emerged as a major political player, funneling more than $23m into Illinois candidate Pacs since 2010 – investment that culminated in the 2023 election of the mayor, Brandon Johnson, a former public school social studies teacher. In 2023 CTU and its affiliate unions spent nearly $6.5m on Chicago elections, more than any interest group. Smith wasn’t the strongest candidate to represent district 10 – a craggy south side outcropping where a handful of high-performing schools are sprinkled among the failing and condemned. His given name alone, Che, taken from the Marxist revolutionary, writes its own attack ads; his Muslim faith provides the exclamation point. “I have a brother that walked across 15 countries, through the Darién Gap, who lives in my house,” Smith says when I ask him how the immigration crisis is affecting city schools. “Chicago has been having low birth rates, 10,000 less children for the last 10 years. That means there are hardly any children to enroll in public schools.” The new arrivals, he argues, keep the schools filled and funded. Then of course there’s the matter of Smith’s music career, another potential reason for voters to not take him seriously. Broadly, Smith takes offense at the way musicians are treated in the political arena, as if they’re only good for kicking off rallies. It pained him to watch Lil Jon deliver Georgia’s roll call at this year’s Democratic national convention in Chicago. “Lil Jon’s father is an aerospace engineer and his mother is a military nurse,” Smith says. “He can relate to people whether they’re low information or high information, and he’s not the only one. Kanye is the son of a Fulbright scholar. Lupe’s mom was a community activist. Chance’s parents are political operatives in the city. Why wouldn’t you let them reimagine policy? It’s a missed opportunity, but we artists have to take it upon ourselves not to wait to be handed power.” Smith might have waited longer to make his move if Mark Ronson, a close collaborator and one-time label boss, hadn’t pushed him to write an open letter to the former British prime minister David Cameron after the then Conservative party leader took exception to the hip-hop-coded content on BBC Radio 1 in 2006, saying it “encourages people to carry guns and knives”. “David Cameron – someone who I have very little, if anything, in common with – inspired me to know what my influence was as an artist and leverage my cultural currency for social and political justice,” recalls Smith. “But he said something that made sense in our meeting: ‘I turn on the radio, and all I hear is sirens, gunshots and violent rhetoric. I thought it was a national emergency. What am I supposed to do with that as a political leader?’ “I thought he had a point,” Smith goes on. But what I had to tell him is that his politics created that warning shot he heard on the radio.” He believes one reason Cameron ultimately lost power is because he “was never really in tune with the people on the street”. Keen to live up to his independent tag, Smith put $100,000 of his own nest egg into his school board bid – which was notably not endorsed by the Chicago Teachers Union. He says his victory is a credit to a grassroots coalition that ran the gamut from “the streets” to former university students – whose votes he counted as a “‘very good’ professor rating”. He further appreciates that some of the same people who voted for him also voted for Donald Trump – a man who once disparaged Chicago as a “war-torn” city of Black people and Latinos “living in hell”. “Votes for Trump went up across the board in Black communities and Latino communities,” Smith says of the rightward shift in deep blue Chicago. “They voted for a deconstructor of systems. There’s a political realignment happening in America, and I don’t even think the institutions have caught up with it. There are a lot of people that long for the dismantling of the system for the opportunity to build it anew.” Smith has a lot he wants to tackle in his first term – busing, strategic partnerships, the district’s $1bn budget shortfall. That doesn’t seem like it leaves much room for making or performing music. But because school board politics is essentially pro bono work, he’ll have to find the time. “You have to ask yourself, why are these interests putting millions of dollars into running candidates for a job that doesn’t pay?” he says. There was a time in the not too distant past when Smith thought his raptivism could have lasting impact only if he were on a similar fame level to Ye, and not just a dope lyricist. But after his landmark victory, Smith feels like he’s finally meeting the political moment that was laid out for him long ago and is encouraging his industry peers to take similar authorship. “It’s not enough to make a song anymore,” he says. “You gotta make a song and then create a reality from it. It’s time to take all those raps and all those words and start to walk through them and create a better society from the imagination of the music. That’s what I’m doing.”",
        "web_url": "https://www.theguardian.com/us-news/ng-interactive/2024/dec/02/rhymefest-rapper-chicago-schools-kanye-cameron",
        "pub_date": "2024-12-02T15:00:27Z",
        "section_name": "US news",
        "tags": [
            "Chicago",
            "US politics",
            "US news",
            "Rap",
            "Hip-hop",
            "Kanye West",
            "Donald Trump",
            "David Cameron",
            "Culture",
            "Music"
        ]
    }
]