[
    {
        "headline": "Post Malone at Coachella review – chameleonic megastar wows in the desert",
        "trailText": "The 29-year-old singer travelled through his genre-shifting back catalogue in a charming and energetic 90-minute headliner set",
        "bodyText": "Three songs into his Coachella headliner set on Sunday, Post Malone asked his band to stop and restart. It wasn’t that he’d made a mistake; rather, he had to get serious for a second. “How the fuck is everyone doing?” he asked, before reiterating for the second time already how thankful he was, how he hopes “everyone is taking care of themselves and having a great fucking night.” The 29-year-old singer, so adept at shape-shifting that he has bounced from trap to hip-hop to pop to rock to country in less than a decade, maintains at least one consistency: with an exceedingly foul mouth and a beer in hand, he will always be polite. He will check in. He will refer humbly to the “ladies and gentlemen”, even when asking “how fucking bitchin’ is it to be able to come here and play for you tonight?” That warmhearted goofball from high school you still want to party with, who also happens to be one of the most-listened to artists in the world? Such is the appeal of the musician born Austin Richard Post, a self-styled party guy who just wants to have a good time, so redolent with good vibes that he’s the only conceivable person who could collaborate with Beyoncé, Taylor Swift and Morgan Wallen in one year. You could see said appeal working the Coachella crowd on Sunday night – the youngest-skewing of the headliners by far, Post being one of gen Z’s top avatars for the good life: fame, fortune, freedom from boundaries, wearing one’s heart on one’s sleeve but keeping it chill. This is, after all, a man who started out on Soundcloud and credits the video game Guitar Hero for inspiring him to go into music. He speaks the language of dreams and passions and fun, not ego or self-seriousness. Those good vibes translated on Sunday night, even for those not necessarily inclined to follow him on a straight road to Americana. Post possesses one of the most versatile and chameleonic voices in music, but Sunday’s show leaned twangy as an act built around F-1 Trillion, the Texas native’s beers and bros country album released last year with a slew of Nashville collaborators. Post strutted around a stage styled like a highway exit, as if country were merely a pit stop on the open road of musical style; both artist and band sported trucker hats. It’s a transformation of obvious signifiers, though delivered with such enthusiasm as to feel sincere. That the music was often so full-bodied and steamrolling as to make Post’s words indecipherable, his glassy voice overwhelmed by big, bruising guitar licks and bigger pyrotechnics, mattered little to the crowd screaming along to late 2010s hits Circles, Congratulations and Rockstar, or line dancing to new song M-E-X-I-C-O. This was open-hearted effort by a superstar, a man of the people who paused singing to chug from a solo cup and apologized multiple times for “being a bit pitchy” after giving up autotune. (To my untrained ears, he sounded like autotune already.) The 90-minute set, spanning first release White Iverson to latest hit single I Had Some Help (sans Morgan Wallen – and no, Taylor and Beyoncé of course did not show, nor did their songs), barreled through turbocharged track after turbocharged track with a general twang and an emphasis on, as Post called it, “shredding”. The effect veered between numbing cacophony and invigorating wall of sound, peaking when Post let his naturally sanitized voice open up and splinter over songs such as I Fall Apart and Goodbyes. For as much easygoing charm as he brings to the table, Post often seemed to be entertaining through sheer force of will. During his penultimate number, singing from a shredded highway billboard at the front of the catwalk, Post recalled when he was once dismissed as a one-hit wonder with an immediate pivot to the masses: “I want you doing what you fucking love and love who you love and love what you love and keep fucking doing it, ’cause there’s no one on this fucking planet who can fucking tell you shit!” People with phone cameras aloft flocked to him, this creative beacon and pop music enigma brought to his knees in service of the audience and the occasion. “Don’t let anybody fucking stop you, because no one can fucking stop you,” he screamed, before one more polite nod to the ladies and gentlemen of the desert.",
        "web_url": "https://www.theguardian.com/music/2025/apr/14/post-malone-coachella-review",
        "pub_date": "2025-04-14T14:11:16Z",
        "section_name": "Music",
        "tags": [
            "Coachella",
            "Post Malone",
            "Music",
            "Festivals",
            "Culture",
            "Pop and rock"
        ]
    },
    {
        "headline": "Coachella 2025 lineup: Lady Gaga, Green Day, Post Malone and Travis Scott to headline in April",
        "trailText": "Other acts include Charli xcx, Megan Thee Stallion, Missy Elliott, Shaboozey and Blackpink members Jennie and Lisa",
        "bodyText": "Lady Gaga, Green Day, Post Malone and Travis Scott will headline Coachella 2025. Scott, whose prominent billing comes with the description “designs the desert”, will reportedly design an immersive experience called CatcusCon, Rolling Stone reported, and will perform after Green Day’s set on the Saturday nights. His appearance at Coachella comes five years after his aborted headline performance at the 2020 festival, which was cancelled due to Covid. He was then booked again for the 2022 festival, then removed from the lineup when 10 people died in a crowd crush at his Astroworld festival in 2021. This will be the second time Lady Gaga has headlined Coachella, having stepped in to replace Beyoncé in 2017 when she postponed her performance due to her pregnancy. Post Malone has performed at Coachella multiple times before but has never headlined. In their 37-year career, Green Day has never performed at Coachella, though Billie Joe Armstrong joined the Replacements on stage in 2014. “Death, taxes, and rock’n’roll,” Green Day frontman Billie Joe Armstrong told Rolling Stone. “In this world gone sideways, we know one thing for certain: rock’n’roll is forever, and its spirit is needed now more than ever. So bring your rage, your hope, and your loudest voice. Coachella, let’s have the time of our lives.” Other acts performing at Coachella next year include Megan Thee Stallion, Charli xcx, Missy Elliot, Benson Boone, the Prodigy, FKA twigs, Clairo, Sam Fender, Parcels, Blonde Redhead, Shaboozey, Amyl and the Sniffers, K-pop group Enhypen, children’s musical TV show Yo Gabba Gabba!, beabadoobee, and Blackpink members Jennie and Lisa, who will perform separately this year after performing together in 2023 as the first Asian and all-female act to ever headline Coachella. Last year’s Coachella headliners were Lana Del Rey, Tyler, the Creator, Doja Cat and No Doubt, but the festival saw its slowest ticket sales for a decade. Coachella will be held at its usual site, the Empire Polo Club in Indio, California, over two weekends in April: 11-13 April and 18-20 April.",
        "web_url": "https://www.theguardian.com/music/2024/nov/21/coachella-2025-lineup-announced-lady-gaga-green-day-post-malone-and-travis-scott-to-headline-in-april",
        "pub_date": "2024-11-20T23:58:55Z",
        "section_name": "Music",
        "tags": [
            "Coachella",
            "Festivals",
            "Music",
            "Travis Scott",
            "Culture",
            "California",
            "US news",
            "Lady Gaga",
            "Megan Thee Stallion",
            "West Coast",
            "Missy Elliott",
            "Green Day",
            "Post Malone"
        ]
    }
]