[
    {
        "headline": "Rihanna appears again at A$AP Rocky’s gun assault trial as ex-friend testifies",
        "trailText": "Grammy award-winning singer’s presence eclipsed key testimony about the 2021 street shooting",
        "bodyText": "The most important testimony at the trial of the rapper A$AP Rocky got second billing for a second day as superstar Rihanna sat quietly in the audience. Rihanna, A$AP Rocky’s partner, appeared at his Los Angeles trial again on Thursday, sitting between his sister and mother. Rocky, whose legal name is Rakim Athelston Mayers, is facing trial on two felony counts of assault with a semiautomatic firearm, accused by a former friend, A$AP Relli, of firing a gun at him in 2021. A$AP Relli, who was born Terell Ephron, faced a fierce cross-examination on Thursday, bristling under questioning from Rocky’s lawyer and at one point shouting at the defendant. The judge briefly called a recess so the prosecution and Relli’s lawyer could instruct him how to respond properly in court. Before that could happen, Relli shouted: “You did this to yourself!” to Rocky, prompting an admonishment from the judge. “Do not talk to the defendant!” the judge, Mark Arnold, shouted at him. Relli grew frustrated by the questions asked by Rocky’s attorney. The defense showed screenshots of Relli’s Instagram posts in an attempt to contradict his earlier testimony that he had a positive relationship with Rocky before the shooting, but that he had been so shunned for coming forward that his business was ruined and that he had no social media presence. Relli is suing Rocky’s defense attorney Joe Tacopina for libel in civil court for his public statements, and suing Rocky over the incident. The defense has sought to highlight the lawsuits in order to cast him as someone seeking money from a false story and has said his account of what happened has changed over time. Relli argued that although details of his story may have shifted over the past three years, his fading memory does not change what fundamentally happened. “A gun was pulled on me. It was pointed at me, and it was fired later,” Relli said on Thursday. In testimony in previous days, Relli has described the night in November 2021 when he and Rocky, their relationship straining, had a confrontation and scuffled on a Hollywood street, and Rocky pointed a gun at him before walking away. Relli testified that he was shouting at Rocky as he walked after him, then Rocky pulled the gun again and held it in the air. “He turned around and then it was like BOOM!” Relli told the jury. “The whole thing was like a movie, he kind of like pointed down and he shot the first shot.” He said he felt a burning on his hand where a bullet grazed it. Relli testified Rocky fired another shot that he did not see because he had hidden behind a mutual friend. He said: “I felt my hand hot,” and later added: “I was hit. Or I was grazed. I didn’t have a hole or nothing.” Rocky’s lawyer says the shots he fired were not even from a real gun – they were blanks from a starter pistol that he carried as a prop. The lawyer said Relli knew this, and that was why he was so fearless walking after him. “Oh it was a real gun,” Relli testified under prosecution questioning, saying he knew because of his scraped hand. Since the shooting and his decision to go to police and testify, he said he had received death threats, been shunned as a snitch and saw the modest music management career he built fall apart. “It’s been a living hell,” Relli said. About an hour after the shooting, Relli returned to the scene and said he photographed and recovered two shell casings. Earlier, while responding to a report of a shooting, police did not find any. He sent a text to Rocky that was shown in court saying: “U try killing me.” Rocky denied it in his reply: “Bro wtf is u talkin bout why u tell ppl I shot at u.” He sent Rocky photos of the shell casings and his grazed hand. Rocky said he was making stuff up and speaking “all type of nonsense” and was trying to “extort” him. The judge in the case ruled on Thursday morning that Relli’s social media posts capturing what seems like a luxury lifestyle after the incident would be fair game for questioning.",
        "web_url": "https://www.theguardian.com/music/2025/jan/30/asap-rocky-firearm-trial",
        "pub_date": "2025-01-30T21:25:48Z",
        "section_name": "Music",
        "tags": [
            "A$AP Rocky",
            "Music",
            "US news",
            "Rihanna",
            "US crime",
            "Gun crime",
            "Culture"
        ]
    },
    {
        "headline": "Elon Musk, the Titan disaster and Sly Stone: the most anticipated documentaries of 2025",
        "trailText": "The next 12 months promises a host of provocative and revealing new documentary movies",
        "bodyText": "As of early January, it is still too soon to know how the year will shape out for documentary film, with many projects still to be announced. But between headline-dominating stories practically begging for a long-form treatment and the evergreen pipeline of celebrity examinations, there’s already a full slate of nonfiction cinema for 2025. From examinations of the UnitedHealthcare CEO shooting to Elon Musk, the Titan submersible implosion to the grassroots fight against book bans in the US, here are 10 of the most anticipated documentaries this year. Sly Lives! (AKA the Burden of Black Genius) Building on his 2021 Oscar-winning documentary Summer of Soul, about the 1969 Harlem Cultural Festival, director and Roots drummer Ahmir “Questlove” Thompson continues to explore the legacy of pioneering Black musicians with Sly Lives! (AKA the Burden of Black Genius). The nearly two-hour film on Sly and the Family Stone, which will premiere at Sundance in January before heading to Hulu the next month, captures the groundbreaking funk band’s “rise, reign and subsequent fadeout while shedding light on the unseen burden that comes with success for Black artists in America”, according to the press release. As with Summer of Soul, Sly Lives! boasts a slate of distinguished musical guests, including Andre 3000, D’Angelo, Chaka Khan, Nile Rodgers, Q-Tip, Jimmy Jam, Terry Lewis, George Clinton, Ruth Copeland and Clive Davis, as well as former band members and several people close to frontman Sly Stone. Musk Alex Gibney, the prolific documentarian who has turned a sharp eye on Elizabeth Holmes, Enron and the Church of Scientology, has spent several years looking into the world’s richest man/Tesla founder/X owner/unofficial presidential adviser. The resulting film, Musk, still has no confirmed release date (HBO has domestic distribution rights, while Universal snapped up international rights in late 2023), though plenty of material, especially as Musk now heads the “department of government efficiency” for incoming president Trump. The film will purportedly deliver a “definitive and unvarnished examination” of the erratic billionaire. Musk, who did not participate in the project, has dismissed the portrait on X as a “hit piece”, to which Gibney responded: “How would you know?” The UnitedHealthcare CEO/Luigi Mangione film Never one to rest, apparently, Gibney and his production company, Jigsaw, announced in mid-December that they would partner with Anonymous Content for an as-yet-untitled project on the killing of the United Healthcare CEO, Brian Thompson, by the accused shooter, 26-year-old Luigi Mangione. The project promises to touch on both the shooting itself – Mangione allegedly shot Thompson in midtown Manhattan as the health insurance exec walked into an annual investor conference – and the larger conversations about the US health insurance industry sparked by the crime, with some hailing Mangione as a folk hero. According to the logline: “From the crime’s seemingly meticulous execution to the alleged killer’s manifesto and his Ivy League background to the public’s unapologetic apathy towards the victim, the investigative deep dive will ask how killers are created, what this killing says about our society and the values we place on who lives and who dies.” Untitled Rihanna documentary For the sixth(!) year in a row, my most anticipated documentary of the year is the still untitled, forever in purgatory film on Rihanna, which was sold to Amazon for $25m in 2019. Last year, I predicted I would make my annual plea for this film in January 2025 and, alas, we once again have no updates, just the knowledge that about 1,200 hours of Rihanna footage – pre-Super Bowl halftime show and the birth of her second son! – are just out there on director Peter Berg’s cutting room floor awaiting her approval, with the “done and sold” film (series …?) maybe never to see the light of day. Will it be this or R9 first? Here’s to hoping in 2025. Predators For four years, starting in 2004, the Dateline NBC program To Catch a Predator confronted alleged child predators in dramatic fashion – partly using hidden cameras, the show followed undercover sting operations to lure suspected predators to a supposed meeting with a minor, only to be confronted by host Chris Hansen and, usually, arrested. Predators, a new film from director and producer David Osit (Mayor), examines the rise and shocking fall of the popular program, which was cancelled in 2008 after the suicide of a man caught exchanging pictures with a sting operator posing as a 13-year-old boy, as police and NBC camera operators entered his home. Premiering at Sundance this month, the film will also look at the world of sordid entertainment-cum-true crime the show helped create. The Librarians Given, um, political events scheduled for January, Librarians, a new documentary on the nationwide trend toward book bans, is perfectly timed for a Sundance premiere. The film, directed by Kim A Snyder (Us Kids, Newtown) and executive-produced by Sarah Jessica Parker, follows a group of librarians dubbed the “FReadom Fighters”, who have fought rightwing book bans in Texas, Florida and elsewhere. “They have been standing up to the ideology that prevents children from having access to certain books and they have put their own lives and their family’s lives at risk, but they have not backed down,” said Parker at the Red Sea film festival in December. The documentary will focus in particular on Amanda Jones, a librarian in southern Louisiana who faced intense backlash for defending students’ access to books with LGBTQ+ themes and published a memoir on the fight against book bans in America. It’s Never Over, Jeff Buckley The Sundance film festival has increasingly been home to several celebrity musician doc premieres, and this year is no different, with a new portrait on the American singer-songwriter Jeff Buckley. It’s Never Over, Jeff Buckley, from director Amy Berg (Janis: Little Girl Blue), will reportedly include never-before-seen footage, exclusive voice messages and interviews with those close to the Grace musician, who accidentally drowned at age 30 in 1997. Apocalypse in the Tropics Director Petra Costa’s exploration of the evangelical Christian movement in her native Brazil technically premiered on the festival circuit in 2024, but will get a wide release via Netflix at some point this year. Costa’s Oscar-nominated documentary Edge of Democracy tracked the rise of the far right in Brazil under the Trump-esque president Jair Bolsonaro; Apocalypse in the Tropics examines one of its primary fuels. The film features interviews from both sides of the country’s intense political divide, including televangelist and Bolsonaro adviser Silas Malafaia and Bolsonaro’s liberal predecessor/successor Luiz Inácio Lula da Silva, for a portrait of the fine, dissolving line between democracy and theocracy. Untitled Titan submersible film As with any headline-dominating, head-scratching story, the tragic saga of the doomed Titan submersible, which imploded during a private trip to view the wreck of the Titanic in June 2023, has graduated from frenzied news coverage to slightly more considered documentary. The as-yet-untitled film comes from Aron Arngrimsson, said to be the last person who saw the five-person submersible crew alive as he closed the vessel’s hatch. It “exclusively tells the emotional experience of five Titan crew members, revealing the family stories behind the media headlines and exposing the painful consequences of an exploration gone wrong”, according to a synopsis from producers Dirty Dozen Productions and RadicalMedia. The film, reportedly in post-production, is set to debut in 2025. Elway And one for the sports fans – a documentary on the legendary NFL quarterback John Elway, one of the most celebrated American football players in history, is coming to Netflix. The film from Skydance Sports, which recently produced a docu-series on the controversial QB Aaron Rodgers for the platform, will explore Elway’s “extraordinary journey” on and off the field, from his early days as a burgeoning baseball star – he was a New York Yankees draftee – to his college days at Stanford to his 16-year career with the Denver Broncos, which ended in 1999 with two Super Bowl championships (and later a third, as an executive). Elway, directed by Ken Rodgers and produced by Peyton Manning’s Omaha Productions, will presumably premiere this year, with a release date to be announced.",
        "web_url": "https://www.theguardian.com/film/2025/jan/03/most-anticipated-documentaries-2025",
        "pub_date": "2025-01-03T09:05:50Z",
        "section_name": "Film",
        "tags": [
            "Documentary films",
            "Sly Stone",
            "Elon Musk",
            "Alex Gibney",
            "Brian Thompson shooting",
            "Rihanna",
            "Jeff Buckley",
            "Luiz Inácio Lula da Silva",
            "Jair Bolsonaro",
            "Brazil",
            "Titanic sub incident",
            "Film",
            "Culture"
        ]
    }
]