[
    {
        "headline": "One of Them Days review – SZA and Keke Palmer spar and sparkle in raucous LA buddy movie",
        "trailText": "The US singer makes a terrific screen debut opposite Palmer in this tale of two roommates working out how to not get evicted",
        "bodyText": "A race against time to stave off imminent eviction, with added peril due to a misunderstanding over a rare pair of Nike Air Jordan trainers, One of Them Days walks a relatively familiar buddy movie path. Dreux (Keke Palmer) and Alyssa (SZA) are best friends and roommates in a cheap and cheerful apartment in LA’s Baldwin Village. But then Alyssa’s feckless boyfriend spends the rent money and the women have until the end of the day to raise the cash. With its zingy colour palette and effervescent, unapologetically uneven storytelling, the film has a buoyant, almost cartoonish quality (albeit one laced with lip-smacking, sexually explicit dialogue). What elevates this raucous romp by music video director Lawrence Lamont is the crackling energy between Palmer (Nope) and singer SZA, making her acting debut here. Dreux also gets a love interest, in the shape of a mysterious hunk named Maniac (Patrick Cage). But Dreux and Alyssa, with their sparky chemistry and crisp comic sparring, is the only relationship we care about. In UK, Irish and Australian cinemas",
        "web_url": "https://www.theguardian.com/film/2025/mar/09/one-of-them-days-review-sza-keke-palmer-raucous-la-buddy-movie",
        "pub_date": "2025-03-09T15:00:04Z",
        "section_name": "Film",
        "tags": [
            "Comedy films",
            "Film",
            "Culture",
            "SZA"
        ]
    },
    {
        "headline": "One of Them Days review – Keke Palmer and SZA take a bumpy but fun ride",
        "trailText": "The stars shine in bright and boisterous new buddy comedy, executive produced by Issa Rae, that only stumbles when it leans into cartoon",
        "bodyText": "I will be the first to say: I miss Insecure, which left a dynamic duo-sized hole in the TV landscape since it concluded in December 2021. Issa Rae’s era-shaping series was about many things – the Black community in south Los Angeles, the diversity pablums of the 2010s, millennial dating, for starters – but at its core, it was a seminal portrait of longstanding, complex female friendship in one’s late 20s, the kind forged by time, ridiculous escapades and plenty of meaty conflict for viewers to hash out at the proverbial water cooler. The shadow of the erstwhile HBO series looms large over One of Them Days, a boisterous new buddy comedy executive produced by Rae and penned by the former show writer Syreeta Singleton. Also set in south Los Angeles – albeit on one sweltering, no-good first of the month, when the rent is due and tenancy is in flux – One of Them Days, directed by the Rap Sh!t and music video veteran Lawrence Lamont, similarly concerns two wayward twentysomething besties who can, for enough moments to suffice, conjure the fizzy magic of its forerunner. Once again, two friends are at a crossroads, of sorts. Dreux (the ever charismatic and indefatigable Keke Palmer) runs a local diner with aspirations to become a franchise manager; her childhood best friend and roommate, Alyssa (the singer SZA), is an artist skeptical of the corporate path – or really, any path or structure – and ekes out a living by whatever means immediately available. Both are living paycheck to paycheck and increasingly at the whims of gentrification (in the form of their new neighbor Bethany, a textbook wide-eyed white girl knowingly played by Maude Apatow), and both are on a tight deadline: the rent is due. Dreux trusted Alyssa to pay, and Alyssa trusted the cash to her deadbeat sneakerhead boyfriend Keshawn (Joshua David Neal), who summarily beat it. In lively, mile-a-minute fashion, the two find themselves on a quest with an on-screen countdown: recover the cash, get Dreux to her corporate interview by 4pm, and pay their unsympathetic landlord Uche (Rizi Timane) by 6, lest they get evicted. Hijinks ensue, which – despite a trailer that leaned heavily on the film’s most outrageous moments, too high-voltage (literally) in the moment and especially so out of context – are generally grounded and frequently funny. That’s largely due to the two leads, particularly Palmer, whose natural gravity and distinct delivery – rapid-fire, jazzy, zagging where one would zig – makes even the most flat material sing. Palmer received long overdue prestige recognition for her dramatic (though, being Palmer, never not sparkling) turn in Jordan Peele’s Nope; back in solidly comedic territory, she makes playing Dreux, a Keke-esque hustler under different circumstances, seem like a breeze. SZA, in her acting debut, is comparatively stiffer though equally melodic, especially when the two friends get going – their rat-a-tat banter is the best part of the movie. She’s admittedly saddled with the less sympathetic character. Insecure mastered the balance in the friendship rifts, where both participants are equally right and wrong; in this case – and perhaps others feel differently, though I am usually the less planned half of my friendships – Alyssa is mostly at fault, at times distractingly callous and capable of unintentional sabotage. Alyssa’s self-absorption may be harder to swallow, but Palmer and SZA enjoyably ham up what could otherwise be try-hard, too gimmicky fare – a stint at a payday loan with a snarky lender (Keyla Monterroso Mejia), a fight with Keyshawn’s vengeful new girl (Aziza Scott). Some of the bits, such as a messy episode at a blood bank with an incompetent nurse (Abbott Elementary’s Janelle James) or a snafu with a gun-wielding neighborhood menace (Amin Joseph), go too far, or lean too cartoonish to land, a level 11 when level 10 would suffice. It’s a bumpy ride, albeit an overall enjoyable one, with a believably character-populated apartment community and unforced, consistent energy. As Dreux notes in a meta-point at her (predictably unpredictable) job interview, chances like this don’t come for people like her that often. For the still too-rare, Black-led female theatrical comedy, One of Them Days has a tendency for overkill, but makes its moment count. One of Them Days is out in the US on 17 January with a UK date to be announced",
        "web_url": "https://www.theguardian.com/film/2025/jan/15/one-of-them-days-review-keke-palmer-sza",
        "pub_date": "2025-01-15T17:00:45Z",
        "section_name": "Film",
        "tags": [
            "Comedy films",
            "Film",
            "SZA",
            "Comedy",
            "Culture",
            "Issa Rae"
        ]
    },
    {
        "headline": "UK pop stars fail to reach global Top 10 albums and singles chart for first time since 2003",
        "trailText": "Global chart dominated by US acts including Benson Boone, Taylor Swift, Billie Eilish and Sabrina Carpenter, with K-pop bands also strong",
        "bodyText": "British pop stars have failed to reach the worldwide annual charts of the year’s Top 10 biggest singles and albums for the first time in more than two decades. In 2022, UK acts such as Harry Styles and Glass Animals made up seven of the 20 entries in the International Federation of the Phonographic Industry (IFPI) list. This year, the leading UK act was producer and singer Artemas, for I Like the Way You Kiss Me. British stars such as Charli xcx – arguably the most conversation-dominating UK act of 2024, with her album Brat – Dua Lipa and Coldplay did not feature. It is the first time since 2003 that a UK act hasn’t featured in either the singles or albums list. The No 1 song globally was Beautiful Things by Benson Boone, and the No 1 album globally was The Tortured Poets Department by Taylor Swift. K-pop boybands dominated the albums list, with two entries from Seventeen (Spill the Feels at No 6 and 17 Is Right Here at No 8), along with Enhypen (Romance: Untold at No 4) and Stray Kids (ATE at No 10). The remainder of the list came from US superstars: Hit Me Hard and Soft by Billie Eilish (No 2), Short n’ Sweet by Sabrina Carpenter (No 3), SOS by SZA (No 5), One Thing at a Time by Morgan Wallen (No 7) and Stick Season by Noah Kahan (No 9). In the singles chart, only Irish songwriter Hozier, with Too Sweet at No 6, deviated from the otherwise total US dominance of the list, which spanned pop (Carpenter’s Espresso at No 2) to rap-country (Post Malone and Wallen’s I Had Some Help at No 7) and a five-year-old song by Swift, Cruel Summer, at No 9. The insistence of Kendrick Lamar’s blockbuster Drake diss track, Not Like Us, was confirmed as it appeared at No 8. Jo Twist, chief executive of British record industry body the BPI, told the BBC: “British artists may have enjoyed stronger years on the international stage, which perhaps isn’t surprising given some of our biggest names were not in cycle in 2024. “There was still plenty to be excited about, as a new generation announced itself – not least Charli xcx, who enjoyed a breakthrough year globally, alongside international chart success for emerging artists such as Jordan Adetunji, Artemas and Good Neighbours, while the likes of Lola Young and Myles Smith are now rapidly building an international following.” Twist said that it is “undoubtedly becoming much harder to break talent in a hyper-competitive global music economy”. The news comes ahead of the Brit awards this weekend, led by xcx with five nominations for Brat, followed by Lipa, the Last Dinner Party, Ezra Collective and Myles Smith with four. Global bestselling albums of 2024 Taylor Swift – The Tortured Poets Department Billie Eilish – Hit Me Hard and Soft Sabrina Carpenter – Short n’ Sweet Enhypen – Romance: Untold SZA – SOS Seventeen – Spill the Feels Morgan Wallen – One Thing at a Time Seventeen – 17 Is Right Here Noah Kahan – Stick Season Stray Kids – ATE Global bestselling singles of 2024 Benson Boone – Beautiful Things Sabrina Carpenter – Espresso Teddy Swims – Lose Control Billie Eilish – Birds of a Feather Shaboozey – A Bar Song (Tipsy) Hozier – Too Sweet Post Malone – I Had Some Help ft Morgan Wallen Kendrick Lamar – Not Like Us Taylor Swift – Cruel Summer Noah Kahan – Stick Season",
        "web_url": "https://www.theguardian.com/music/2025/feb/24/uk-pop-stars-fail-to-reach-global-top-10-albums-and-singles-chart-for-first-time-since-2003",
        "pub_date": "2025-02-24T11:11:38Z",
        "section_name": "Music",
        "tags": [
            "Music",
            "Music industry",
            "Culture",
            "Pop and rock",
            "Taylor Swift",
            "Kendrick Lamar",
            "SZA",
            "Billie Eilish",
            "UK news"
        ]
    },
    {
        "headline": "Super Bowl 2025: How to watch or stream the Chiefs v Eagles",
        "trailText": "Here’s how to catch the NFL’s biggest game on Sunday on cable and streaming, plus what to know about kickoff time, the half-time show and more",
        "bodyText": "For the second time in three seasons, Philadelphia and Kansas City will face each other for the championship. Here’s what to know about kickoff time, the host city, the half-time show with Kendrick Lamar and more. What time is the Super Bowl? Super Bowl LIX will air on Sunday 9 February, with kickoff at 6.30pm ET (11.30pm GMT, 10.30am Monday AEDT). Who is performing the half-time show? Kendrick Lamar will headline the half-time show, with special guest SZA. He appeared during the 2022 half-time show, alongside a supergroup of hip-hop and R&amp;B legends. Here are the half-time performers for the last decade: 2025: Kendrick Lamar (with SZA) 2024: Usher 2023: Rihanna 2022: Eminem, Dr Dre, Snoop Dogg, Kendrick Lamar and Mary J Blige 2021: The Weeknd 2020: Shakira and Jennifer Lopez (with Bad Bunny, J Balvin and Emme Muñiz) 2019: Maroon 5, Travis Scott and Big Boi 2018: Justin Timberlake (with the Tennessee Kids) 2017: Lady Gaga 2016: Coldplay (with Beyoncé and Bruno Mars) 2015: Katy Perry (with Lenny Kravitz and Missy Elliott) What time will Kendrick Lamar perform the half-time show? The Grammy-winning rapper will headline the half-time show, which will kick off sometime between 8 and 8.30pm. He is likely to bring the controversial Drake diss track Not Like Us to US’s biggest TV audience of the year Where is the Super Bowl held this year? The Super Bowl will be played at the indoor Caesars Superdome in New Orleans. The stadium, which opened in 1975, is the fifth-oldest stadium in the NFL, and has a capacity of about 75,000. Super Bowl LIX will be the 11th time New Orleans has played host, tying with Miami for the most hosted championship games. How to watch the Super Bowl Fox will carry the Super Bowl live in the US. The game will also be available to stream on the Fox Sports website and app, along with the NFL+ app. The Guardian has live blog coverage of the Super Bowl. In the UK, the Super Bowl is free to air on ITV1 and ITVX. It is also available on Sky Sports and the NFL Game Pass on DAZN, among other channels. Sports fans can listen to the audio stream on BBC Radio 5 Live. In Australia, the game is available on Channel 7, 7mate and 7plus starting at 9.30am AEDT on 10 February. The game will also be available to stream on Kayo Sports and Foxtel Now. How to stream the Super Bowl without cable Streamers Hulu, FuboTV, Sling TV and YouTube TV will also carry the game live. SiriusXM and Fox+ will also carry an audio broadcast of the game. What about the commercials? It’s expected that more than 120 million US viewers will tune in to Sunday’s match, with ad spots reportedly selling for $8m-plus for 30 seconds. Fox wouldn’t confirm final pricing for ad spots, which sold out in November; however, last year, a 30-second spot went for around a reported $7m. The Guardian will cover the half-time show in our Everything but the Football live blog. Several ad spots, including a Squarespace ad featuring Barry Keoghan (and a donkey), Glen Powell for Ram Trucks, and Catherine O’Hara and Willem Dafoe for Michelob Ultra, are already available to stream. Andy Reid, head coach for the Kansas City Chiefs, stars in an ad for Skechers as well. Who performed the national anthem? Grammy award-winning musician Jon Batiste performed the national anthem before the game. In 2024, country singer Reba McEntire sang the Star-Spangled Banner.",
        "web_url": "https://www.theguardian.com/sport/2025/feb/09/watch-super-bowl-chiefs-eagles-superdome-time",
        "pub_date": "2025-02-09T10:00:47Z",
        "section_name": "Sport",
        "tags": [
            "Super Bowl LIX",
            "Super Bowl",
            "NFL",
            "US sports",
            "Sport",
            "Kansas City Chiefs",
            "Missouri",
            "Philadelphia Eagles",
            "Philadelphia",
            "Pennsylvania",
            "New Orleans",
            "Louisiana",
            "Kendrick Lamar",
            "SZA",
            "Jon Batiste",
            "US news"
        ]
    },
    {
        "headline": "Super Bowl: Kendrick Lamar, the ads, Taylor Swift and everything but the football – as it happened",
        "trailText": "While the game goes ahead, it’s a big night for culture with a much-anticipated half-time show, a string of big name ads and a returning role for Taylor Swift",
        "bodyText": "So Taylor’s boyfriend didn’t win this year, that much we know (Taylor, on the receiving end of some pretty juvenile boos, didn’t seem to have the greatest of nights this time around) but he wasn’t the night’s biggest loser – that would be Drake. The Canadian rapper has been on the receiving end of Kendrick Lamar’s ridicule for months now, and tonight we got to see the perfect finale, the Grammy-winning diss track Not Like Us performed for America’s biggest TV audience of the year. It was the most obvious crowd-pleasing moment of a mostly unconventional set, avoiding bigger songs and relying on social commentary, via Samuel L Jackson, that challenged an audience accustomed to an easy ride. The ads of the night were starrier than usual, as was the stadium itself, but there was also an unpleasant amount of both AI spots and those that were not exactly political but were patriotic in an old-fashioned way that felt prioritised at the expense of anything more progressive (No gays! No trans! Just one mention of climate change!). It tracked that it was the year that Trump turned up. At least he got to see Kendrick Lamar perform. F1 The big Super Bowl spot for Brad Pitt’s F1, one of the summer’s biggest question marks, continues the good work done by last year’s first trailer, focusing on multi-sense immersion. It’s set to be the most authentic racing film we’ve ever seen, made in collaboration with the governing body behind Formula One and filmed during actual events over the last couple of years, and the stripped-back new ad highlights such authenticity. Hopes are high with a giant budget and backers Apple still waiting for their first genuine box office hit but if anyone can make this kind of unlikely magic happen, it’s Joseph Kosinski, who also steered Top Gun: Maverick from curio to blockbuster. Smurfs In year that’s lazily bringing back more franchises than ever before from Jurassic World to Final Destination to 28 Days Later to How to Train Your Dragon, why not try once again to make Smurfs work? The characters have moved from Sony to Paramount after two connected films and one reboot and all bets have now been placed on Rihanna as Smurfette, following in the footsteps of Katy Perry and Demi Lovato. After all that wait, is the new Rihanna album going to be a Smurfs soundtrack? The next chapter in the story of soda A wildly ambitious ad here from Poppi, that slightly more expensive and substantially less tasty alternative to regular soda. According to the voiceover, Poppi is what what your kids will think of when they think of soda! Poppi is the next chapter in the story of soda! It’s enough to scare one into actually drinking Poppi. Super Bowl ads always lean patriotic – Budweiser Clydesdales, etc – but this year had an especially awkward edge. The current political divide is stark, and the president who is currently attempting to dismantle much of the government was in attendance tonight. And yet many of the ads and game promos, starring A-list celebrities such as Harrison Ford and Brad Pitt, blithely championed American iconography: freedom, flags, the open range and, of course, football. That’s the job, but especially absent any topics considered “woke” (Kendrick’s half-time show notwithstanding), the disconnect was striking. Carl’s Jr brings back bikinis Eight years after ditching the strategy of using models in bikinis to sell their burgers, Carl’s Jr returns with TikTok influencer Alix Earle doing just that. Well, tonight was not the romcom sequel for Taylor Swift. You do not need to understand football to know that Travis Kelce’s team didn’t play well. No shots of Taylor cheering during a pivotal moment. The Chiefs, and TNT, were never underdogs, but didn’t even have the semblance of being underdogs this year, and popular sentiment was solidly in favor of the other team. Taylor even got some boos when she appeared on the jumbotron: She did get some support from Serena Williams, though. And she will be fine, of course. Andy Reid’s side hustle Andy Reid, leader of the Kansas City Chiefs, is making a play to fill the void of America’s favorite NFL coach left by … no one … with this riff on the side hustle. First it was Zoolander-esque hand-modeling – the better to show off what three Super Bowl rings you have – and now it is Skechers no hands slide-ons. Here’s Sam Wolfson’s great four-star review of tonight’s half-time show: Novocaine As audiences prefer to stick with known quantities like Keanu Reeves, Gerard Butler and Jason Statham, Hollywood continues to try out new action stars with mostly middling results. Aaron Taylor-Johnson couldn’t get anyone craving some Kraven the Hunter, Henry Cavill scored two flops back-to-back with Argylle and The Ministry of Ungentlemanly Warfare, and this weekend, Ke Huy Quan’s first leading vehicle Love Hurts went nowhere for nobody all at once (it opened to a pitiful $5.8m). Will they warm to Ana de Armas in John Wick summer spinoff Ballerina or maybe Jack Quaid, best known for Amazon’s The Boys and last month’s Companion, in gimmicky caper Novocaine? He plays a man incapable of feeling pain whose girlfriend is kidnapped. Given the pricey placement of this new tease, it’s clear that Paramount is hoping for big things from a film that looks like it has a very small budget. All said and done, Kendrick’s “Hey Drake” impish grin is definitely the meme of the night. Some highlights from what remains of the site formerly known as Twitter: Cher turns back time for Uber Eats Uber would like you to know that they too know the memes on Cher not aging – in another budget-flex ad clearly inspired by one of the greatest ever Twitter (never X) threads, Cher uses her powers of timelessness/Uber Eats to turn back time … to the era of witch trials. Walton Goggins’s AI goggle glasses Walton Goggins is the latest celebrity to hop on the AI endorsement train, for GoDaddy’s Airo, a generative AI service for small businesses. Lol that the ad compares AI’s ability to produce things you don’t know how to make – like a logo for Walton Goggins’s goggle glasses – to the skills of … a human actor. I think you should eat The internet’s favorite IYKYK comedians Tim Robinson and Sam Richardson bring their signature absurd comedy of manners to this Totino’s Pizza Rolls spot that is basically an IYKYK ad for Robinson’s Netflix series I Think You Should Leave. I am personally delighted to see what deranged platitudes they can deliver in under 10 seconds. There’s also some footage of the guy who was tackled and removed during the performance after he rushed onto the field with a Palestine flag: Here’s the full half-time performance if you missed it: Muppets on vacation No one has quite figured out what to do with the Muppets ever since they returned in 2010’s rather wonderful movie. There was a middling sequel, a one-season ABC series and a one-season Disney+ series, the characters currently stuck in Disney’a vault until someone else reboots them. They’ve been let out for a brief appearance in this Booking.com ad, their umpteenth Super Bowl ad that, as has become standard, doesn’t really know what to do with them. Dove goes for body positivity In a spot aiming for serious and sentimental, Dove makes another case for changing the way we talk to girls about their bodies, comparing the joy a three-year-old finds in running to the self-hatred a 14-year-old feels about her legs. No product, just a call to treat girls better, becauseone in two who quit sports are criticized for their bodies. Oof. David Beckham’s long-lost brother? In an ad clearly going for the “most cinematic” award of the night, David Beckham learns he has a long-lost brother, whom his parents named “Other David”. Enter Matt Damon, playing Other David, and the pair bond over a pint, “soccer” (meaning “football”) and requisite Ben Affleck ribbing. In surround sound: Harrison Ford waxes poetic for Jeep Wow, Harrison Ford is really feeling his Yellowstone era (he stars in 1923). The actor appears, mug in hand, in a lodge by the mountains, in stoic main character mode for a video essay on the importance of writing your own story, life’s owner’s manuals and freedom, etc. Some shots of American soldiers and the beautiful Rockies gives an extra layer of weird patriotism to this rambling Jeep ad, one of several weirdly patriotic spots tonight. A serious note for climate change A break from things to buy with a spot on something more pressing: climate change. The ad, from a group from Science Moms and the Potential Energy Coalition, is blunt on the point that we’re running out of time to make necessary changes for the climate, and to give our children the world we promised. The ad apparently only aired in LA and on streaming, but will still presumably reach millions, along with all that AI promo. Is there any celebrity who isn’t there tonight? Apart from Drake ofc: One of the best SNL Super Bowl skits imagined a world where the half-time guest cancelled at the last minute and was replaced by Broadway musical theatre actors. Cue horror: Stop enjoying those mozzarella sticks It’s time to back away from the snacks thanks to a rollercoaster ad here from telehealth company Hims and Hers. First we’re scared – obesity is a deadly epidemic that kills millions - then we’re angry – there’s a $160bn industry that profits from urging us to lose weight – then we’re relieved – the answer lies with, you got this, Hims and Hers and a range of effective but, wait, still not exactly free medications. Now we’re hungry again. Still hung up on Not Like Us over here, the second of two Drake diss tracks (the other being Euphoria) that Kendrick performed to the largest audience of his career. Interestingly, Kendrick made some adjustments to the lyrics for the broadcast – he notably skipped over the word “pedophile” (the center of Drake’s defamation lawsuit against UMG), but did get the whole crowd in for “tryna strike a chord and it’s probably A minor”. And, well, he said this. Not a good night for Drake: The Bud Light boys are back Bud Light smartly recruited the two most Bud Light-y of celebrities – longtime rep Post “Solo cup on stage” Malone and comedian Shane “hold my beer” Gillis – for this year’s spot, fittingly set in an archetypical suburban cul-de-sac. The message? Bud Light lets dudes be dudes. Somehow this successfully toes the line between “America, fuck yeah!” and “actually could be fun”. Häagen-Dazs slows it down Fast and Furious fam Vin Diesel, Michelle Rodriguez and Ludacris slow down thanks to the smooth jams of Smokey Robinson and an ice-cream bar. There are shades of a 2000s-era Viagra commercial thanks to the mood music, Pacific Coast Highway locale and vintage car. Kieran Culkin is baby beluga Kieran Culkin, the former Succession star on the awards circuit this year for playing a very Kieran Culkin character, appears here as a very Kieran Culkin character who is also a financially savvy beluga whale. I think this counts as part of the Oscar campaign? Go away, Doja Cat In a year that’s more stuffed with celebrity ads than usual, a rather funny use here of a rather funny Doja Cat forcing her way into Taco Bell’s celebrity-free Super Bowl ad. Get her on SNL! Jurassic World: Rebirth While the Jurassic World movies might have failed to reach the lofty heights of Jurassic Park, I’d argue they were mostly more successful than the two films that followed it. That, some hard-to-shake nostalgia and the pairing of Scarlett Johansson and Mahershala Ali make it difficult not to get just a bit excited about the still completely unnecessary Jurassic World: Rebirth. The new spot is essentially a remix of the recent trailer but then that was a remix of everything that came before anyway. It appears that someone briefly crashed Kendrick’s performance with a Palestinian flag with the words Sudan and Gaza written on it, even getting on the set’s GNX car. According to Guardian sports editor Bryan Graham, who is at the game, the person waved the flag for about 45 seconds before security guards tackled them. Tipsy on sugar Shaboozey might not have won any Grammy awards for his monster hit Tipsy but he did get the chance to sing It’s a Wonderful World in a Super Bowl ad for Nerds gummy clusters, so every cloud … Kendrick really will not give Drake a break, even taking a fresh swipe at him during the show. “I want to perform their favorite song, but you know they love to sue,” he said during one tease of Not Like Us, referring to Drake’s defamation lawsuit over the track. Even abridged and censored, the song was still an astonishing W for the rap beef. Even rumored former Drake paramour Serena Williams was on stage for the occasion. Naturally, it also lit up the internet. Nate Bargatze balls out for DoorDash Nate Bargatze is on a roll – after hosting Saturday Night Live for the second time this fall, and thus being one of the more famous standup comics in America, he’s now applying his dry humor to a Super Bowl ad in support of DoorDash’s rewards program. My main question is: where did he get this Met Gala-worthy robe? Matthew McConaughey vouches for good AI Another commercial break, another celebrity vouching for some version of AI – in this case, Matthew McConaughey gets stranded in the rain because his booking app doesn’t use Salesforce’s AI assistant Agentforce, while Woody Harrelson has a nice dry meal. An attempt to assuage fears with folksiness, as McConaughey assures it’s “what AI was meant to be”. Also if Samuel L Jackson turning up wasn’t enough of a surprise… And here are some closer looks at Kendrick’s show-stopping performance (with guests): Was it just me, or did that show feel like it flew by? Kendrick ends on a high note with a shoutout to Compton and his collaborator, Mustard, for the GNX track tv off. Kendrick and was confident and in command throughout, SZA sounded amazing, the act was a political statement in its existence – a solid Super Bowl half-time show. Here’s that moment: Oh, he’s really teasing and dragging out the intro to Not Like Us, this must feel good. “They tried to rig the game but you can’t fake influence,” he says before launching into the hit of last year. Well, it happened. We heard “hey Drake, I hear you like ’em young” at the Super Bowl, along with tens of thousands trilling “A minorrrrrr”. Kendrick is bouncing between the eras – Damn, GNX (he teases Not Like Us, but not yet!), then slows it down with SZA for Luther and their Black Panther hit All the Stars. All smooth and mesmerizing so far. Oh hell yeah, Jackson once again appears to mock so many criticisms of rap music – “too loud, too reckless, too ghetto” – before Kendrick goes into Humble, with his red, white and blue dancers forming an American flag of Black faces. That’s quite an image. Alright, alright, Kendrick is here. Samuel “Uncle Sam” Jackson introduces the one and only Kendrick, who starts a cappella on a GNX before he brings out a team of coordinated dancers and a statement – “The revolution about to be televised, you picked the right time but the wrong guy” – before launching into Squabble UP. Let’s goooooo. OK, we’re minutes away from Kendrick’s half-time show, and we can see behind the commentators that a GNX is now at midfield, the platform is being wiped down, the smoke is billowing, the lights are going down … almost go time! If there’s any remaining doubt about whether Kendrick’s going to perform Not Like Us in a few minutes: they cranked it up for the crowd while the stage crew set up for his show … With the statement released, Drake is as far away as possible (Australia) wearing … this (swipe for the boots): Drake has spoken! Ahead of Kendrick’s half-time performance, in which he will almost certainly sing his Drake diss track to a 100-plus million people, the Canadian rapper released a statement doubling down on his claim of defamation: For reference, Drake has sued his and Kendrick’s label, Universal Music Group – not Kendrick himself – accusing the company or prioritizing profits, for a hit song calling him a pedophile, over the truth/his mental health. Welcome to Magic Mike’s Wrexham Stōk Cold Brew’s first Super Bowl ad (is this the go-to grocery store coffee now?), invokes the power of franchise brands: Ryan Reynolds and Rob McElhenney’s Wrexham football club and, more entertainingly, Magic Mike. Good to know Channing Tatum’s still game and still got it. Nike convenes the female all-stars This one’s for the girls! Nike recruits a stacked roster – Sha’Carri Richardson, Caitlin Clark and Jordan Chiles, among others – for a spot roasting all the criticisms people will lob at female athletes. Such as: you can’t be too ambitious, fill a stadium, be too emotional, etc. Some sick shots of Chiles doing gymnastics. Co-signing and cc-ing Hellmann’s: Glen Powell’s pickup truck fairytale Glen Powell, a proud Texan and one of Hollywood’s It boys, appeals to his base: women and men who love trucks (especially the Dodge Ram). Powell is so game for anything that this revisionist fairytale of a man and his three bear-ish trucks is actually pretty charming. Kendrick Lamar’s gig as the half-time show performer arrives at an unprecedentedly great time for the Compton-bred rapper, and a very bad time for Drake. The two stars’ rap beef last year lit up the charts and the culture; last week, Kendrick stomped the nail in the coffin by winning not one but five Grammys for his diss track Not Like Us, a masterpiece of studied hater energy. I will not soon forget the image of Kendrick accepting his song of the year award as the crowd trilled “A minorrrrrr”. It only gets worse for Drake, because it’s likely a stadium full of people will sing that line tonight. There’s almost no way Kendrick, who guested during Dr Dre’s half-time hip-hop bonanza three years ago, will leave the summer smash off the setlist. As for what else to expect … Collaborator SZA is confirmed to make an appearance. And in a rare interview with Apple Music, Kendrick promised “storytelling” – be that on Drake or, more likely, in support of Compton and Black America, we shall have to wait and see. A horse walks into a bar Super Bowl regulars Budweiser here to teach us that every young horse’s childhood dream is to help people drink cheap watery beer. Inspiring! Pringles makes moustaches fly Another ad with flying facial hair? The always welcome Adam Brody sounds the empty Pringles can alarm, accidentally transforming many a famous moustache (Nick Offerman, Andy Reid) into a disconcerting facial hair moth-like thing. When Harry Met Hellman’s A “how have they not done this yet?” moment from Hellman’s, in which Meg Ryan and Billy Crystal revive the famous Katz’s deli scene from When Harry Met Sally. Sydney Sweeney steps in for the role of the “I’ll have what she’s having” granny. So that reported Open AI ad for ChatGPT has aired – a simple black and white design in pointillist dots, because “all progress has a starting point”. It frames ChatGPT as a tool for human expression, asking “what do you want to create next?” Which is … an interesting framing. Poor Kendrick getting drenched in Gatorade here by one of tonight’s special guests, SZA. Impressive calm: Nestle gets tongues dancing Nestle’s first-time Super Bowl spot for Coffee Mate is a now rare thing: an ad without a celebrity. At least, a visible one – an off-screen Shania Twain gets saddled with a jingle about a tongue left dancing from allegedly delicious cold foam. Cooking for aliens One of the laziest pick-up-the-cheque-and-run celebrity ads of the night has Gordon Ramsay being told he needs to cook for some foodie aliens before discovering that a) their hi-tech frying pans are in fact HexClad, a brand he already uses, and b) their leader is Pete Davidson. Worse than it sounds! It’s a big day for SZA fans – earlier today, ahead of her appearance during Kendrick Lamar’s half-time show, she released four new songs off Lana, the deluxe edition of her Grammy-winning album SOS. The new tracks – Joni (featuring Don Toliver), Take You Down, Open Arms (just SZA) and PSA – are basically updated version of songs that have been floating around for awhile, but still, a win for SZA fans. As a football game, the Super Bowl has stayed pretty consistent in recent years – the Chiefs versus someone. As a spectacle of American capitalism, it has ballooned. The price of a 30-second spot this year – let alone the celebrities featured in them – surpassed $8m, a new record for America’s most-watched game. Pre-game ads are also busting the bank, going for a reported $4m or so. That’s not the inevitable growth of inflation; just six years ago, the spots were becoming difficult to sell, the attention not seen as entirely worth the price. But the rise of diffuse streaming platforms means the rare opportunity for millions upon millions of eyeballs looking at the same thing at once – and advertisers are paying for it. Google’s AI goes for the heart The night’s requisite tearjerker, about a man using Google’s Gemini AI voicebot to help him prep for a job interview after years off the market as a stay-at-home dad. One of the lasting images from last week’s Grammys: a prolific hater salutes a fellow prolific hater, as his diss track wins song of the year. The Super Bowl is an almost assured victory lap for infamous grudge holders Taylor Swift and Kendrick Lamar, regardless of the outcome of the game. Issa Rae does her taxes Issa Rae drives backwards down a highway to correctly point out that taxes suck and are unnecessarily confusing – the solution being TurboTax. She also gets to play “is it cake?” with a box of forms. Celebs celebing together: Uber Eats orders all the celebs Last year, Uber Eats reunited Jennifer Aniston and David Schwimmer for a Ross and Rachel-themed spot, this time it flexes that celebrity budget again with Matthew McConaughey as a conspiracy theorist who believes that football was invented to sell people food – with cameos from Kevin Bacon, Charli xcx, Martha Stewart and Greta Gerwig. Only for salty freaks Who new Ritz had such game? The saltiest cracker brand has hired the saltiest of celebrities – Aubrey Plaza and Michael Shannon – for their new Super Bowl spot, trying to outdo each other, only to be met with a very smiley Bad Bunny, breaking the rules. One of tonight’s better ideas and smarter use of celebrities. Like presumably half the viewers this evening, we have eyes on Taylor Swift, who is in her private zone with Ice Spice, the Haim sisters and her family: Wearing bedazzled (lol) jean shorts with white leather boots: Making meme-ories already: And a full look at TNT’s fits – she is at least true to her style with the thigh-high boots, oversized jacket and cut-off denim. Tom Brady and Snoop Dogg say no to hate Tom Brady and Snoop Dogg list reasons people hate – because you’re from a different neighborhood, look different, act different, are different – in this spot that calls for people to “stand up to hate”. A nice message, to be sure, though quite hypocritical given that it’s on behalf of the Foundation to Combat Antisemitism – a group founded by Patriots owner and noted Zionist Robert Kraft, who has blamed protests against Israel’s invasion of Gaza, which has killed an estimated 60,000 people, on “disinformation” and conflated Palestine with Hamas. Coors has a bad case of the Mondays An ad that might make you rethink that last beer from Coors, about sloths at work the day after the Super Bowl, perhaps one of the Monday-ist Mondays of the year. Food Avengers assemble A pretty smart ad here from app Instacart that turns a standard shopping list into a range of characters storming their way to your day. There’s the Jolly Green Giant, the Kool-Aid Man and even a cameo from the shirtless Old Spice guy Isaiah Mustafa, making us all feel guilty for how much of that dip we’ve already eaten. Tripping on Baja Blast Here’s what I’m getting from this Mountain Dew ad: drink enough Baja Blast and you’ll trip so hard you imagine Seal (the singer) as a seal (the marine mammal) crooning the 1995 hit and dentist office standard Kiss from a Rose – er, lime, in this case. Barry Keoghan’s donkey gets a website In a cute and clever spot that capitalizes on both Irish accents and latent goodwill for all Irish donkeys, Squarespace reunites the two breakout stars of 2022’s The Banshees of Inisherin: Barry Keoghan and Jenny the Donkey (justice for Jenny!). Except Jenny is actually Don Mosley the donkey, seeking a publicist and agent via his new website. A lot of futurist ads and American propaganda already this evening. And fittingly, T-Mobile has backed away from celebrities for a primetime spot touting its partnership with Elon Musk’s Starlink, which promises to bring satellite connections to all of the cellular dead zones in the US. Likely won’t be the only ad helping out a tech billionaire this evening! Michelob’s Ultra pickleball players My favorite spot of the night so far, because there is no better pair of actors to play to deceptively serious, deviously talented pickleball players than Catherina O’Hara and Willem Dafoe. A delight from start to trophy finish. Thunderbolts Disney also teased its other big summer bet Thunderbolts with a 30-second version of a brand new trailer that’s just been released online. “The Avengers are not coming” says Julia Louis-Dreyfus’s Wario-ed Nick Fury at the start of the preview for the sorta antiheroes assemble caper (technically not true given that a new Avengers film has been given the green light) before a series of quips, explosions and an ironically used 80s pop song are trotted out to hopefully lure Deadpool fans to their local cinema this May. Meta tries distraction How should Meta distract users from Mark Zuckerberg’s cozy embrace of Trump, nixing of DEI programs and factchecking services on the platform, and very weird comments about masculinity? How about a Super Bowl ad for Meta’s Ray-Ban smart glasses, featuring Chris Hemsworth and Chris Pratt perusing (and destroying) Kris Jenner’s art collection? Barrymore and Bloom make small talk Drew Barrymore and Orlando Bloom come together, and compare accents (how to say schedule, etc), for MSC Cruises How to Train Your Dragon Maybe one of the least necessary animated-to-live-action transfers we’ve been lumped with for a while, the How to Train Your Dragon spot doesn’t offer anything we didn’t already expect and haven’t already seen before. It feels like the original wasn’t all that long ago and with the dragon looking essentially the same in both, it’s a struggle to know why we’re here again. Eugene Levy loses his eyebrows Little Caesars’s Crazy Puffs are so eyebrow-raising delectable that they cause Eugene Levy’s famously strong brows to fly right off his face like a gray, distinguished moth – which makes for images more unnerving than appealing. Lilo and Stitch Disney deserves some reluctant credit here for creating a Super Bowl ad that doesn’t just resemble a condensed trailer, turning something eye-rollingly predictable (a live-action Lilo &amp; Stitch) into an advert we're actually surprised by. The 30-second spot has the once-animated, now CG monster invade the pitch, helping to kick off a campaign that will most likely make the most of all Fox and Disney channels in the next few months. Ben Affleck doubles down for Dunkin’ Aaaand the first commercial of the game goes to Ben Affleck, who would like you to forget that last year he did his Dunkin’ spot with one Jennifer Lopez … but not that he’s forever and always from Boston. This first clip is actually part of a seven-minute short film called DunKings 2, featuring his brother Casey, former Patriots coach Bill Belichick, Belichick’s 24-year-old girlfriend and Jeremy Strong, poking fun at his Serious Actor reputation. And here’s that aforementioned Lady Gaga performance: Mission: Impossible – The Final Reckoning There are many many restarts this summer – Final Destination, Fantastic Four, Jurassic World – but there is one major end. Just don’t tell Tom Cruise. What is now being marketed as the last Mission: Impossible film was once supposed to be the second part of the seventh yet underwhelming box office has changed both title and strategy with Paramount hoping, reportedly against its star’s wishes, to wrap things up. This new spot pushes that selling point hard, a sad goodbye for one of the only consistently enjoyable franchises we have. She did say So High School … And one final performance from another noted New Orleans performer – Jon Batiste delivers a spirited and upbeat national anthem with a little jazz flavor, accompanied by a beautifully painted piano and, naturally (because America), fighter jets. Still rolling through the music performances prior to kickoff – Trombone Shorty and contemporary Christian singer Lauren Daigle, both natives of Louisiana, perform a jazzy version of America the Beautiful. Much more successful than Fergie’s infamously jazzy national anthem. An especially star-studded Super Bowl this year! Missouri native Jon Hamm introduces the Kansas City Chiefs and noted Philly fan Bradley Cooper brings in his hometown Philadelphia Eagles. And that’s it from us on the teams in this game! More celebs! In fact, more celebs than usual at the Super Bowl? Here’s that very patriotic Brad Pitt ad: Now we’re on to a musical celebration of New Orleans, from jazz to hip-hop, marching big brass bands to bounce, featuring Harry Connick, Jr (and the voice of New Orleans cultural icon Big Freedia). A hype way to start the evening, and convincing that New Orleans is a premiere US city for live music. On a pure name recognition level, the two most famous people in attendance tonight are Taylor Swift and Donald Trump. One very much wants to be associated with the other, and one would love to have her name out of his mouth. A brief rundown of their terse relations: Trump, you may recall, published an AI-generated fake endorsement from Swift last summer. The singer – who avoided politics entirely until 2018 and remains loath to make a statement – then supported Kamala Harris with a very Taylor Instagram post calling out said fake endorsement. Trump then posted on Truth Social: “I HATE TAYLOR SWIFT.” So I would not expect them to interact tonight, nor would I want to see it. A pre-recorded video paying tribute to the resilience and community of New Orleans in the face of the recent tragic truck attack in January. Lady Gaga, all in white, is performing an emotional performance of her Top Gun: Maverick theme to a crowd of locals and some football celebrities. It’s a smart way to nod to recent events and provide a rousing kickoff to tonight’s events. Video to come soon … Brad Pitt is making sure you know that football is culture. The actor just showed up in a PSA for … the Super Bowl? That was essentially a rambling collage of American propaganda. Appearing in New Orleans – an interesting choice, given the many issues with homes his foundation built there post-Katrina – Pitt waxes poetic on the football huddle as “a metaphor for our history” along with many platitudes on American unity, for a game Donald Trump is attending. Planes, trains and Oikos A planes, trains and automobiles theme from Dannon’s Oikos Greek yoghurt: Juno Temple carries Cleveland Browns defensive end Miles Garrett on her back through a busy terminal so he can catch his plane on time. Remember when Super Bowl advertisers tried very hard to convince people to buy into crypto? (Tom Brady would love you to forget.) Or the year with weird Scientology ads? This year, the mainstream normalization push is for AI. Several companies, including Google, Meta and Salesforce, will have spots touting their AI ventures. And OpenAI, makers of ChatGPT, will purportedly have their first Big Game ad, assumedly to make generative AI seem less scary to the average American consumer. We just had a pretty stirring performance from Ledisi of Lift Every Voice and Sing. Given the NFL’s decision to remove the “END RACISM” logos from the end zones, it’s somewhat surprising the league kept on with the song – one of their big concessions to come out of Colin Kaepernick kneeling to bring awareness to social justice and the Black Lives Matter movement. Kendrick vs Drake! Taylor vs Trump! That team vs that other team! Here’s a look at what you can expect from tonight: Spotted: one Taylor Swift. Outfit judgment forthcoming. Ahead of the game, in the latest move of what is shaping up to be the greatest Oscar campaign in recent memory, Timotheé Chalamet managed to get in a car with Kendrick Lamar to talk shop. And be a fan boy, of course. Full clip below: There are multiple non-football celebrities already in attendance, close-ish the normies. More to come … Kendrick gave a rare interview this week with Apple Music if you want to look for some clues of what to expect from tonight’s performance: It’s that time of year once again for our sports brethren to focus on the big game and for us to focus on everything else. The Super Bowl is of course primarily about football, but for us it’s about the culture surrounding it. This year will see a more star-packed bundle of expensive ads than ever before with celebrities such as Charli xcx and Ben Affleck, the re-appearance of Taylor Swift and whichever big-name friends she brings along, and, most importantly, recent Grammy winner Kendrick Lamar taking over the half-time show. It’s set to be an exciting night for many Americans and a hellish night for one Canadian (will Lamar perform his controversial Drake diss track to the biggest crowd of his life?) and we will be here to cover every little non-sport moment of the night, so stay tuned.",
        "web_url": "https://www.theguardian.com/culture/live/2025/feb/09/super-bowl-kendrick-lamar-the-ads-taylor-swift-and-everything-but-the-football-live",
        "pub_date": "2025-02-10T03:38:52Z",
        "section_name": "Culture",
        "tags": [
            "Culture",
            "Super Bowl LIX",
            "Super Bowl",
            "Kendrick Lamar",
            "Media",
            "Taylor Swift",
            "Music",
            "NFL",
            "Sport",
            "US sports",
            "Advertising",
            "Film",
            "US television",
            "SZA",
            "Rap",
            "Hip-hop"
        ]
    },
    {
        "headline": "Kendrick Lamar’s Super Bowl half-time show review – game over for Drake",
        "trailText": "The Pulitzer prize-winning rapper chose artistry over more obvious showmanship in an unusual set yet still delivered the final blow to his diss track nemesis",
        "bodyText": "The Super Bowl half-time show is Plato’s perfect form of pomp and ceremony, a corporate-sponsored, highly choreographed musical performance used to entice people who don’t follow the NFL into watching TV in order to secure even higher ad fees from Doritos and Dunkin’ Donuts. Over the years it has provided moments of great spectacle: Prince playing Purple Rain in the rain, Rihanna announcing her pregnancy flanked by hundreds of sperm-looking dancers in duvet drip – but it’s never been a site of serious artistry. Its biggest controversies – Janet Jackson’s nip slip, MIA’s middle finger – have been teenage in their puerility. Could that change with the arrival to the Super Bowl stage of Lamar, one of this decade’s great public intellectuals – a Pulitzer prize-winning rapper who has transformed the possibilities of hip-hop? It’s an unlikely match for the NFL in an ordinary year, but performing in front of a president who has attacked intellectualism, Black activism and the communities in which Lamar was raised, it felt momentous before it even began. But Lamar was not necessarily looking to make a statement. He’s in the most mischievous part of his career and at the crest of his mainstream popularity: in 2024 he released a series of dueling diss tracks with Drake, which culminated in Not Like Us – a song that spent the summer atop the Billboard 200 and repeatedly and specifically calls Drake a paedophile. It’s a joyous song of defiance, but one with a churlish undertone that doesn’t fit with the Super Bowl’s inclusivity. So which Kendrick would be arriving in New Orleans? The prophet or the provocateur? In the end we got flavours of both, with an uneven but ambitious set that was arguably the most esoteric in the Super Bowl’s history, perhaps at the expense of landing a knockout blow. It began with Samuel L Jackson as Uncle Sam, playing the American machine that berated Lamar: “It’s your Uncle Sam, and this is the great American game!” Lamar began the show atop a 1987 Buick Grand National GNX, the rare car for which his album is named. He performed an unreleased and unnamed track, known on the Kendrick Lamar subreddit as Bodies, an early sign that he wasn’t in New Orleans to play crowd pleasers. His outfit also spoke to a sense of self-possession: he wore a varsity jacket by the British designer Martine Rose and the most incredible pair of boot cut jeans – something straight off the rack from mid-00s American Eagle. The set warmed up with Squabble Up and Humble as dancers flooded the stage dressed in red, white and blue tracksuits, a nod both to the Americana of the occasion and potentially a moment of unity between Compton’s two rival gangs. When the all-Black dance cast started to interplay to form the American flag, it was a moment that felt weighted with significance as Trump looked on (and was rumoured to have left shortly after). As Uncle Sam Jackson yelled at Lamar that he was “too loud, too reckless, too ghetto” (perhaps in a precursor to how this set will be reviewed in red states), Lamar moved into an expansive set that resembled a tarmac Compton street corner, another impressive set that was reminiscent of Es Devlin’s Compton street corner that Lamar performed on with Dr Dre, Snoop Dogg and Eminem at the Super Bowl two years ago. It felt at times more like a Lincoln Center play than a half-time show, with dense layered flows and an interplay of dance, Jackson’s spoken-word moments and Lamar album tracks that didn’t always combine to make an obvious point. Lamar is able to deploy one of the greatest flows in the history of rap, but the onslaught of complex verses didn’t always work in this arena and you occasionally longed for a rousing anthem like Alright or Bitch, Don’t Kill My Vibe. But things changed halfway through the set when he teased Not Like Us, in a funny interplay with four female dancers. As the opening bars of the song played over the PA, Kendrick joked: “I want to perform their favorite song, but you know they love to sue,” a reference to Drake’s ongoing defamation lawsuit against the pair’s shared record label, Universal Music. In the week leading up to the Super Bowl there were some rumours that the lawsuit would prevent the song being performed. And for a moment it seemed like it might be. Instead of launching into it, he played Luther and All the Stars, his pair of songs with SZA, whose soaring vocal gave the set a more layered atmosphere and useful counterbalance. Jackson even acknowledged that these more melodic numbers would appease doubting sports fans at home: “That’s what America wants – nice and calm,” he shouted. But then Kendrick slammed on the brakes and swerved in the opposite direction, finally unleashing Not Like Us and it felt euphoric. He revealed a maniacal grin, looking straight down the camera as he said: “Hey Drake”, before launching into his ruinous screed. He did tone down some of the harshest blows – self-censoring the word “paedophile”, likely at both his lawyers’ and censors’ request – but still screeched the devastating lyric: “Tryna strike a chord and it’s probably A minor”, flanked by huge flags that showed small children pointing to a lower-case A. As a final jibe, Serena Williams, an ex-girlfriend of Drake, was seen crip-walking by a lamp post. The Chiefs might have been losing by 27 points at half-time, but it was Drake at that moment who was the biggest loser in North America. Kendrick himself has always seen himself more as an eyewitness than an activist – or as he put it on Family Ties: “I been duckin’ the social gimmicks / I been duckin’ the overnight activists.” This was a classy, intelligent set that chose artistry over easily meme-able moments. Instead the most obvious protest was not seen on TV but in the stadium, as someone managed to join the throng and raise a Palestinian and Sudanese flag atop Kendrick’s GNX. One of the most intriguing things about Lamar is you’ll never know if the protester was storming the stage or a planned part of the set.",
        "web_url": "https://www.theguardian.com/music/2025/feb/09/kendrick-lamars-super-bowl-half-time-show-review-game-over-for-drake",
        "pub_date": "2025-02-10T03:31:07Z",
        "section_name": "Music",
        "tags": [
            "Kendrick Lamar",
            "Super Bowl LIX",
            "Music",
            "Rap",
            "SZA",
            "Hip-hop",
            "Super Bowl",
            "Culture",
            "US sports",
            "US news"
        ]
    },
    {
        "headline": "Grammys 2025: the winners, the losers, the performances – as it happened",
        "trailText": "This liveblog is now closed.",
        "bodyText": "Wow, what a ride. This year’s Grammys felt both five hours and 40 minutes long, a mostly smooth affair that was assumedly a relief to organizers – homage paid to first responders, LA consistently shouted out and no one can say Beyoncé was snubbed again. The Cowboy Carter artist was a sparse presence at the show but emerged gracious and triumphant, winning best country album – the first Black female artist to do so – and album of the year. Intentionally or not, the Grammys spread the love around this year – Kendrick Lamar won the most awards of the evening with five, followed by Beyoncé and Charli xcx with three each. Plenty of time went to celebrating a diverse crop of new artists – Sabrina Carpenter, Doechii and best new artist winner Chappell Roan, among others – as well as the resilience of wildfire survivors. Four hours, nine awards, many tributes and one very bad night for Drake later, the Grammys are through. Thanks for sticking with us! See you next year. Here’s my colleague Benjamin Lee’s nice wrap of the evening: Obligatory post on infamously enthusiastic attendee Taylor Swift’s award show: trying brat and catching Janelle Monae’s jacket. In case you missed it, here’s a snippet from Charli xcx’s performance of Guess, once again answering the question “what is Brat?” Most of the awards weren’t televised tonight – only nine made the broadcast – so my colleague Benjamin Lee helpfully compiled a full list of winners: Here’s Beyoncé’s brief yet poignant acceptance speech for album of the year, with Blue Ivy in tow. As Trevor Noah said: finally! Thank god – Beyoncé is FINALLY an album of the year Grammy winner, for Cowboy Carter. There’s a sense of relief to this win, for an artist who long ago deserved it, and is now only the fourth Black female artist to win it. Beyoncé, accompanied on stage by her daughter Blue Ivy (how is she this grown?!), keeps it short and sweet: “I just feel very full and very honored,” she said. “It’s been many, many years and I just want to thank the Grammys, every songwriter, every collaborator, every producer, all the hard work.” And she offered a special final dedication to Black country trailblazer Linda Martell – “I hope we just keep pushing forward, opening doors,” she said. “God bless y’all.” There’s one final, poignant tribute for the evening, as dozens of Los Angeles firefighters present the award for album of the year. Fire chief Anthony Marrone thanked first responders “who came from near and far” to battle the flames. “Their selfless acts of courage and commitment were nothing short of inspiring,” he said. “I am confident that we will recover and rebuild together, because we are LA strong.” He got the longest standing ovation of the evening, of course. Brat was the dominant music story of the year, the ultimate album cycle and meme of 2024, and Charli xcx was rewarded with the final performance of the night at the Grammys. It’s a very Charli performance – a car, sunglasses, strutting, underwear, a shout out to Julia Fox (it’s apparently her birthday). Von Dutch and Guess (with Billie Eilish, though not on stage here) go hard at the club, and it sort of translates here. The Grammys brought out an icon for this one: Diana Ross, who pondered: “how can we have the balance of celebrating and being filled with sorrow?” before handing Kendrick Lamar – who has swept his categories tonight – for song of the year. “I’m starstruck,” he said, before passing off to his collaborators, all from Compton. “All the west coast artists, man,” he added. “This is what it’s about, man, because at the end of the day, there’s nothing more powerful than rap music.” “We are music,” he added. Also: “Respect the art form.” It truly only gets worse for Drake. We’re reaching the end of the night, but not before the Dr Dre Global Impact award, presented by Queen Latifah to Alicia Keys for her work as a singer, musician, producer, Keep a Child Alive charity and efforts to expand opportunities for women in music. Keys “is a constant inspiration, through her voice, her talent, but most importantly through her heart”, said Latifah of the 17-time Grammy winner, including today for musical theater album. Keys was especially excited to be acknowledged as a producer. “I always had to fight for a certain level of respect as a songwriter and composer and especially as a producer,” she said. “Female producers have always powered the industry. “This is for all the ladies that know the magic that they bring to the room,” she added before a shout out to diversity. “DEI is not a threat, it’s a gift,” she said to cheers. “And the more voices, the more powerful the sound. “When destructive forces try to burn us down, we rise from the ashes like a phoenix and as you’ve seen tonight, music is the universal language that connects us all,” she added. “Let’s keep showing up with compassion, empathy … the dream of the world as it ought to be, as the great Toni Morrison said.” As introduced by Gloria Estefan (!!), Shakira reminds us why she’s been at this for nearly 30 years. With a lengthy, tour de force performance of bellydancing, choreography and songs from her Grammy-winning album Las Mujeres Ya No Lloran, she makes the case for being a living Latin legend. If Beyoncé had to lose – and presenter Miley Cyrus seemed determined that she wouldn’t – then at least she lost to collaborator Kendrick Lamar, for his Drake diss track (!) turned global smash Not Like Us. Lamar, a Compton native, was all smiles and all about LA: “We gonna dedicate this one to the city – Compton, Watts, Long Beach, Inglewood, Hollywood out to the Valley,” he said. “This is my neck of the woods that’s held me down since I was a young pup … I can’t give enough thanks to these places that I’ve rolled around in since high school.” The survivors of the fires are “a true testament” that “we will rebuild this city”, he added. Pointedly no mention of Drake, which I imagine makes this even tougher for Drake. In case you missed it, here’s Chappell Roan’s full speech, probably the most powerful and pointed of the evening so far. Music executives take note. We’ve made it to the in memoriam segment, led by Coldplay’s Chris Martin. It’s always stirring, with nods this year to Kris Kristofferson, Marianne Faithfull, Phil Lesh and more, but I have to say – kicking off the tribute with footage of One Direction’s Liam Payne, who died in October at just 31, especially got to me. Lady Gaga and Bruno Mars win for Die With a Smile, a smash in some circles. The perhaps unlikely duo seem genuinely affectionate for each other, singing each other’s praises – “Gaga, I’m so honored to be part of this song with you,” said Mars. “I’m so honored to be a small part of your giant musical legacy.” “Bruno, you are an incredible human being, you are a musician for the ages,” Gaga added. Gaga also added a pointed statement to the public: “Trans people are not invisible,” she said. “Trans people deserve love. The queer community deserves to be lifted up. Music is love.” Enough said. For those also confused by the Mastercard commercial that was maybe also Lady Gaga’s return to pop form – it was indeed the music video for her new single Abracadabra. The whole thing, in service of hew upcoming album Mayhem, just dropped on Youtube: We’re still tributing Jones, with country artist Lainey Wilson and musician Jacob Collier providing a slightly less smooth follow-up to Cynthia Erivo, before passing the baton to Stevie Wonder, back at the piano bench with Hancock. “Quincy was always there to help,” he said, remembering how Jones organized the recording session for 1985 aid anthem We Are the World, which Wonder performed with singers from Pasadena Waldorf school and Palisades Charter high school, two schools lost to the fires. And then Smith returns to tell a story about how Jones, the executive producer of the Fresh Prince of Bel-Air, once scolded him for not providing better food for the TV show crew. Jones’s mantra was, according to Smith: “It is your job to take care of these people. And I’ve done everything I can throughout my career to live up to Quincy’s demand.” “Quincy Jones always took care of people. And that’s how he fed the world,” he added, before passing to the final leg of the tribute: Janelle Monae energetically riffing on arguably Jones’s most famous production work – Michael Jackson’s Thriller. Cue Taylor Swift dancing. We’re on to the tributes section of the evening, with a whole segment dedicated to the late Quincy Jones, who died in November 2024 at age 91. Will Smith (in his first major awards appearance since … you know) remembered Jones as “one of the most groundbreaking and influential figures of our times”. A producer, arranger, film &amp; television composer, recording artist and conductor, among other roles, Jones “made so many music greats across multiple genres sound even greater, bringing the best out in legends” from Ray Charles to Ella Fitzgerald to Frank Sinatra. On that note, Cynthia Erivo delivers a gorgeous rendition of Sinatra’s Fly Me to the Moon. Accompanied on piano by the legendary Herbie Hancock and a full jazz orchestra, she even gets Beyoncé grooving along. We’re about two-thirds of the way through – I know, it’s hard to tell when there’s only been five awards – and so far, this seems like another big night for the women of music. Female artists – Doechii, Sabrina Carpenter, Chappell Roan, Shakira and Beyoncé – have won all of the televised awards so far, a year after Taylor Swift, Billie Eilish and SZA dominated the Grammys telecast. Remember when former academy president Neil Portnow said female artists needed to “step up”? Well. It’s nice to see the Grammys come around. Another superstar combo (and Super Bowl halftime show reunion) as Jennifer Lopez presents best Latin pop album to Shakira. The Colombian singer dedicated the win to “my immigrant brothers and sisters in this country. “You are loved, you are worth it. I will always fight with you,” she said in one of just a few direct political statements tonight. “And to all of those women who work really hard every day to provide for your families – you are the true she wolves.” The recording academy is very delighted that the Weeknd decided to perform, settling his public criticism of the Grammys, at least for now. I admittedly didn’t recognize these songs on first listen, as they’re from his new album Hurry Up Tomorrow, the final edition of his After Hours trilogy released this weekend. We’re a little over halfway through the show, and Harvey Mason Jr, the CEO of the recording academy, is here to giveeveryone a vibe check. Mason, who took over the academy during the tumult of 2020, said he “wanted the organization to change and modernize so we could be better and serve this dynamic and global music community”. But he faced some challenges, such as when the Weeknd blasted the Grammys for lack of transparency over their nominations process. Mason may have been stung, but “I heard him. I felt his conviction,” he said, because “what we all want is an organization dedicated to the wellbeing of all music makers”. This is the part of the show where the recording academy touts itself, but Mason does note some real changes: new advocacy groups for Black, LGBTQ+ and female artists, as well as a younger and more diverse voting base, with 66% new membership. Enough change that even the Weeknd decided to grace the Grammys with his presence again. Including that video interlude and the Lady Gaga – Bruno Mars tribute, the Grammys have mostly made good on their promise to prioritize wildfire relief and celebrate LA’s resilience. Some commercial breaks have contained segments dedicated to local businesses impacted by the fires, such as a local floral shop destroyed by the Altadena fire near Pasadena which is already rebuilding. And a QR code has frequently appeared on screen linking to a site for wildfire relief donations. “I thought what Chappell said there was absolutely beautiful,” said Trevor Noah, transitioning to a very, very serious note on the wildfires. Noah reminded the audience to remember what happened, then introduced a video showing it – charred homes, lost possessions, many tears. Bruno Mars and Lady Gaga follow up with a … very committed rendition of The Mamas &amp; the Papas’ California Dreamin’. No surprise here – Chappell Roan, last year’s breakout star on the festival circuit, is this year’s best new artist. Wearing a princess hat and carrying a journal, the 26-year-old used her time to call for record labels to provide better wages and healthcare to up-and-coming artists, recalling the time just a few years ago when she was dropped by her label and couldn’t afford healthcare. “If my label would have prioritized artists’ health, I could have been provided care by a company I was giving everything to,” she said. “Labels, we got you, but do you got us?” It was a powerful moment that got a standing ovation – full speech forthcoming. And South London artist Raye brings this new artist medley home with a jazz-inflected, classically showstopping performance. The successful songwriter – who has penned tracks for Charli xcx, John Legend, Rita Ora, Jennifer Lopez, Little Mix, Beyoncé and more – has seemingly cemented her status as a singer in her own right, with a lengthy standing ovation and a nod by Trevor Noah. Continuing this genre tour of best new artist nominees, Teddy Swims delivers a soulful rendition of his hit Lose Control before passing the baton to Shaboozey and his country smash Bar Song (Tipsy). The (admittedly loose) interpolation J-Kwon’s 2004 banger Tipsy, which was inescapable last summer, brings everyone including Jennifer Lopez to their feet. Next up is Doechii, with a school girl-themed performance of Denial is a River. The newly minted best rap album winner demonstrated some virtuosic rapping – enough to earn a standing ovation from Jay Z, a visible “oh my god!” from Billie Eilish and an enthusiastic cheer from SZA. We’re onto a showcase for the best new artist category – first up is Benson Boone, the 22-year-old singer of Beautiful Things who seems to be making an appeal to women a few decades older, as Heidi Klum and Nikki Glaser assisted his costume reveal. His octave-spanning performance did draw a standing ovation from J Lo … Well well well, the Grammys must be pleased to have this collision of superstars, as Taylor Swift presents Beyoncé with the award for best country album. Beyoncé, the winning-est Grammy artist of all time, although famously locked out of major awards, seemed genuinely shocked to win for an album made, in part, in response to the treatment she received at the 2016 CMA Awards. “Wow, I really was not expecting this,” she said. “I want to thank God that I’m able to still do what I love after so many years.” Now the first Black woman to win a country music Grammy in over 50 years, Beyoncé also thanked “all of the incredible country artists who accepted this album” and her family (Blue is in attendance!). “I think sometimes genre is a codeword to keep us in our place as artists,” she added, “and I want to encourage people to do what they are passionate about and stay persistent.” Olivia Rodrigo introduces tonight’s third best new artist frontrunner (along with Sabrina Carpenter and Doechii): Chappell Roan, whom Rodrigo knew when Roan was still a struggling artist working at a donut shop in LA’s Highland Park. With a rodeo clown-themed performance that involved, naturally, a jumbo pink pony, the Willard, Missouri, native sang Pink Pony Club – a song she recorded and released in 2021 before getting dropped by her label and working at said donut shop. The song, as she said in a pre-recorded segment, is a “love letter to LA”, a place that “gave me the courage to be myself”. Everything is coming up roses for Sabrina Carpenter, who wins best pop vocal album in a stacked category that included Billie Eilish, Taylor Swift, Ariana Grande and fellow best new artist nominee Chappell Roan. “I really was not expecting this,” said Carpenter, still out of breath from her performance a few minutes ago. She thanked her mom “for driving me to every voice lesson”, her dad, sisters and all the producers on Short n’ Sweet. Carpenter also shouted out LA, as did presenters Chad Smith and Anthony Kiedis of the Red Hot Chili Peppers, who sang an a cappella section of Under the Bridge in tribute to their home city. Oh wow, a huge win for the women of rap and the up-and-comers: Doechii, the 26-year-old Florida-based rapper also nominated for best new artist, wins best album, as presented by an on-form Cardi B. “I don’t want to make this long but this category was introduced in 1989 and two women have won – three women have won! – Lauryn Hill, Cardi B and Doechii,” she said through tears. The “Swamp Princess” thanked her mother, with whom she shared the stage, as well as her hometown of Tampa, Florida. “Whenever people think about Florida, they think about Miami but … there’s so much talent in Tampa,” she said. And she ended with a triumphant call to Black women: “I’m telling you, you can do it. Anything is possible … you are exactly who you need to be to be right where you are and I am a testimony.” 2024 was a massive year for the pop girls, and Sabrina Carpenter reminds everyone why. The pint-sized best new artist nominee, one of the breakout stars of the year, brought her pin-up style to the Grammys for a jazzy, characteristically cheeky take on her summer smash Espresso and follow-up Please Please Please with a set inspired by – naturally – Gentlemen Prefer Blondes. It’s fitting for tonight’s theme that the first nominee performance of the evening comes from local legends Billie Eilish and Finneas, the siblings from Highland Park. The duo and a band perform their inescapable hit Birds of a Feather with an LA-based background, which (unsurprisingly) gets Taylor Swift to her feet and ends with a sweet note of “I love you, LA.” Following Doors, Noah gets right back on the mic to answer everyone’s burning question: is Beyoncé here? Not yet, but maybe soon? “Yes, Beyoncé will be here tonight,” he said. “Well, I hope she’ll be here. I can’t make her do anything.” Roving about the crowd, particularly hovering around Taylor Swift and Chappell Roan, Noah took the lightest of digs at the night’s big stars, starting with the biggest. Beyoncé has 11 nominations and just announced her 2025 Cowboy Carter tour: “Beyoncé, there’s tariffs,” said Noah. “We can’t afford a new tour. Maple syrup is about to be $50.” Noah joked about the “power of AI”: “maybe one day, we could get another Rihanna album” – and Swift’s Eras Tour. “She got more Americans traveling than those Turkish hair transplants,” he joked. And he alluded to Trump’s presidency as “changes” in Washington DC. “I’m going to enjoy tonight, because this may be the last time I’m allowed to host anything in this country,” he joked. Well … oof. And we’re off! Host Trevor Noah kicks things off by acknowledging the elephant in the room: it’s weird to have an award show in LA so close to the devastating wildfires. “This city has just been through one of the largest natural disasters in American history,” he said. Thanks to heroic firefighters, “the fires have now been contained”, he continued. “And despite all the devastation, the spirit of the city has endured.” Noah summarily explained the mission of the evening: celebrate music, yes, but also “the city that brought us so much of that music”. He shouted out the LA inspirations for hometown heroes Billie Eilish and Snoop Dogg, as well as Chappell Roan and Stevie Wonder, before introducing local band Doors, who lost multiple homes and their studio in the fires, for an opening performance with an all-star band including John Legend, Sheryl Crow, St Vincent, Brad Paisley and Brittany Howard. Repeating the mantra “We Love LA,” they bring the crowd to their feet. Tonight will feature a starry tribute to Quincy Jones who died last November. Here’s a look back to a great tribute from Alexis Petridis: It’s close to show time, so the A-list pop stars are finally here, led by Taylor Swift in a sparkly red mini dress reminiscent of her Eras Tour stage costumes. Best new artist nominees making the most of their Grammy moment: Also a banner year of country-pop crossovers, continuing on the red carpet (no Beyoncé yet!) This video of returning host Trevor Noah getting ready for the night is less interesting for his preparation and more for the slight seating chart reveals … A banner year for the women of pop continues on the red carpet: Will Beyonce finally win album of the year? Who will be named best “new” artist out of Sabrina Carpenter and Chappell Roan? Can Kendrick Lamar piss Drake off even more? Here’s the Guardian’s Ben Beaumont-Thomas having a guess: Well, we seem to have a winner for most baffling red carpet outfit … Jaden Smith and his head/housepiece. After teasing and then delaying a big announcement (a result of the wildfires), tonight’s most-nominated star, Beyoncé, has now officially revealed that she will be going on tour this year to support her most recent album, Cowboy Carter. Here’s the teaser she released on Instagram: If there’s one thing the Grammys love, it’s a controversial award choice – despite a decade-plus worth of abuse allegations outlined a recent documentary, the recording academy gave Chris Brown the award for best R&amp;B album for 11:11. The film, Chris Brown: A History of Violence, includes testimony from a woman who sued Brown for sexual assault in 2022 and explicitly asks why he is still embraced by fans and the music industry. Brown has sued Warner Bros Discovery over the film, claiming defamation. There will also likely be blowback over noted transphobe Dave Chappelle’s win for best comedy album, his third win in a row in that category and sixth overall. The majority of tonight’s winners have been revealed before the official ceremony kicks off, as is the weird way of the Grammys. There’s an awful lot to burn through so perhaps it’s a relief for those of us in for the long-haul. Here are some of the winners we have so far: Best dance/electronic music album Charli xcx – Brat Best pop solo performance Sabrina Carpenter – Espresso Best rock performance The Beatles – Now and Then Best rap performance Kendrick Lamar – Not Like Us Best country duo/group performance Beyoncé featuring Miley Cyrus – II Most Wanted Best dance pop recording Charli xcx – Von Dutch Best R&amp;B song SZA – Saturn Best rock album The Rolling Stones – Hackney Diamonds Best dance/electronic recording Justice and Tame Impala – Neverender It was a question asked by many within the industry: will the Grammys still go ahead? The Oscar nominations were delayed twice and the Critics Choice awards postponed, but the Recording Academy has stuck to the original date, hoping the night can act as a moment of coming together for an industry hugely affected by the wildfires. Here’s a bit more about what to expect from an unusual ceremony: The red carpet is open and the musicians are here – welcome to the 67th annual Grammy awards, live from the Crypto.com arena (formerly and forever the Staples Center) in Los Angeles. This year promises to be a bit more somber than usual, as the Grammys take place just a couple weeks after wildfires devastated the city. After some debate over whether to postpone the ceremony, the recording academy decided to let the show go on, albeit with a “renewed sense of purpose” and fundraising efforts. As for the awards, of which there will be few in the music-heavy telecast – Beyoncé leads the night with 11 nominations for Cowboy Carter, followed by Kendrick Lamar, Charli xcx, Post Malone and Billie Eilish with seven each. Will Beyoncé finally win album of the year? Will Brat summer dominance continue? How will the vibes be on this edition of “music’s biggest night”? Stick with us for all the highlights.",
        "web_url": "https://www.theguardian.com/music/live/2025/feb/02/grammy-awards-2025-winners-losers-latest",
        "pub_date": "2025-02-03T05:24:07Z",
        "section_name": "Music",
        "tags": [
            "Grammy awards 2025",
            "Music",
            "Culture",
            "Grammys",
            "Beyoncé",
            "Charli xcx",
            "Chappell Roan",
            "Sabrina Carpenter",
            "Billie Eilish",
            "Kendrick Lamar",
            "Awards and prizes",
            "Taylor Swift",
            "SZA"
        ]
    }
]