[
    {
        "headline": "Teddy Swims: I’ve Tried Everything But Therapy (Part 2) review – extra-size emotion",
        "trailText": "The huge-voiced Atlantan behind last year’s megahit Lose Control is back, and in love, on this unignorable, playlist-pleasing follow-up",
        "bodyText": "Teddy Swims’s Lose Control has become a generational, unavoidable hit. Billboard declared it the top single of 2024; it refuses to leave the UK charts after 14 months. Impressively, his 2023 album I’ve Tried Everything But Therapy (Part 1) backed up its promise, testament to the 32-year-old Atlantan’s skill at crafting sympathetic settings for his stunning, gale-force voice. Hozier sings Adele is his default setting, which will never lose anyone money. And Teddy gives it everything. If he’s trapped in a glass case of emotion, it’s the size and weight of the Shard. Although, as soulfully weathered as his crooning gets, it has little of that genuine, binman-in-a-bear-trap pain of singers such as Jelly Roll. That was fine on Part 1, which detailed Swims’s entanglement in an unhealthy relationship. The sunshine in his voice seasoned his professed unhappiness with a pleasantly odd bathos. Sadly, Teddy has since fallen in love. Part 2 feels more corporate, with its genre-hopping, playlist-pleasing songs and much gusty whimpering about how great his girlfriend is. Still, Funeral, Bad Dreams, Hammer to the Heart and Not Your Man are as good as this brand of pop gets. Swims will be inescapable for a time yet.",
        "web_url": "https://www.theguardian.com/music/2025/jan/31/teddy-swims-ive-tried-everything-but-therapy-part-2-review-extra-size-emotion",
        "pub_date": "2025-01-31T12:00:27Z",
        "section_name": "Music",
        "tags": [
            "Pop and rock",
            "Music",
            "Culture"
        ]
    },
    {
        "headline": "Teddy Swims: I’ve Tried Everything But Therapy (Part 2) review – retro soul with a retro lyrical attitude",
        "trailText": "The soft-alpha streaming sensation behind Lose Control returns with more of the same Motown and Stax pastiches, with the odd diversion into soft rock",
        "bodyText": "While Brat summer grabbed the headlines as 2024’s defining musical movement, a straighter, more masculine, less lurid green development was rumbling in the background. Defined by American men with big voices, big emotions and big streaming numbers, it gave the world Benson Boone’s Beautiful Things (1.7bn streams on Spotify alone), Noah Kahan’s Stick Season (1.3bn) and Teddy Swims’ Lose Control (1.4bn). While the messy Brat defined a summer, the soft-alpha era is seemingly here for the long term. The most interesting of the trio is Swims, a heavily tattooed former frontman of a post-hardcore band who now sings retro soul as if auditioning for Mark Ronson’s band circa 2007. This sequel to 2023’s Part 1 (home to US chart-topper Lose Control) continues to churn out immaculately crafted Motown and Stax pastiches, with Funeral and the mellower Your Kind of Crazy built on warm piano trills, loping drums and stacked backing vocals. Alongside stomping opener Not Your Man, they highlight Swims’ occasional lyrical shortcomings: in his world, women are unknowable, often wicked tricksters who are just too damn easy to love. Much better are the brief forays into an airier, soft-rock sound, specifically on single Bad Dreams and the lilting It Ain’t Easy, which recalls Fleetwood Mac’s Dreams. But this isn’t an album designed to creep up on you: songs like the Lewis Capaldi-worthy ballad Northern Lights and the bludgeoning Hammer to the Heart have been manufactured for streaming and radio ubiquity. For the moment, Swims seems happy to ride the crest of this wave; whether he can pivot when people move on is unclear.",
        "web_url": "https://www.theguardian.com/music/2025/jan/24/teddy-swims-ive-tried-everything-but-therapy-part-2-review",
        "pub_date": "2025-01-24T08:00:05Z",
        "section_name": "Music",
        "tags": [
            "Music",
            "Culture",
            "Pop and rock",
            "Soul"
        ]
    }
]