[
    {
        "headline": "The Weeknd postpones new album ‘out of respect and concern’ for LA residents",
        "trailText": "The musician also cancelled a one-off Los Angeles show due to the fires, while Beyoncé has delayed an announcement – but the Grammys will go ahead",
        "bodyText": "The Weeknd has pushed the release of his new album, Hurry Up Tomorrow, because of the California wildfires, as well as cancelling a one-off performance at the city’s Rose Bowl venue on 25 January “out of respect and concern for the people of LA county”. Hurry Up Tomorrow was due for release on 24 January. It will now arrive a week later on 31 January. “This city has always been a profound source of inspiration for me, and my thoughts are with everyone impacted during this difficult time,” the musician, AKA Abel Tesfaye, said in a statement posted to Instagram. Hurry Up Tomorrow is the sixth album by the Weeknd, the final part of a trilogy alongside After Hours and Dawn FM – and purportedly the last album under Tesfaye’s stage name. “As the Weeknd, I’ve said everything I can say,” Tesfaye told W magazine in 2023. “I’ll still make music, maybe as Abel, maybe as the Weeknd. But I still want to kill the Weeknd. And I will. Eventually. I’m definitely trying to shed that skin and be reborn.” The album is set to feature Playboi Carti, Anitta, Max Martin and Pharrell Williams among others. Tesfaye’s focus now, he wrote in a statement, “remains on supporting the recovery of these communities and aiding its incredible people as they rebuild”. Tesfaye’s XO Humanitarian Fund has previously donated $4.5m (£3.7m) to hunger relief efforts in Gaza. As LA firefighters prepare for dangerous winds to return and further fan the disastrous wildfires, Beyoncé has also delayed an announcement planned for 14 January. “I continue to pray for healing and rebuilding for the families suffering from trauma and loss,” she said in a statement. “We are so blessed to have brave first responders who continue to work tirelessly to protect the Los Angeles community.” The musician called for people to join her BeyGood foundation in supporting the victims of the fire after it donated $2.5m to fire relief efforts. Meanwhile the Grammy awards ceremony, set to take place at LA’s Crypto.com arena, will continue on 2 February as planned, Recording Academy Group CEO Harvey Mason Jr confirmed. “This year’s show, however, will carry a renewed sense of purpose,” said Mason Jr, “raising additional funds to support wildfire relief efforts and honouring the bravery and dedication of first responders who risk their lives to protect ours.” Universal Music Group posted that it would cancel all of the label’s Grammy-related events, including artists showcases and parties, and redirect the resources to efforts to support those affected by the fires.",
        "web_url": "https://www.theguardian.com/music/2025/jan/14/the-weeknd-postpones-new-album-los-angeles-wildfires-beyonce-grammys",
        "pub_date": "2025-01-14T10:06:31Z",
        "section_name": "Music",
        "tags": [
            "The Weeknd",
            "Music",
            "Culture",
            "Los Angeles",
            "US news",
            "Beyoncé",
            "Grammys",
            "California wildfires",
            "Pop and rock"
        ]
    },
    {
        "headline": "The Weeknd: Hurry Up Tomorrow review – a record that will floor you … and drive you up the wall",
        "trailText": "On a somewhat exhausting sixth album, Abel Tesfaye uses Brazilian funk, punishing house and lush 70s soul to press great songs into the service of rotten lyrics",
        "bodyText": "It takes precisely 20 seconds for the Weeknd’s sixth album to imply that it might also be his last. “All I have is my legacy … I’m all alone when it fades to black,” Abel Tesfaye sings over a lush bed of synthesisers that quickly takes on the influence of 80s boogie. It’s a line that feels very on brand. Hurry Up Tomorrow’s release has been promoted with billboards declaring “THE END IS NEAR”, social media posts in which Tesfaye has inferred the album is the final “beautiful chapter” in his story and interviews during which he’s suggested that a 2022 incident in which he lost his voice on stage was some kind of cosmic message: “You can end it now … when is the right time to leave if not at your peak?” It is perhaps worth noting that the same was true of his last album more-or-less: 2022’s Dawn FM was rich with end-times imagery, mentions of the afterlife and arrived accompanied by interviews in which Tesfaye announced his desire to “remove the Weeknd from the world”. A cynic might suggest that implying he’s about to retire – or at least retire the Weeknd persona that he has inhabited for the last 13 years – now seems part of his release strategy. In fairness, it feels a lot more explicit this time around. One theory is that Tesfaye is more interested in pursuing a career in film, something viewers of The Idol, the abysmal drama series he co-wrote and starred in in 2023, might consider less of a career move than a terrible threat. Still, it’s not a theory Hurry Up Tomorrow does much to dispel. It lasts as long as a movie – nearly 90 minutes – and it’s rich in samples from soundtracks: Giorgio Moroder’s score for Scarface, David Lynch’s Eraserhead. It also comes accompanied by a full-length feature film, once more co-written by and starring Tesfaye (Oh, good). In addition, while there are umpteen covers featuring different artwork, the version that has been punted out to streaming services looks remarkably like a movie poster. A close up of Tesfaye’s face, sweaty and grimacing, it’s both striking and mysterious: he could be on stage, in agony or in the throes of passion. Equally, he could just be suffering the after-effects of last night’s chicken phall. Or he could have been reading Hurry Up Tomorrow’s lyrics, which are enough to bring anyone out in a sweaty grimace. There are moments when they slip into standard Weeknd mode, alternately predatory and injured – “She’s addicted to the rush … she trust me with her life” etc – but they are primarily concerned with telling you how awful it is being rich and famous. That’s a tough sell at the best of times, although, in recent years, the charts have played host to a number of pop albums that have painted a very convincing picture of 21st-century celebrity’s downside, Billie Eilish’s Happier Than Ever and Olivia Rodrigo’s Guts among them. But a striking depiction of a panic attack on Baptized in Fear aside, Hurry Up Tomorrow really doesn’t boast their lyrical depth or nuance. You’re left feeling that Tesfaye deserves some kind of kudos just for singing a line as bad as “in this penthouse prison, I’m alone” with a straight face; likewise the song in which he admonishes a lover for complaining with a petulant little stamp of “you know it’s my opening night!” or Reflections Laughing’s wail: “I’m trapped inside a gilded cage.” Indeed, it is occasionally so on the nose you wonder if it might not be treating the subject with a certain degree of knowing camp, as when Enjoy the Show features a voicemail message inquiring about the star’s welfare, accompanied by a soundtrack of drinks being slurped, pills rattling, lungfuls of smoke being inhaled and suspicious sniffing. Arch or sincere, it becomes fairly exhausting over the course of an hour and half. It would be more exhausting still if the music on Hurry Up Tomorrow wasn’t as great as it is. Tesfaye has described the album’s sound as “Frankenstein”, and you sometimes see what he means. São Paulo jumps from Brazilian funk to a punishing house pulse midway through, Given Up on Me stitches together a lot of jarring fragments into an entirely gripping whole: a slowed-down, Auto-Tuned sample of Nina Simone’s Wild Is the Wind; a sped up sliver of 70s soul; beatless, chopped-up piano chords. But even at its most straightforward, it’s marked out by brilliantly turned melodies and fantastic production touches: the George Harrison-esque guitar that runs throughout Reflections Laughing; the rubbery bassline of I Can’t Wait to Get There, the stew of sickly sounding electronics and lush 70s soul-inspired backing vocals on Big Sleep. It’s a peculiar sensation: an album that floors you at the same time as it’s driving you up the wall. It goes all out for a blockbuster ending, courtesy of two big ballads. Without a Warning has a certain end-credits quality, but it concludes with the sound of an audience screaming and cheering, as if demanding an encore. They duly get one with the blockbusting title track, which has a sparkling melody, a vaguely Purple Rain-ish grandeur and really does sound like a leave-taking: “I’m ready for the end … I have no more fights left to win.” Off he goes, perhaps permanently, leaving behind an album that frequently presses great songs into the service of rotten lyrics. Suggesting that the Weeknd has run out of stuff to say but not impressive ways of saying itmanages to make you think his apparently imminent departure is a shame – and probably just as well.",
        "web_url": "https://www.theguardian.com/music/2025/jan/31/the-weeknd-hurry-up-tomorrow-review-a-record-that-will-floor-you-and-drive-you-up-the-wall",
        "pub_date": "2025-01-31T15:47:58Z",
        "section_name": "Music",
        "tags": [
            "The Weeknd",
            "Music",
            "Culture",
            "Pop and rock",
            "R&B"
        ]
    },
    {
        "headline": "No Dylan but loads of Coldplay! What the songs with a billion streams on Spotify tell us about music taste today",
        "trailText": "Spotify’s Billions Club tracks the world’s most popular songs, but dozens of greats are nowhere to be found. From TikTok to TV soundtracks, we explore the forces shaping pop’s new canon",
        "bodyText": "In 2011, Jacob Rubeck and Nick Rattigan were living in a basement in Reno, Nevada, and thinking about starting a band. One afternoon, Rubeck came up with a frisky Strokes-like guitar riff, Rattigan whipped up the melody and lyrics and Surf Curse’s Freaks was born. “We wrote the song in like 30 minutes,” the singer says. A catchy song about alienation and longing, Freaks was released in 2013 and became a raucous highlight of their live shows but didn’t trouble the wider world until 2021, when it was discovered, out of the blue, by TikTok users. Its Spotify streams kept going up and up and up, until last March it passed a remarkable milestone. Unlike Bob Dylan, Bruce Springsteen, Pink Floyd or Prince, Surf Curse can claim membership of Spotify’s Billions Club, the running playlist of every song to have achieved 1bn streams. They are not sure how to feel about that. “There is a lot of impostor syndrome,” says Rattigan. “It’s very surreal. I’ve ignored it to the biggest extent that I could.” For Rubeck: “Sometimes it makes sense and sometimes it doesn’t. It feels good that a kid can see an indie-rock band from Reno, Nevada, be able to reach that – but it took a lot of weirdness to get to that point. Do you really deserve to be up there with these songs that have existed for the past 50 or 60 years?” Recently, I became obsessed with the Billions Club playlist and the story it tells about the nature of popularity in the streaming era. Drake’s One Dance became the first song to hit a billion streams on Spotify in October 2016, but Billions Club didn’t launch until June 2021, with about 150 songs. Forbes called it music’s “new class system” and it remains fairly exclusive. On 16 January 2025, it featured 857 songs, 131 of which had ascended to the Two Billions Club and 17 to the Three Billions Club. The Four Billions Club is an intimate affair, comprising only the Weeknd’s Blinding Lights and Ed Sheeran’s Shape of You. Spotify has now made the clubs a marketing tool: earlier this month, Spotify launched a film of the inaugural Billions Club Live show with the Weeknd, to celebrate him becoming the first artist to rack up 25 entries (he has since added another). For most of the history of popular music, it was impossible to measure the popularity of songs over time. The Top 40 told you how singles were selling in a given week, but there was no way of measuring their staying power. Album sales illustrated longevity but not which tracks were getting the most plays. Classic rock and “adult contemporary” radio established a canon but only request shows were driven by listeners. It took the emergence of transparent streaming data in the 2010s to make clear, in real time, exactly which songs people around the world were listening to. Spotify is a facilitator rather than a bystander in this. Given that it champions certain music through opaque recommendation algorithms, editorial playlists and paid-for features that allow artists to make their music more visible, this newly forming canon is not exactly neutral. The highly public streaming metrics have their own problems – these stats are often quoted in toxic wars between stans or used to humiliate underperforming stars. But with Spotify the market leader in music streaming, these metrics are as close to a mirror of public taste as we are likely to get in an atomised online era. *** The Billions Club is now expanding exponentially, doubling in size over the past 18 months. As it grows, it will fill in some glaring omissions, but it is fascinatingly odd. Many of pop’s most familiar songs – Imagine, Jolene, Blue Monday, Get Ur Freak On – have not made it yet. The Beatles, Rolling Stones, Led Zeppelin, U2 and Abba have one song apiece. Michael Jackson, whose Thriller is the biggest-selling album of all time, has just two, as does the golden age of Motown. Roll them all together and they still have fewer entries than Imagine Dragons. What a strange impression of pop’s history you would glean from the Billions Club. Madonna, for example, would exist only as the second featured artist on the Weeknd’s Popular; Stevie Wonder as no more than a Coolio sample; and Bob Dylan as simply the writer of an Adele hit. Beyoncé and Jackson would appear less significant than the Swedish singer Zara Larsson; Radiohead and REM would mean less to the evolution of rock than Måneskin, Italy’s winners of the 2021 Eurovision. “When I see that a song like Bridge Over Troubled Water hasn’t passed a billion, I feel bad,” laughs Quebec singer–songwriter Patrick Watson, whose Je Te Laisserai des Mots recently became the first French-language song to hit a billion. Written for the 2009 film Mères et Filles, it is a delicate constellation of piano, cello and French crooning. “My biggest songs are usually the ones I’m not too crazy about,” says Watson. “I thought: nobody’s going to listen to this. And I was right for years.” Before it went viral on TikTok during the pandemic, it had just 1m streams. “I can’t swallow those numbers,” Watson continues. “I appreciate it, but it’s hard to own it as an accomplishment.” The main reason for these weird numbers is that Spotify’s user base still skews relatively young, with more than three-quarters of the playlist released since the company’s US launch in 2011. After the Weeknd, the most dominant artists are Ariana Grande, Drake, Bad Bunny and Justin Bieber. The album with the most entries (seven) is Olivia Rodrigo’s Sour. The leading veterans are Coldplay and Eminem with 12 songs each, spanning more than 20 years. (No song released before 2011 has been streamed more than Coldplay’s Yellow.) Conversely, XXXTentacion, the Florida rapper who was killed in 2018 at the age of 20, released 10 billion-streamers in the space of 13 months. Appearances by Tones &amp; I, Gotye, and Lilly Wood and the Prick prove that the one-hit wonder is alive and well. So far, so predictable. Things get more interesting when songs predate streaming and have to rack up listeners decades after their chart heyday. The only three entries released before 1961 are Christmas songs, which are evergreen. But would you have guessed that the defining band of the 1960s, according to Spotify listeners, would be Creedence Clearwater Revival, with three of the decade’s 13 entries? Or that the fourth biggest song of the 1990s would be the Goo Goo Dolls’ anguished power ballad Iris? The Billions Club sometimes aligns with the traditional metrics of popularity. Its leading 20th-century songs are Queen’s Bohemian Rhapsody( the UK’s third biggest-selling single ever) and the Police’s Every Breath You Take (officially the most-played song in radio history). Juggernaut albums such as Fleetwood Mac’s Rumours (1977), Guns N’ Roses’ Appetite for Destruction (1987) and Red Hot Chili Peppers’ Californication (1999) roll on, spawning three entries each. It is striking that 481 songs fall between three and four minutes long, the time-honoured radio sweet spot. But younger listeners process the past in chaotic ways, scrambling chronology and context. Rock (with a marked American bias) is surprisingly enduring, from AC/DC to nu-metal; turn-of-the-millennium pop-rock hits such as Smash Mouth’s All Star and Jimmy Eat World’s The Middle sit alongside uncharacteristic US breakthroughs from Radiohead (Creep) and Blur (Song 2). However, many of pop’s biggest unit-shifters fall short when detached from their historical moment: Do They Know It’s Christmas?, Candle in the Wind ’97, (Everything I Do) I Do It for You, My Heart Will Go On, I Just Called to Say I Love You, I’ll Be Missing You, Blurred Lines. None of them is as popular as All I Want by Ireland’s Kodaline, which reached No 67 in 2013. *** Like any music platform – radio, MTV – Spotify’s systemic preferences can be exploited by artists. In contrasting ways, grabby two-minute rap songs and the “muted, mid-tempo and melancholy” utilitarian background music that Spotify critic Liz Pelly calls Spotifycore both target distracted online listeners. But this doesn’t yet register at the level of the Billions Club: whenever I tripped across a name I had never heard of, there turned out to be a real-world reason for its placement. One is that global listening figures capture the biggest regional hits, especially Spanish-language songs. Gata Only, a reggaeton hit by Chile’s FloyyMenor and Cris MJ, swept Latin America and continental Europe last summer without denting the UK Top 40. Another factor is shrewdly namechecked in Gata Only: “the rhythm of the TikTok”. During the 2020–21 lockdown, the video sharing platform began incubating numerous surprising obsessions with songs old and new, completely divorced from the usual machinery of promotion and radio play. TikTok hits are added to Spotify’s editorial playlists and picked up by its algorithm, accelerating a snowball effect. This explains such puzzling Billions Club members as young artists whose names read like fragments of automated passwords (d4vd, JVKE) and indie-rock records that took off years after release, including Lovers Rock by TV Girl (2014), Space Song by Beach House (2015) and Apocalypse by Cigarettes After Sex (2017). The time lag can be disorienting. By the time the Walters’ drowsy, bitter I Love You So (2014) went viral seven years later, the Chicago band had broken up and had to hastily reunite. Most artists cannot make a living from streaming and Spotify’s publicly visible tally of their streaming numbers can be dispiriting. For members of the streaming economy’s underpaid middle class, a billion-streamer is therefore akin to a winning lottery ticket. The virality of Surf Curse’s Freaks led to their first major-label deal and a financial windfall. “It’s dark magic,” says Rattigan. “We’re pretty lucky we got the whole song to trend. Some people only have 15 seconds.” He has an old-fashioned indie-rock suspicion of gaming the system. “One reason why these songs from 10 years ago hold so much weight is they were created out of a complete lack of awareness that they could be in that stratosphere.” Songs erupt on TikTok because they are useful, whether structurally (a dramatic beat drop facilitates video edits) or emotionally. The platform may be new but the fundamental appeal of indie songs by the likes of Cigarettes After Sex and Beach House would be recognised by fans of doo-wop or girl groups more than 60 years ago. Like Radiohead’s Creep or Noah Kahan’s morose Stick Season, the UK’s biggest song of 2024, they are soundtracks to teenage crushes and breakups, charged with the tuneful desperation of the unloved. My daughter told me she had cried to most of them. “The reason these songs are popular is they make people feel something,” she said. “People love to be sad. And when they’re sad they don’t want to feel alone.” One of her go-to heartbreakers is Watson’s billion-streamer, which has become a kind of emotional Esperanto, suitable for all manner of hard times. “During Covid I think people needed something that was simple and comforting,” Watson says. “There’s no bells and whistles.” The absence of context, while unhelpful in promoting his other material, has empowered this song. “A lot of music comes with the musician’s face on a billboard. Maybe this is like a person who doesn’t really exist is singing to people.” Watson’s second-biggest song, To Build a Home (with the Cinematic Orchestra), was popularised by TV and movie syncs, another key driver of virality. Neither Kate Bush nor the Clash would be in the Billions Club without Stranger Things. Florence + the Machine’s Dog Days Are Over owes its place to Marvel’s Guardians of the Galaxy, and reruns of Friends helped make With or Without You U2’s solitary entry. The Netflix show 13 Reasons Why catapulted four songs into the elite – Lord Huron’s doleful folk-rock reverie The Night We Met now somehow has more streams than Mr Brightside or Wonderwall. To return to the Goo Goo Dolls’ Iris, its success turns out to be down to a bunch of factors: this melodrama of unrequited love was written for the Nicolas Cage movie City of Angels, hammered by radio in 1998, revived by The X Factor in 2011, discovered by TikTok in 2021, then prominently featured in Deadpool &amp; Wolverine last year. Mystery solved. Yet there remains something pleasingly inscrutable about mega-popularity. A song might be propelled by a TikTok craze or a TV sync, then put into heavy rotation by Spotify’s recommendation machine, but it cannot enter the rarefied realm of billions unless vast numbers of people genuinely want to hear it over and over again. “I’ve realised that a good song is a good song,” says Rubeck. “The earworm still exists.” Watson, meanwhile, regularly hears from people who tell him that Je Te Laisserai des Mots helped them through hard times. “It’s incredible to participate in people’s lives on such a large scale,” he says. “Those are the things I keep. The rest doesn’t matter.” • This article was updated on 20 January to remove an incorrect data point regarding Wet Wet Wet.",
        "web_url": "https://www.theguardian.com/music/2025/jan/17/no-dylan-but-loads-of-coldplay-what-the-songs-with-a-billion-streams-on-spotify-tell-us-about-music-taste-today",
        "pub_date": "2025-01-17T08:00:26Z",
        "section_name": "Music",
        "tags": [
            "Music streaming",
            "Music",
            "Spotify",
            "Pop and rock",
            "Culture",
            "Digital music and audio",
            "The Weeknd"
        ]
    },
    {
        "headline": "Stevie Wonder, Oprah Winfrey, Paul McCartney and more pay tribute to Quincy Jones",
        "trailText": "Music and film stars celebrate late entertainment icon, with Wonder saying ‘Quincy should remembered as one of God’s greatest gifts to the world’<br><br>",
        "bodyText": "Stars including Will Smith, Oprah Winfrey and Stevie Wonder have paid tribute to Quincy Jones, who died this week aged 91. Following a career as a producer, multi-instrumentalist, conductor as well as a film producer, in 1990 Jones produced the sitcom The Fresh Prince of Bel-Air, which gave Smith his first ever acting role. Jones brokered the casting in an impromptu audition by Smith – then known purely as a rapper – to NBC executive Brandon Tartikoff at a party at Jones’s home, with a contract drawn up that night. “Quincy Jones is the true definition of a mentor, a father and a friend,” Smith wrote on Instagram. “He pointed me toward the greatest parts of myself. He defended me. He nurtured me. He encouraged me. He inspired me. He checked me when he needed to. He let me use his wings until mine were strong enough to fly.” The sitcom was a huge success, running for 148 episodes across six seasons until 1996. It was a launchpad for Smith as a leading man in Hollywood, ahead of hit films such as Independence Day, Men in Black and Hitch. Winfrey also acknowledged Jones’s hand in her career, after he recommended her for her first acting role in The Color Purple, which he co-produced and wrote the music for. “My life changed forever for the better after meeting him,” she wrote. “I had never experienced, nor have since, anyone whose heart was so filled with love. He walked around with his heart wide open, and he treated everybody as if they were the most important person he’d ever met. He was the Light. No shadows. He was love lived out loud in human form and he was the first person I ever loved unconditionally.” In a long tribute speaking to Rolling Stone, Wonder said: “He’s touched every single genre. It brings tears to my heart to think about how and where he came from and to know that he was able to grow through all of it. When I look at life every day and I think about how ignorant and irresponsible that people who don’t get it can be, I’m motivated to continue to talk about life, sing about it, and write about it, because that’s what Quincy did. He connected with people who had those great talents, and he was able to bring out of them the best … Quincy should remembered as one of God’s greatest gifts to the world.” Other stars adding their tributes to Jones include Paul McCartney, who worked with Jones on the Michael Jackson duet The Girl Is Mine, from Thriller. McCartney said Jones had “a twinkle in his eye and had a very positive, loving spirit which infected everyone who knew him … His long career stretches back to the early days when he was a trumpet player, then a band leader, then a producer of many great records. But it is as a friend I would like to remember him.” The Weeknd simply described him as “The Reason”, with another post saying: “My fans know how important Quincy was to the fabric of my music … Let’s celebrate his life today.” Elton John wrote: “Nobody had a career as incredible as Quincy Jones. He played with the best and he produced the best. What a guy. Loved him.” Lenny Kravitz wrote: “What a life. What an expression of authenticity. What a teacher. I am humbled that I was given the gift of your openness and friendship.” Earlier tributes came from the likes of Joe Biden, who called him a “musical genius who transformed the soul of America – one beat, one rhythm, and one rhyme at a time … Quincy Jones solidified Black culture as American culture”. Barack Obama also celebrated his life and work, additionally acknowledging how “Quincy paved the way for generations of Black executives to leave their mark on the entertainment business”.",
        "web_url": "https://www.theguardian.com/music/2024/nov/05/quincy-jones-tributes-will-smith-oprah-winfrey-paul-mccartney",
        "pub_date": "2024-11-05T08:30:32Z",
        "section_name": "Music",
        "tags": [
            "Quincy Jones",
            "Music",
            "Will Smith",
            "Film",
            "Oprah Winfrey",
            "Paul McCartney",
            "The Weeknd",
            "Stevie Wonder",
            "Joe Biden",
            "Barack Obama",
            "Culture",
            "US news"
        ]
    }
]