[
    {
        "headline": "Chappell Roan, Hozier and Travis Scott to headline Reading and Leeds for first time",
        "trailText": "Bring Me the Horizon, the Sheffield metal band who headlined the festival in 2022, complete the lineup",
        "bodyText": "Chappell Roan, the year’s breakout pop star, is to headline Reading and Leeds festival next year. The drag-indebted US songwriter had one of the biggest songs of the year in Good Luck, Babe! and her debut album The Rise and Fall of a Midwest Princess, released in 2023, has spent 24 consecutive weeks in the UK Top 10. Her performance is an English headline exclusive. She is joined by fellow Reading and Leeds first-time headliners Hozier, the Irish songwriter who scored his first UK No 1 album last year with Unreal Unearth, and US rapper Travis Scott, whose 2023 album Utopia is certified gold in the UK (100,000 units sold) and platinum (1,000,000) in the US. His performance is a European exclusive. Sheffield metal band Bring Me the Horizon complete the lineup. They previously headlined the festival in 2022. Last year, member Jordan Fish quit the group to pursue a career in production. Their latest album, Post Human: Nex Gen, received a five-star review from the Guardian, which called it “a defining album of our digitally overloaded era”. Both Hozier and Bring Me the Horizon are UK festival exclusives. Further down the bill are the rappers AJ Tracey, Blanco, Trippie Redd, Antony Szmierek and Lancey Foux; rock bands Enter Shikari, Amyl and the Sniffers, Good Kid, Soft Play, High Vis, Wallows, Sea Girls, Royel Otis, the Linda Lindas, Lambrini Girls, the Chats and Mannequin Pussy; indie-pop acts Wunderhorse, Conan Gray, Sofia Isella, Alessi Rose, Bilmuri, Suki Waterhouse, Nieve Ella, Luvcat, Lola Young and Del Water Gap; dance stars Becky Hill, Sammy Virji, DJ EZ, Issey Cross, Girls Don’t Sync and Rudim3ntal; indie mainstays the Kooks and Bloc Party – plus indie sleaze revivalists the Dare and Snow Strippers; and K-pop band Balming Tiger. Melvin Benn, the managing director of Festival Republic, which runs Reading and Leeds, said in a statement: “We’re witnessing an exciting wave of inspiring voices breaking through in pop culture, and this lineup captures that energy perfectly. This is one of the youngest average ages for headliners in years, and that’s very exciting in itself.” Reading takes place at Richfield Avenue; Leeds at Bramham Park. Both events take place 21-24 August 2025. The general presale opens at noon on 7 December, and the general sale at noon on 9 December.",
        "web_url": "https://www.theguardian.com/music/2024/dec/05/chappell-roan-hozier-and-travis-scott-to-headline-reading-and-leeds-for-first-time",
        "pub_date": "2024-12-05T19:15:33Z",
        "section_name": "Music",
        "tags": [
            "Reading and Leeds festival",
            "Festivals",
            "Culture",
            "Music",
            "Chappell Roan",
            "Travis Scott",
            "Bring Me the Horizon",
            "Pop and rock",
            "Rap",
            "Metal",
            "Music festivals"
        ]
    },
    {
        "headline": "Coachella 2025 lineup: Lady Gaga, Green Day, Post Malone and Travis Scott to headline in April",
        "trailText": "Other acts include Charli xcx, Megan Thee Stallion, Missy Elliott, Shaboozey and Blackpink members Jennie and Lisa",
        "bodyText": "Lady Gaga, Green Day, Post Malone and Travis Scott will headline Coachella 2025. Scott, whose prominent billing comes with the description “designs the desert”, will reportedly design an immersive experience called CatcusCon, Rolling Stone reported, and will perform after Green Day’s set on the Saturday nights. His appearance at Coachella comes five years after his aborted headline performance at the 2020 festival, which was cancelled due to Covid. He was then booked again for the 2022 festival, then removed from the lineup when 10 people died in a crowd crush at his Astroworld festival in 2021. This will be the second time Lady Gaga has headlined Coachella, having stepped in to replace Beyoncé in 2017 when she postponed her performance due to her pregnancy. Post Malone has performed at Coachella multiple times before but has never headlined. In their 37-year career, Green Day has never performed at Coachella, though Billie Joe Armstrong joined the Replacements on stage in 2014. “Death, taxes, and rock’n’roll,” Green Day frontman Billie Joe Armstrong told Rolling Stone. “In this world gone sideways, we know one thing for certain: rock’n’roll is forever, and its spirit is needed now more than ever. So bring your rage, your hope, and your loudest voice. Coachella, let’s have the time of our lives.” Other acts performing at Coachella next year include Megan Thee Stallion, Charli xcx, Missy Elliot, Benson Boone, the Prodigy, FKA twigs, Clairo, Sam Fender, Parcels, Blonde Redhead, Shaboozey, Amyl and the Sniffers, K-pop group Enhypen, children’s musical TV show Yo Gabba Gabba!, beabadoobee, and Blackpink members Jennie and Lisa, who will perform separately this year after performing together in 2023 as the first Asian and all-female act to ever headline Coachella. Last year’s Coachella headliners were Lana Del Rey, Tyler, the Creator, Doja Cat and No Doubt, but the festival saw its slowest ticket sales for a decade. Coachella will be held at its usual site, the Empire Polo Club in Indio, California, over two weekends in April: 11-13 April and 18-20 April.",
        "web_url": "https://www.theguardian.com/music/2024/nov/21/coachella-2025-lineup-announced-lady-gaga-green-day-post-malone-and-travis-scott-to-headline-in-april",
        "pub_date": "2024-11-20T23:58:55Z",
        "section_name": "Music",
        "tags": [
            "Coachella",
            "Festivals",
            "Music",
            "Travis Scott",
            "Culture",
            "California",
            "US news",
            "Lady Gaga",
            "Megan Thee Stallion",
            "West Coast",
            "Missy Elliott",
            "Green Day",
            "Post Malone"
        ]
    },
    {
        "headline": "Coachella 2025 highlights: a sweaty, star-packed year with thrills for all ages",
        "trailText": "Fans braved heat and high prices for Charli xcx, Lady Gaga, Megan Thee Stallion and a surprise by Queen Latifah",
        "bodyText": "Despite its reputation for bohemian escape – a music Disneyland for adults in the desert – Coachella can often feel like a gauntlet. The drive from Los Angeles to Indio will set you back anywhere from three to five hours, the lines even more; some campers endured 12-hour lines to access the site. A three-day general admissions pass went for a whopping $649 this year, $220 more than just five years ago, and that’s not counting money spent on lodging, food and outfits suitable for temp swings of 40F. No wonder over half of attendees this year were on payment plans. Unless Revolve is footing your bill, what 20-something can afford Coachella? Such was the latest strain of bad press for North America’s largest music festival, which – depending on who you talk to – is recovering from its flop year of depressed ticket sales in 2024. Whether the inflammatory headlines comparing it to Fyre Festival (wrong) or questioning gen Z’s financial literacy (fair) are out of genuine concern or Fomo-laced schadenfreude, Coachella is certainly in some form of identity shift, with the question of who it’s for, who attends and what it represents in palpable flux over the course of its first 2025 weekend. On the one hand, the festival draws a more international lineup and diverse crowd than its flower-crown reputation suggests; though it of course skews young, there were plenty of middle-aged adults (with, presumably, more robust bank accounts) mixed in with high schoolers, gaggles of shirtless men, college kids on drugs and the occasional baby with headphones on. On the other, well, it’s hard to walk more than a few feet in the rapidly browning grass without either interrupting a photo or being asked to take one, the festival’s appearance-oriented clientele still hopelessly tied to the ‘gram and the game of envy. But those who did make it were rewarded by solid sets and deep dehydration – temperatures reached a scorching 102F (39C) on Friday, making 2025 the hottest festival on record. “It’s hottttttttt … but it’s nice” rasped Djo, AKA Stranger Things’ Joe Keery, on Friday afternoon in a sweltering Mojave cool kids’ tent, attendees bopping to chill songs of existential ennui and anxiety while sweating through their shirts. “The weather’s not like this in England, I can tell you that,” lamented a miserable looking beabadoobee in the Sunday glare; the Filipino-British singer nonetheless turned out a winsome set of alt-rock shredding that recalled both Liz Phair and Michelle Branch. Good luck to anyone performing before 7pm, though the heat lent the whole affair a sense of survivors’ bonding – the sight of drummer Tré Cool sweating off his glitter eye shadow during Green Day’s Saturday night set, long after the sun went down, was perhaps the most representative image of a weekend that had many melting face. Rising temps met simmering discontent. Recession indicators abounded, from screaming to Green Day’s American Idiot (“I’m not part of a Maga agenda,” singer Billie Joe Armstrong ad-libbed), to Jimmy Eat World drenching the main stage in sweat and what is now dad rock, to Charli xcx’s unofficial headliner set of pure indie sleaze. Brat green outpaced crochet on Saturday, with the British artist drawing one of the biggest crowds of the weekend to watch her stunt through bangers only with Billie Eilish, Lorde and Troye Sivan, along with numerous celebrity fans; videos circulated of Timothée Chalamet and Kylie Jenner canoodling in the VIP area. Jenner’s ex Travis Scott served as the semi-billed fourth headliner of the weekend, with a late Saturday set that several people I met planned to cautiously attend, citing fears about the Astroworld disaster that went unmentioned. Styled as a modern-day gladiator, attacking the beat while nearly obscured by smoke, Scott’s set projected aggression without incident. Like last year, female artists saved Coachella from flopping, providing some of the biggest highs of the weekend. Charli’s party-girl energy gave way to party politics, with Clairo bringing out Bernie Sanders, fresh off a Fighting Oligarchy rally in LA, as a surprise guest. Sanders called on a queer-leaning gen Z crowd to “lead in the fight to combat climate change, protect women’s rights, and build an economy that works for all, not just the few” – at a festival whose CEO has donated extensively to Republican campaigns and anti-LGBTQ+ organizations. The Go-Go’s kicked off the festival with a set celebrating their 40+ years as punk leaders, proving youth is a mindset. And Lady Gaga’s instantly canonical set was worth the price of admission alone, once again demonstrating Coachella’s long transition into a major pop star festival in the wake of Beychella. I left my body at the sight of Gaga, haughty in queenly garb, transitioning from 2025 smash Abracadabra to 2011 hit Judas from on high. A year after Chappell Roan rocketed into the mainstream from the small Gobi stage, the South African star Tyla appeared ascendant on the Outdoor stage, holding the crowd’s focus with some of the loosest hips I’ve ever seen. The popheads then hustled across the grounds to Lisa – AKA Blackpink’s Lalisa Manobal – at Sahara, where she cemented her solo career with a slickly produced, eardrum-puncturing set that recalled Blackpink’s maximally hype headlining appearance two years ago. Her bandmate Jennie put an exclamation point on K-Pop’s inroads at Coachella on Sunday, all crisp choreography and heavy beats with a cowboy hat. Megan Thee Stallion, too, went cowgirl with boots, hat and leather for indisputably the hottest dancing of the weekend. Her set delivered some of the heaviest nostalgia hits as well – during Plan B, she brought out Queen Latifah to perform U.N.I.T.Y, her 1993 track also confronting disrespect of women’s bodies and choices, and Ciara to twerk for Goodies. Both incited massive crowd freak-outs, only slightly dampened by the festival cutting Megan’s mic for time. And Missy Elliott melted time for her festival debut with a set that, a few technical issues aside, appealed to the past and the future at once; Get Ur Freak On and bug glasses have confirmed made it to gen Z. Nostalgia, of course, powered a good portion of a festival that depends as much on drawing the veterans as the festival bros tripping at Sahara. “As an old person I love to see how much love these old bands are getting,” said a woman who appeared to be (gasp) 35 at an over-capacity crowd for Weezer’s Saturday set. Basement Jaxx and Kraftwerk, both running far behind schedule at an otherwise typically tight festival, reminded why they’ve long been on the Coachella lineup, back when the festival skewed heavily rock and electronic. T-Pain took attendees back to 2007 with an electrified version of Buy U a Drank that made walking through the crowd a battle against flailing limbs. Zedd portaled to 2013 with an extended version of Clarity, the high point of millennial-leaning set that brought out Maren Morris, John Mayer and Julia Michaels. Benson Boone, 22, explicitly channeling Freddie Mercury, brought out the 77-year-old Queen guitarist Brian May for Bohemian Rhapsody. And Post Malone and Shaboozey leaned into the nostalgia inherent in a country twang; the latter’s voice, rich and honeyed, drew a strikingly diverse crowd for a full sing-along to A Bar Song (Tipsy), which he premiered at Coachella last year to far fewer people. For a festival that often feels too slick for its own good, there were still some surprises. The little monsters of erstwhile Nickelodeon kids’ show Yo Gabba Gabba! delivered one of the most unexpectedly joyous and strange hours of the weekend – pure mascot mayhem, Duolingo owl included, for silly songs like Yummy In My Tummy, plus Weird Al and Flavor Flav for a ridiculously catchy number called I Love Bugs. That moment, vibing out to children’s song about centipedes and spiders, unlocked the secret of Coachella – find whatever escape hits enough to forget the enormous start-up costs and tiers of people getting better access than you, and it’s all worth it. That it took a children’s show performing to a room at least 50% on drugs to find it is as good an indicator as any that Coachella is in its quarter-life crisis era, trying a little of everything, cartoon monsters to Little Monsters, to see what sticks. • This article was amended on 15 April 2025. An earlier version identified Brian May as Queen’s drummer rather than the band’s guitarist.",
        "web_url": "https://www.theguardian.com/music/2025/apr/15/coachella-2025-stars-megan-thee-stallion-queen-latifah",
        "pub_date": "2025-04-15T15:00:38Z",
        "section_name": "Music",
        "tags": [
            "Coachella",
            "Festivals",
            "Music",
            "Culture",
            "Lady Gaga",
            "Bernie Sanders",
            "Post Malone",
            "Green Day",
            "Megan Thee Stallion",
            "Travis Scott",
            "Charli xcx"
        ]
    }
]